org/_posts/2019-06-23-sicp-chapter-4.org
#+BEGIN_EXPORT html
---
layout: page
title: SICP Chapter 4 Exercises & Solutions
excerpt: SICP Chapter 4
category: note
tags:
- sicp
- lisp
- exercises
- solutions
---
#+END_EXPORT
#+HTML_DOCTYPE: html5
#+OPTIONS: H:3

* 
  The HTML for this page has been automatically generated by parsing the loosely
  formatted source code & comments included in my solutions repository
  ([[https://github.com/zv/SICP-guile]]), if you encounter any unformatted
  solutions, you think you've spotted an error or you have something you'd like
  to share about the exercises, don't hesitate to leave a comment below
  (or a pull request on the source repo).
  
* Exercises Chapter 4

** Exercise 4.1
   #+begin_quote
   Notice that we cannot tell whether the metacircular evaluator evaluates operands
   from left to right or from right to left. Its evaluation order is inherited from
   the underlying Lisp: If the arguments to cons in list-of-values are evaluated
   from left to right, then list-of-values will evaluate operands from left to
   right; and if the arguments to cons are evaluated from right to left, then
   list-of-values will evaluate operands from right to left.

   Write a version of list-of-values that evaluates operands from left to right
   regardless of the order of evaluation in the underlying Lisp. Also write a
   version of list-of-values that evaluates operands from right to left.
   #+end_quote
   
*** Answer
    #+begin_src scheme
      (define (rtl-list-of-values exps env)
        (if (no-operands? exps) '()
            (let* ((left (zeval (first-operand exps) env) )
                   (right (rtl-list-of-values (rest-operands exps) env) ))
              (cons left right))))
    #+end_src
    
** Exercise 4.2
   #+begin_quote
   Louis Reasoner plans to reorder the cond clauses in eval so that the clause for
   procedure applications appears before the clause for assignments. He argues that
   this will make the interpreter more efficient: Since programs usually contain
   more applications than assignments, definitions, and so on, his modified eval
   will usually check fewer clauses than the original eval before identifying the
   type of an expression.

   1. What is wrong with Louis’s plan? (Hint: What will Louis’s evaluator do with the
   expression (define x 3)?)

   2. Louis is upset that his plan didn’t work. He is willing to go to any lengths to
   make his evaluator recognize procedure applications before it checks for most
   other kinds of expressions. Help him by changing the syntax of the evaluated
   language so that procedure applications start with call. For example, instead of
   (factorial 3) we will now have to write (call factorial 3) and instead of (+ 1 2)
   we will have to write (call + 1 2). 
   #+end_quote

*** Answer
    #+begin_src scheme

      #| Answer:
      1: The order of operations will cause some variables to be undefined. As the
      example suggests, define will be called with 'x' and '3' as arguments. `define'
      cannot be made into a procedure because the arguments will be evaluated.

      2. Only `application' need be changed:

      (define application? (exp)
      (tagged-list? exp 'call))
      (define operator (exp) (cadr exp))
      (define operands (exp) (cddr exp)) |#
    #+end_src

** Exercise 4.3
   #+begin_quote
   Rewrite eval so that the dispatch is done in data-directed style. Compare this
   with the data-directed differentiation procedure of Exercise 2.73.
   (You may use the car of a compound expression as the type of the expression, as
   is appropriate for the syntax implemented in this section.) 
   #+end_quote

