_posts/2019-04-07-sicp-chapter-4.html
---
layout: page
title: SICP Chapter 4 Exercises & Solutions
category: note
tags:
 - post
 - SICP
 - solutions
---
<section id="outline-container-org44fd599" class="outline-2">
<h2 id="org44fd599"></h2>
<div class="outline-text-2" id="text-org44fd599">
<p>
The HTML for this page has been automatically generated by parsing the loosely
formatted source code &amp; comments included in my solutions repository
(<a href="https://github.com/zv/SICP-guile">https://github.com/zv/SICP-guile</a>), if you encounter any unformatted
solutions, you think you&rsquo;ve spotted an error or you have something you&rsquo;d like
to share about the exercises, don&rsquo;t hesitate to leave a comment below
(or a pull request on the source repo).
</p>
</div>
</section>


<section id="outline-container-orgc9195f9" class="outline-2">
<h2 id="orgc9195f9">Exercises Chapter 4</h2>
<div class="outline-text-2" id="text-orgc9195f9">
</div>
<div id="outline-container-orge637c9d" class="outline-3">
<h3 id="orge637c9d">Exercise 4.1</h3>
<div class="outline-text-3" id="text-orge637c9d">
<div class="question" id="orgb520502">
<p>
Notice that we cannot tell whether the metacircular evaluator evaluates operands
from left to right or from right to left. Its evaluation order is inherited from
the underlying Lisp: If the arguments to cons in list-of-values are evaluated
from left to right, then list-of-values will evaluate operands from left to
right; and if the arguments to cons are evaluated from right to left, then
list-of-values will evaluate operands from right to left.
</p>

<p>
Write a version of list-of-values that evaluates operands from left to right
regardless of the order of evaluation in the underlying Lisp. Also write a
version of list-of-values that evaluates operands from right to left.
</p>

</div>
</div>

<div id="outline-container-org3ae333f" class="outline-4">
<h4 id="org3ae333f">Answer</h4>
<div class="outline-text-4" id="text-org3ae333f">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">rtl-list-of-values</span> exps env<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>no-operands? exps<span style="color: #268bd2;">)</span> '<span style="color: #268bd2;">()</span>
      <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>left <span style="color: #b58900;">(</span>zeval <span style="color: #268bd2;">(</span>first-operand exps<span style="color: #268bd2;">)</span> env<span style="color: #b58900;">)</span> <span style="color: #859900;">)</span>
             <span style="color: #859900;">(</span>right <span style="color: #b58900;">(</span>rtl-list-of-values <span style="color: #268bd2;">(</span>rest-operands exps<span style="color: #268bd2;">)</span> env<span style="color: #b58900;">)</span> <span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span>cons left right<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org8cdb1b7" class="outline-3">
<h3 id="org8cdb1b7">Exercise 4.2</h3>
<div class="outline-text-3" id="text-org8cdb1b7">
<div class="question" id="orge922fa4">
<p>
Louis Reasoner plans to reorder the cond clauses in eval so that the clause for
procedure applications appears before the clause for assignments. He argues that
this will make the interpreter more efficient: Since programs usually contain
more applications than assignments, definitions, and so on, his modified eval
will usually check fewer clauses than the original eval before identifying the
type of an expression.
</p>

<ol class="org-ol">
<li>What is wrong with Louis’s plan? (Hint: What will Louis’s evaluator do with the expression (define x 3)?)</li>

<li>Louis is upset that his plan didn’t work. He is willing to go to any lengths to make his evaluator recognize procedure applications before it checks for most other kinds of expressions. Help him by changing the syntax of the evaluated language so that procedure applications start with call. For example, instead of (factorial 3) we will now have to write (call factorial 3) and instead of (+ 1 2) we will have to write (call + 1 2).</li>
</ol>

</div>
</div>

<div id="outline-container-orgb952926" class="outline-4">
<h4 id="orgb952926">Answer</h4>
<div class="outline-text-4" id="text-orgb952926">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Answer:</span>
<span style="color: #93a1a1;">1: The order of operations will cause some variables to be undefined. As the</span>
<span style="color: #93a1a1;">example suggests, define will be called with 'x' and '3' as arguments. `define'</span>
<span style="color: #93a1a1;">cannot be made into a procedure because the arguments will be evaluated.</span>

<span style="color: #93a1a1;">2. Only `application' need be changed:</span>

<span style="color: #93a1a1;">(define application? (exp)</span>
<span style="color: #93a1a1;">(tagged-list? exp 'call))</span>
<span style="color: #93a1a1;">(define operator (exp) (cadr exp))</span>
<span style="color: #93a1a1;">(define operands (exp) (cddr exp)) |#</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org08db74f" class="outline-3">
<h3 id="org08db74f">Exercise 4.3</h3>
<div class="outline-text-3" id="text-org08db74f">
<div class="question" id="orgc88ee3c">
<p>
Rewrite eval so that the dispatch is done in data-directed style. Compare this
with the data-directed differentiation procedure of Exercise 2.73.
(You may use the car of a compound expression as the type of the expression, as
is appropriate for the syntax implemented in this section.) 
</p>

</div>
</div>
