org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme
      (define-class <dispatch-table> ()
        (method-table #:init-value (make-hash-table)
                      #:getter method-table))

      (define (table-ordinal op type)
        (let ([opstr   (symbol->string op)]
              [typestr (symbol->string type)])
          (string-append opstr "/" typestr)))

      (define-method (get (dt <dispatch-table>) op type)
        (if (and (symbol? op) (symbol? type))
            (hash-ref (method-table dt) (table-ordinal op type))
            #f))

      (define-method (put (dt <dispatch-table>) op type item)
        (hash-set! (method-table dt) (table-ordinal op type) item))

      (define dispatch-tt (make <dispatch-table>))

      (define (list-tag expr)
        "Extract the type of expression"
        (if (pair? expr) (car expr) #f))

      (define (install-procedure p)
        (put dispatch-tt 'eval (car p) (cadr p)))

      ;; Install our procedures
      (map
       install-procedure
       `([quote  ,(λ (expr env) (text-of-quotation expr))]
         [set!    ,eval-assignment]
         [define ,eval-definition]
         [if     ,eval-if]
         [lambda ,(λ (expr env) (make-procedure (lambda-parameters expr) (lambda-body expr) env))]
         [begin  ,(λ (expr env) (eval-sequence (begin-actions expr) env))]
         [cond   ,(λ (expr env) (zeval (cond->if expr) env))]))

      (define (zeval expr env)
        (let ([dispatch-fn (get dispatch-tt 'eval (list-tag expr))])
          (cond
           [(self-evaluating? expr)
            expr]
           [(variable? expr)
            (lookup-variable-value expr env)]
           [(procedure? dispatch-fn)
            (dispatch-fn expr env)]
           [(application? expr)
            (zapply (zeval (operator expr) env)
                    (list-of-values (operands expr) env))]
           [else (error "Bad Expression" expr)])))

      (define (install-driver-loop evaluator fn)
        (put dispatch-tt 'driver-loop evaluator fn))

      (install-driver-loop 'zeval base-driver-loop)
    #+end_src

** Exercise 4.4
   #+begin_quote
   Recall the definitions of the special forms and and or from Chapter 1:

   `and': The expressions are evaluated from left to right. If any expression
   evaluates to false, false is returned; any remaining expressions are not
   evaluated. If all the expressions evaluate to true values, the value of the last
   expression is returned. If there are no expressions then true is returned.
   `or': The expressions are evaluated from left to right. If any expression
   evaluates to a true value, that value is returned; any remaining expressions are
   not evaluated. If all expressions evaluate to false, or if there are no
   expressions, then false is returned.

   Install `and' and `or' as new special forms for the evaluator by defining
   appropriate syntax procedures and evaluation procedures eval-and and eval-or.
   Alternatively, show how to implement and and or as derived expressions. 
   #+end_quote
