_posts/2019-04-07-sicp-chapter-4.html

<div id="outline-container-org58cb828" class="outline-4">
<h4 id="org58cb828">Answer</h4>
<div class="outline-text-4" id="text-org58cb828">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define-class</span> <span style="color: #b58900;">&lt;dispatch-table&gt;</span> <span style="color: #b58900;">()</span>
  <span style="color: #b58900;">(</span>method-table <span style="color: #657b83; font-weight: bold;">#:init-value</span> <span style="color: #268bd2;">(</span>make-hash-table<span style="color: #268bd2;">)</span>
                <span style="color: #657b83; font-weight: bold;">#:getter</span> method-table<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">table-ordinal</span> op type<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>opstr   <span style="color: #859900;">(</span>symbol-&gt;string op<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
        <span style="color: #6c71c4;">[</span>typestr <span style="color: #859900;">(</span>symbol-&gt;string type<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>string-append opstr <span style="color: #2aa198;">"/"</span> typestr<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define-method</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">get</span> <span style="color: #268bd2;">(</span>dt <span style="color: #b58900;">&lt;dispatch-table&gt;</span><span style="color: #268bd2;">)</span> op type<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #6c71c4;">(</span>symbol? op<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>symbol? type<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>hash-ref <span style="color: #6c71c4;">(</span>method-table dt<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>table-ordinal op type<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
      #f<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define-method</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">put</span> <span style="color: #268bd2;">(</span>dt <span style="color: #b58900;">&lt;dispatch-table&gt;</span><span style="color: #268bd2;">)</span> op type item<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>hash-set! <span style="color: #268bd2;">(</span>method-table dt<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>table-ordinal op type<span style="color: #268bd2;">)</span> item<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">dispatch-tt</span> <span style="color: #b58900;">(</span>make <span style="color: #b58900;">&lt;dispatch-table&gt;</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">list-tag</span> expr<span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">"Extract the type of expression"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>pair? expr<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>car expr<span style="color: #268bd2;">)</span> #f<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">install-procedure</span> p<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>put dispatch-tt 'eval <span style="color: #268bd2;">(</span>car p<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>cadr p<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Install our procedures</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">map</span>
 install-procedure
 `<span style="color: #b58900;">(</span><span style="color: #268bd2;">[</span>quote  ,<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #859900;">(</span>expr env<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>text-of-quotation expr<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
   <span style="color: #268bd2;">[</span>set!    ,eval-assignment<span style="color: #268bd2;">]</span>
   <span style="color: #268bd2;">[</span>define ,eval-definition<span style="color: #268bd2;">]</span>
   <span style="color: #268bd2;">[</span>if     ,eval-if<span style="color: #268bd2;">]</span>
   <span style="color: #268bd2;">[</span>lambda ,<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #859900;">(</span>expr env<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>make-procedure <span style="color: #b58900;">(</span>lambda-parameters expr<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>lambda-body expr<span style="color: #b58900;">)</span> env<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
   <span style="color: #268bd2;">[</span>begin  ,<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #859900;">(</span>expr env<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>eval-sequence <span style="color: #b58900;">(</span>begin-actions expr<span style="color: #b58900;">)</span> env<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
   <span style="color: #268bd2;">[</span>cond   ,<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #859900;">(</span>expr env<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>zeval <span style="color: #b58900;">(</span>cond-&gt;if expr<span style="color: #b58900;">)</span> env<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">zeval</span> expr env<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>dispatch-fn <span style="color: #859900;">(</span>get dispatch-tt 'eval <span style="color: #b58900;">(</span>list-tag expr<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">cond</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span>self-evaluating? expr<span style="color: #859900;">)</span>
      expr<span style="color: #6c71c4;">]</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span>variable? expr<span style="color: #859900;">)</span>
      <span style="color: #859900;">(</span>lookup-variable-value expr env<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span>procedure? dispatch-fn<span style="color: #859900;">)</span>
      <span style="color: #859900;">(</span>dispatch-fn expr env<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
     <span style="color: #6c71c4;">[</span><span style="color: #859900;">(</span>application? expr<span style="color: #859900;">)</span>
      <span style="color: #859900;">(</span>zapply <span style="color: #b58900;">(</span>zeval <span style="color: #268bd2;">(</span>operator expr<span style="color: #268bd2;">)</span> env<span style="color: #b58900;">)</span>
              <span style="color: #b58900;">(</span>list-of-values <span style="color: #268bd2;">(</span>operands expr<span style="color: #268bd2;">)</span> env<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
     <span style="color: #6c71c4;">[</span>else <span style="color: #859900;">(</span>error <span style="color: #2aa198;">"Bad Expression"</span> expr<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">install-driver-loop</span> evaluator fn<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>put dispatch-tt 'driver-loop evaluator fn<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>install-driver-loop 'zeval base-driver-loop<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd97827a" class="outline-3">
<h3 id="orgd97827a">Exercise 4.4</h3>
<div class="outline-text-3" id="text-orgd97827a">
<div class="question" id="org1243a31">
<p>
Recall the definitions of the special forms and and or from Chapter 1:
</p>

<p>
`and&rsquo;: The expressions are evaluated from left to right. If any expression
evaluates to false, false is returned; any remaining expressions are not
evaluated. If all the expressions evaluate to true values, the value of the last
expression is returned. If there are no expressions then true is returned.
`or&rsquo;: The expressions are evaluated from left to right. If any expression
evaluates to a true value, that value is returned; any remaining expressions are
not evaluated. If all expressions evaluate to false, or if there are no
expressions, then false is returned.
</p>

<p>
Install `and&rsquo; and `or&rsquo; as new special forms for the evaluator by defining
appropriate syntax procedures and evaluation procedures eval-and and eval-or.
Alternatively, show how to implement and and or as derived expressions. 
</p>

</div>
</div>
