org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme
      (define (disjunct exp)
        (if (null? (cdr exp)) 'false
            (cadr exp)))

      (define (rest-disjunctions exp)
        (if (null? (cdr exp)) '()
            (cddr exp)))

      ;; or
      (define (or? exp) (tagged-list? exp 'or))
      (define (eval-or exp env) (eval-connective exp env true?))
      (install-procedure `(or ,eval-or))

      ;; and
      (define (and? exp) (tagged-list? exp 'and))
      (define (eval-and exp env) (eval-connective exp env false?))
      (install-procedure `(and ,eval-and))

      (define (eval-connective exp env oper)
        "eval-connective evaluates the first part of an expression in the given
      environment. If the result applied to `oper' is false, it continues to evaluate
      until `(oper exp)' argument returns true or no arguments remain."
        (let ([disjunction (zeval (disjunct exp) env)]
              [rest-disjunctions (rest-disjunctions exp)])
          (if (or (oper disjunction) (null? rest-disjunctions)) disjunction
              (eval-connective (cons (operator exp) rest-disjunctions)
                               env
                               oper))))

    #+end_src
** Exercise 4.5
   #+begin_quote
   Scheme allows an additional syntax for cond clauses, (⟨test⟩ => ⟨recipient⟩). If
   ⟨test⟩ evaluates to a true value, then ⟨recipient⟩ is evaluated. Its value must
   be a procedure of one argument; this procedure is then invoked on the value of
   the ⟨test⟩, and the result is returned as the value of the cond expression. For
   example

   (cond ((assoc 'b '((a 1) (b 2))) => cadr)
   (else false))

   returns 2.
   Modify the handling of cond so that it supports this extended syntax. 
   #+end_quote
*** Answer
    #+begin_src scheme

      (define (cond-is-pipe? exp)
        (if (pair? exp) (eq? (cadr exp) '=>) #f))

      (define (cond-recipient exp) (caddr exp))

      (define (expand-clauses clauses)
        (if (null? clauses) 'false
            (let ([first (car clauses)]
                  [rest  (cdr clauses)])

              ;; check for =>
              (if (cond-is-pipe? first)
                  (let ([test (cond-predicate first)])
                    (make-if test
                             (list (cond-recipient first) test)
                             (expand-clauses rest)))

                  ;; otherwise a normal cond applies
                  (if (cond-else-clause? first)
                      (if (null? rest) (sequence->exp (cond-actions first))
                          (error "ELSE clause isn't last: COND->IF" clauses))
                      (make-if (cond-predicate first)
                               (sequence->exp (cond-actions first))
                               (expand-clauses rest)))))))
    #+end_src
** Exercise 4.6
   #+begin_quote
   Let expressions are derived expressions, because

   (let ((⟨var₁⟩ ⟨exp₁⟩) … (⟨varₙ⟩ ⟨expₙ⟩))
   ⟨body⟩)

   is equivalent to

   ((lambda (⟨var₁⟩ … ⟨varₙ⟩)
   ⟨body⟩)
   ⟨exp₁⟩
   …
   ⟨expₙ⟩)

   Implement a syntactic transformation let->combination that reduces evaluating
   let expressions to evaluating combinations of the type shown above, and add the
   appropriate clause to eval to handle let expressions. 
   #+end_quote
