_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org8b0c2b4" class="outline-4">
<h4 id="org8b0c2b4">Answer</h4>
<div class="outline-text-4" id="text-org8b0c2b4">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">disjunct</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>null? <span style="color: #6c71c4;">(</span>cdr exp<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span> 'false
      <span style="color: #268bd2;">(</span>cadr exp<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">rest-disjunctions</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>null? <span style="color: #6c71c4;">(</span>cdr exp<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span> '<span style="color: #268bd2;">()</span>
      <span style="color: #268bd2;">(</span>cddr exp<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">or</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">or?</span> exp<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>tagged-list? exp 'or<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">eval-or</span> exp env<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>eval-connective exp env true?<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>install-procedure `<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">or</span> ,eval-or<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">and</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">and?</span> exp<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>tagged-list? exp 'and<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">eval-and</span> exp env<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>eval-connective exp env false?<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>install-procedure `<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">and</span> ,eval-and<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">eval-connective</span> exp env oper<span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">"eval-connective evaluates the first part of an expression in the given</span>
<span style="color: #2aa198;">environment. If the result applied to `oper' is false, it continues to evaluate</span>
<span style="color: #2aa198;">until `(oper exp)' argument returns true or no arguments remain."</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>disjunction <span style="color: #859900;">(</span>zeval <span style="color: #b58900;">(</span>disjunct exp<span style="color: #b58900;">)</span> env<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
        <span style="color: #6c71c4;">[</span>rest-disjunctions <span style="color: #859900;">(</span>rest-disjunctions exp<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">or</span> <span style="color: #859900;">(</span>oper disjunction<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>null? rest-disjunctions<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span> disjunction
        <span style="color: #6c71c4;">(</span>eval-connective <span style="color: #859900;">(</span>cons <span style="color: #b58900;">(</span>operator exp<span style="color: #b58900;">)</span> rest-disjunctions<span style="color: #859900;">)</span>
                         env
                         oper<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org102ff3d" class="outline-3">
<h3 id="org102ff3d">Exercise 4.5</h3>
<div class="outline-text-3" id="text-org102ff3d">
<div class="question" id="orgde041e2">
<p>
Scheme allows an additional syntax for cond clauses, (⟨test⟩ =&gt; ⟨recipient⟩). If
⟨test⟩ evaluates to a true value, then ⟨recipient⟩ is evaluated. Its value must
be a procedure of one argument; this procedure is then invoked on the value of
the ⟨test⟩, and the result is returned as the value of the cond expression. For
example
</p>

<p>
(cond ((assoc &rsquo;b &rsquo;((a 1) (b 2))) =&gt; cadr)
(else false))
</p>

<p>
returns 2.
Modify the handling of cond so that it supports this extended syntax. 
</p>

</div>
</div>
<div id="outline-container-org1dd7750" class="outline-4">
<h4 id="org1dd7750">Answer</h4>
<div class="outline-text-4" id="text-org1dd7750">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">cond-is-pipe?</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>pair? exp<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>eq? <span style="color: #6c71c4;">(</span>cadr exp<span style="color: #6c71c4;">)</span> '=&gt;<span style="color: #268bd2;">)</span> #f<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">cond-recipient</span> exp<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>caddr exp<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">expand-clauses</span> clauses<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>null? clauses<span style="color: #268bd2;">)</span> 'false
      <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">[</span>first <span style="color: #b58900;">(</span>car clauses<span style="color: #b58900;">)</span><span style="color: #859900;">]</span>
            <span style="color: #859900;">[</span>rest  <span style="color: #b58900;">(</span>cdr clauses<span style="color: #b58900;">)</span><span style="color: #859900;">]</span><span style="color: #6c71c4;">)</span>

        <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">check for =&gt;</span>
        <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>cond-is-pipe? first<span style="color: #859900;">)</span>
            <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">[</span>test <span style="color: #6c71c4;">(</span>cond-predicate first<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span>
              <span style="color: #b58900;">(</span>make-if test
                       <span style="color: #268bd2;">(</span>list <span style="color: #6c71c4;">(</span>cond-recipient first<span style="color: #6c71c4;">)</span> test<span style="color: #268bd2;">)</span>
                       <span style="color: #268bd2;">(</span>expand-clauses rest<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>

            <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">otherwise a normal cond applies</span>
            <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #b58900;">(</span>cond-else-clause? first<span style="color: #b58900;">)</span>
                <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>null? rest<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>sequence-&gt;exp <span style="color: #6c71c4;">(</span>cond-actions first<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
                    <span style="color: #268bd2;">(</span>error <span style="color: #2aa198;">"ELSE clause isn't last: COND-&gt;IF"</span> clauses<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
                <span style="color: #b58900;">(</span>make-if <span style="color: #268bd2;">(</span>cond-predicate first<span style="color: #268bd2;">)</span>
                         <span style="color: #268bd2;">(</span>sequence-&gt;exp <span style="color: #6c71c4;">(</span>cond-actions first<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
                         <span style="color: #268bd2;">(</span>expand-clauses rest<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org85d59e9" class="outline-3">
<h3 id="org85d59e9">Exercise 4.6</h3>
<div class="outline-text-3" id="text-org85d59e9">
<div class="question" id="orge39fc6a">
<p>
Let expressions are derived expressions, because
</p>

<p>
(let ((⟨var₁⟩ ⟨exp₁⟩) … (⟨varₙ⟩ ⟨expₙ⟩))
⟨body⟩)
</p>

<p>
is equivalent to
</p>

<p>
((lambda (⟨var₁⟩ … ⟨varₙ⟩)
⟨body⟩)
⟨exp₁⟩
…
⟨expₙ⟩)
</p>

<p>
Implement a syntactic transformation let-&gt;combination that reduces evaluating
let expressions to evaluating combinations of the type shown above, and add the
appropriate clause to eval to handle let expressions. 
</p>

</div>
</div>
