org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme

      (generate-accessors
       ([let-bindings       cadr]
        [let-body           cddr]
        [let-binding-vars   (cut map car <...>)]
        [let-binding-exprs  (cut map cadr <...>)]
        [let-vars           (compose let-binding-vars let-bindings)]
        [let-exprs          (compose let-binding-exprs let-bindings)]))


      (define (make-let->lambda vars exprs body)
        "Makes a let expression as ((lambda (vars) body) exprs)"
        (cons (make-lambda vars body) exprs))

      (define (let->combination exp)
        (if (null? exp) 'false
            (let ([bindings (let-bindings exp)]
                  [body     (let-body exp)])
              (make-let->lambda (let-binding-vars bindings)
                                (let-binding-exprs bindings)
                                body))))

      (install-procedure `(let ,(λ (exp env) (zeval (let->combination exp) env))))
    #+end_src
** Exercise 4.7
   #+begin_quote
   `let*' is similar to `let', except that the bindings of the `let*' variables are
   performed sequentially from left to right, and each binding is made in an
   environment in which all of the preceding bindings are visible. For example

   (let* ((x 3)
   (y (+ x 2))
   (z (+ x y 5)))
   (* x z))

   returns 39. Explain how a `let*' expression can be rewritten as a set of nested
   let expressions, and write a procedure `let*->nested-lets' that performs this
   transformation. If we have already implemented let (Exercise 4.6) and we want to
   extend the evaluator to handle `let*', is it sufficient to add a clause to eval
   whose action is

   (eval (let*->nested-lets exp) env)

   (let (x 3)
   (let (y 2)
   1))

   ((lambda (x) (lambda (y) 1) 2) 3)

   or must we explicitly expand `let*' in terms of non-derived expressions? 
   #+end_quote
*** Answer
    #+begin_src scheme

      ;;; There is nothing preventing `let*' from being defined in terms of existing
      ;;; `let' expressions
      (generate-accessors
       ([let*-body  caddr]
        [let*-inits cadr]))

      ;;;; This is a little funky here, I've replaced this with another version copied
      ;;;; online -- the only thing wrong with this is some monkeying around with the let
      ;;;; order
      ;; (define (let*->nested-let exp)
      ;;   (define (next exp)
      ;;     (list (operator exp) (cdadr exp) (caddr exp)))
      ;;   (if (null? exp) 'false
      ;;       (let ([bindings (let-bindings exp)]
      ;;             [body     (let-body exp)])
      ;;         (if (null? bindings) body
      ;;             (make-let->lambda
      ;;              (list (car (let-binding-vars bindings)))
      ;;              (list (car (let-binding-exprs bindings)))
      ;;              (let*->nested-let (next exp)))))))
      (define (let*->nested-lets expr)
        (let ([inits (let*-inits expr)]
              [body (let*-body expr)])
          (define (next expr)
            (if (null? expr) body
                (list 'let (list (car expr)) (next (cdr expr)))))
          (next inits)))


      (install-procedure `(let* ,(λ (exp env) (zeval (let*->nested-lets exp) env))))
    #+end_src
** Exercise 4.8
   #+begin_quote
   “Named let” is a variant of let that has the form

   (let ⟨var⟩ ⟨bindings⟩ ⟨body⟩)

   The ⟨bindings⟩ and ⟨body⟩ are just as in ordinary let, except that ⟨var⟩ is
   bound within ⟨body⟩ to a procedure whose body is ⟨body⟩ and whose parameters are
   the variables in the ⟨bindings⟩. Thus, one can repeatedly execute the ⟨body⟩ by
   invoking the procedure named ⟨var⟩. For example, the iterative Fibonacci
   procedure (1.2.2) can be rewritten using named let as follows:

   (define (fib n)
   (let fib-iter ((a 1) (b 0) (count n))
   (if (= count 0)
   b
   (fib-iter (+ a b)
   a
   (- count 1)))))

   Modify let->combination of Exercise 4.6 to also support named let. 
   #+end_quote
