_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-orgf0a2330" class="outline-4">
<h4 id="orgf0a2330">Answer</h4>
<div class="outline-text-4" id="text-orgf0a2330">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #2aa198;">(</span>generate-accessors
 <span style="color: #b58900;">(</span><span style="color: #268bd2;">[</span>let-bindings       cadr<span style="color: #268bd2;">]</span>
  <span style="color: #268bd2;">[</span>let-body           cddr<span style="color: #268bd2;">]</span>
  <span style="color: #268bd2;">[</span>let-binding-vars   <span style="color: #6c71c4;">(</span>cut map car <span style="color: #b58900;">&lt;...&gt;</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
  <span style="color: #268bd2;">[</span>let-binding-exprs  <span style="color: #6c71c4;">(</span>cut map cadr <span style="color: #b58900;">&lt;...&gt;</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
  <span style="color: #268bd2;">[</span>let-vars           <span style="color: #6c71c4;">(</span>compose let-binding-vars let-bindings<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
  <span style="color: #268bd2;">[</span>let-exprs          <span style="color: #6c71c4;">(</span>compose let-binding-exprs let-bindings<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>


<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">make-let-&gt;lambda</span> vars exprs body<span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">"Makes a let expression as ((lambda (vars) body) exprs)"</span>
  <span style="color: #b58900;">(</span>cons <span style="color: #268bd2;">(</span>make-lambda vars body<span style="color: #268bd2;">)</span> exprs<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">let-&gt;combination</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>null? exp<span style="color: #268bd2;">)</span> 'false
      <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">[</span>bindings <span style="color: #b58900;">(</span>let-bindings exp<span style="color: #b58900;">)</span><span style="color: #859900;">]</span>
            <span style="color: #859900;">[</span>body     <span style="color: #b58900;">(</span>let-body exp<span style="color: #b58900;">)</span><span style="color: #859900;">]</span><span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span>make-let-&gt;lambda <span style="color: #859900;">(</span>let-binding-vars bindings<span style="color: #859900;">)</span>
                          <span style="color: #859900;">(</span>let-binding-exprs bindings<span style="color: #859900;">)</span>
                          body<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>install-procedure `<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> ,<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>exp env<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>zeval <span style="color: #859900;">(</span>let-&gt;combination exp<span style="color: #859900;">)</span> env<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org798864c" class="outline-3">
<h3 id="org798864c">Exercise 4.7</h3>
<div class="outline-text-3" id="text-org798864c">
<div class="question" id="org0d5a1df">
<p>
`let*&rsquo; is similar to `let&rsquo;, except that the bindings of the `let*&rsquo; variables are
performed sequentially from left to right, and each binding is made in an
environment in which all of the preceding bindings are visible. For example
</p>

<p>
(let* ((x 3)
(y (+ x 2))
(z (+ x y 5)))
(* x z))
</p>

<p>
returns 39. Explain how a `let*&rsquo; expression can be rewritten as a set of nested
let expressions, and write a procedure `let*-&gt;nested-lets&rsquo; that performs this
transformation. If we have already implemented let (Exercise 4.6) and we want to
extend the evaluator to handle `let*&rsquo;, is it sufficient to add a clause to eval
whose action is
</p>

<p>
(eval (let*-&gt;nested-lets exp) env)
</p>

<p>
(let (x 3)
(let (y 2)
1))
</p>

<p>
((lambda (x) (lambda (y) 1) 2) 3)
</p>

<p>
or must we explicitly expand `let*&rsquo; in terms of non-derived expressions? 
</p>

</div>
</div>
<div id="outline-container-orgf54ff2b" class="outline-4">
<h4 id="orgf54ff2b">Answer</h4>
<div class="outline-text-4" id="text-orgf54ff2b">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;;; </span><span style="color: #93a1a1;">There is nothing preventing `let*' from being defined in terms of existing</span>
<span style="color: #93a1a1;">;;; </span><span style="color: #93a1a1;">`let' expressions</span>
<span style="color: #2aa198;">(</span>generate-accessors
 <span style="color: #b58900;">(</span><span style="color: #268bd2;">[</span>let*-body  caddr<span style="color: #268bd2;">]</span>
  <span style="color: #268bd2;">[</span>let*-inits cadr<span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;;;; </span><span style="color: #93a1a1;">This is a little funky here, I've replaced this with another version copied</span>
<span style="color: #93a1a1;">;;;; </span><span style="color: #93a1a1;">online -- the only thing wrong with this is some monkeying around with the let</span>
<span style="color: #93a1a1;">;;;; </span><span style="color: #93a1a1;">order</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">(define (let*-&gt;nested-let exp)</span>
<span style="color: #93a1a1;">;;   </span><span style="color: #93a1a1;">(define (next exp)</span>
<span style="color: #93a1a1;">;;     </span><span style="color: #93a1a1;">(list (operator exp) (cdadr exp) (caddr exp)))</span>
<span style="color: #93a1a1;">;;   </span><span style="color: #93a1a1;">(if (null? exp) 'false</span>
<span style="color: #93a1a1;">;;       </span><span style="color: #93a1a1;">(let ([bindings (let-bindings exp)]</span>
<span style="color: #93a1a1;">;;             </span><span style="color: #93a1a1;">[body     (let-body exp)])</span>
<span style="color: #93a1a1;">;;         </span><span style="color: #93a1a1;">(if (null? bindings) body</span>
<span style="color: #93a1a1;">;;             </span><span style="color: #93a1a1;">(make-let-&gt;lambda</span>
<span style="color: #93a1a1;">;;              </span><span style="color: #93a1a1;">(list (car (let-binding-vars bindings)))</span>
<span style="color: #93a1a1;">;;              </span><span style="color: #93a1a1;">(list (car (let-binding-exprs bindings)))</span>
<span style="color: #93a1a1;">;;              </span><span style="color: #93a1a1;">(let*-&gt;nested-let (next exp)))))))</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">let*-&gt;nested-lets</span> expr<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>inits <span style="color: #859900;">(</span>let*-inits expr<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
        <span style="color: #6c71c4;">[</span>body <span style="color: #859900;">(</span>let*-body expr<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">next</span> expr<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>null? expr<span style="color: #859900;">)</span> body
          <span style="color: #859900;">(</span>list 'let <span style="color: #b58900;">(</span>list <span style="color: #268bd2;">(</span>car expr<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>next <span style="color: #268bd2;">(</span>cdr expr<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>next inits<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>


<span style="color: #2aa198;">(</span>install-procedure `<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let*</span> ,<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>exp env<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>zeval <span style="color: #859900;">(</span>let*-&gt;nested-lets exp<span style="color: #859900;">)</span> env<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org0751adc" class="outline-3">
<h3 id="org0751adc">Exercise 4.8</h3>
<div class="outline-text-3" id="text-org0751adc">
<div class="question" id="orged03dc2">
<p>
“Named let” is a variant of let that has the form
</p>

<p>
(let ⟨var⟩ ⟨bindings⟩ ⟨body⟩)
</p>

<p>
The ⟨bindings⟩ and ⟨body⟩ are just as in ordinary let, except that ⟨var⟩ is
bound within ⟨body⟩ to a procedure whose body is ⟨body⟩ and whose parameters are
the variables in the ⟨bindings⟩. Thus, one can repeatedly execute the ⟨body⟩ by
invoking the procedure named ⟨var⟩. For example, the iterative Fibonacci
procedure (1.2.2) can be rewritten using named let as follows:
</p>

<p>
(define (fib n)
(let fib-iter ((a 1) (b 0) (count n))
(if (= count 0)
b
(fib-iter (+ a b)
a
(- count 1)))))
</p>

<p>
Modify let-&gt;combination of Exercise 4.6 to also support named let. 
</p>

</div>
</div>
