org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme
      (define (named-let? exp) (symbol? (cadr exp)))
      (generate-accessors
       ([nlet-var cadr]
        [nlet-bindings caddr]
        [nlet-body cdddr]))

      (define (make-named-let exp)
        ;; get prepped for that long let
        (let* ([body       (nlet-body exp)]
               [bindings   (nlet-bindings exp)]
               [vars       (let-binding-vars bindings)]
               [exprs      (let-binding-exprs bindings)]
               [fnname     (nlet-var exp)]
               [fn         (make-lambda vars body)])
          (%as-syntax
           (let ,bindings
             (begin
               (define ,fnname ,fn)
               ,@body)))))

      (define (let->combination exp)
        (if (null? exp) 'false
            (if (named-let? exp) (make-named-let exp)
                ;; otherwise we're processing a normal let
                (make-let->lambda (let-vars exp)
                                  (let-exprs exp)
                                  (let-body exp)))))
    #+end_src
** Exercise 4.9
   #+begin_quote
   Many languages support a variety of iteration constructs, such as `do', `for',
   `while', and `until'. In Scheme, iterative processes can be expressed in terms of
   ordinary procedure calls, so special iteration constructs provide no essential
   gain in computational power. On the other hand, such constructs are often
   convenient. Design some iteration constructs, give examples of their use, and
   show how to implement them as derived expressions. 
   #+end_quote
*** Answer
    #+begin_src scheme
      (generate-accessors
       ([while-cond cadr]
        [while-body caddr]))

      (define (make-while exp)
        (let ([body (while-body exp)]
              [cond (while-cond exp)])
          (if (null? cond) 'false
              (%as-syntax
               (let while-loop ()
                 (if ,cond
                     (begin ,body
                            (while-loop))
                     false))))))

      (install-procedure `(while ,(λ (exp env) (zeval (make-while exp) env))))
    #+end_src
