_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org0d79c9d" class="outline-4">
<h4 id="org0d79c9d">Answer</h4>
<div class="outline-text-4" id="text-org0d79c9d">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">named-let?</span> exp<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>symbol? <span style="color: #268bd2;">(</span>cadr exp<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>generate-accessors
 <span style="color: #b58900;">(</span><span style="color: #268bd2;">[</span>nlet-var cadr<span style="color: #268bd2;">]</span>
  <span style="color: #268bd2;">[</span>nlet-bindings caddr<span style="color: #268bd2;">]</span>
  <span style="color: #268bd2;">[</span>nlet-body cdddr<span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">make-named-let</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">get prepped for that long let</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>body       <span style="color: #859900;">(</span>nlet-body exp<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
         <span style="color: #6c71c4;">[</span>bindings   <span style="color: #859900;">(</span>nlet-bindings exp<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
         <span style="color: #6c71c4;">[</span>vars       <span style="color: #859900;">(</span>let-binding-vars bindings<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
         <span style="color: #6c71c4;">[</span>exprs      <span style="color: #859900;">(</span>let-binding-exprs bindings<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
         <span style="color: #6c71c4;">[</span>fnname     <span style="color: #859900;">(</span>nlet-var exp<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
         <span style="color: #6c71c4;">[</span>fn         <span style="color: #859900;">(</span>make-lambda vars body<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>%as-syntax
     <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">let</span> ,bindings
       <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">begin</span>
         <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> ,fnname ,fn<span style="color: #b58900;">)</span>
         ,@body<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">let-&gt;combination</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>null? exp<span style="color: #268bd2;">)</span> 'false
      <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>named-let? exp<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>make-named-let exp<span style="color: #6c71c4;">)</span>
          <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">otherwise we're processing a normal let</span>
          <span style="color: #6c71c4;">(</span>make-let-&gt;lambda <span style="color: #859900;">(</span>let-vars exp<span style="color: #859900;">)</span>
                            <span style="color: #859900;">(</span>let-exprs exp<span style="color: #859900;">)</span>
                            <span style="color: #859900;">(</span>let-body exp<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org806d5df" class="outline-3">
<h3 id="org806d5df">Exercise 4.9</h3>
<div class="outline-text-3" id="text-org806d5df">
<div class="question" id="org5a6e4c0">
<p>
Many languages support a variety of iteration constructs, such as `do&rsquo;, `for&rsquo;,
`while&rsquo;, and `until&rsquo;. In Scheme, iterative processes can be expressed in terms of
ordinary procedure calls, so special iteration constructs provide no essential
gain in computational power. On the other hand, such constructs are often
convenient. Design some iteration constructs, give examples of their use, and
show how to implement them as derived expressions. 
</p>

</div>
</div>
<div id="outline-container-orgaed4c6f" class="outline-4">
<h4 id="orgaed4c6f">Answer</h4>
<div class="outline-text-4" id="text-orgaed4c6f">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span>generate-accessors
 <span style="color: #b58900;">(</span><span style="color: #268bd2;">[</span>while-cond cadr<span style="color: #268bd2;">]</span>
  <span style="color: #268bd2;">[</span>while-body caddr<span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">make-while</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>body <span style="color: #859900;">(</span>while-body exp<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
        <span style="color: #6c71c4;">[</span>cond <span style="color: #859900;">(</span>while-cond exp<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>null? cond<span style="color: #6c71c4;">)</span> 'false
        <span style="color: #6c71c4;">(</span>%as-syntax
         <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">while-loop</span> <span style="color: #b58900;">()</span>
           <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> ,cond
               <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">begin</span> ,body
                      <span style="color: #6c71c4;">(</span>while-loop<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
               false<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>install-procedure `<span style="color: #b58900;">(</span>while ,<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>exp env<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>zeval <span style="color: #859900;">(</span>make-while exp<span style="color: #859900;">)</span> env<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
