org/_posts/2019-06-23-sicp-chapter-4.org
** Exercise 4.11 & Exercise 4.12
   #+begin_quote
   4.11: Instead of representing a frame as a pair of lists, we can represent a
   frame as a list of bindings, where each binding is a name-value pair. Rewrite
   the environment operations to use this alternative representation.

   4.12: The procedures define-variable!, set-variable-value! and
   lookup-variable-value can be expressed in terms of more abstract procedures for
   traversing the environment structure. Define abstractions that capture the
   common patterns and redefine the three procedures in terms of these
   abstractions. 
   #+end_quote
   *** Answer
   #+begin_src scheme
     (define (make-frame variables values)
       (map cons variables values))

     (define (var-process var environment fn)
       (define (var-search env)
         (if (eq? env the-empty-environment) (begin
                                               ;;(pretty-print environment)
                                               (error "Unbound variable" var))
             (let* ([frame (first-frame env)]
                    [entry (assoc var frame)])
               (if entry (fn frame entry)
                   (var-search (enclosing-environment env))))))
       (var-search environment))

     (define (lookup-variable-value var env)
       (var-process var env (λ (_frame entry) (cdr entry))))

     (define (set-variable-value! var val env)
       (var-process var env (λ (frame entry) (set-cdr! entry val))))

     (define (define-variable! var val env)
       (set-car! env (assoc-set! (first-frame env) var val)))

   #+end_src
** Exercise 4.13
   #+begin_quote
   Scheme allows us to create new bindings for variables by means of define, but
   provides no way to get rid of bindings. Implement for the evaluator a special
   form make-unbound! that removes the binding of a given symbol from the
   environment in which the make-unbound! expression is evaluated. This problem is
   not completely specified. For example, should we remove only the binding in the
   first frame of the environment? Complete the specification and justify any
   choices you make. 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| Spec:
      `undefine' and `unset' are functions that set the name of the binding inside the
      closest stack-frame to null. |#
      (define (undefine-variable! var env)
        (var-process var env (λ (frame entry) (set-car! entry '()))))

      (define (eval-undefinition exp env)
        (undefine-variable!
         (definition-variable exp) env)
        'ok)

      (install-procedure `(undefine ,eval-undefinition))
    #+end_src
** Exercise 4.14
   #+begin_quote
   Eva Lu Ator and Louis Reasoner are each experimenting with the metacircular
   evaluator. Eva types in the definition of map, and runs some test programs that
   use it. They work fine. Louis, in contrast, has installed the system version of
   map as a primitive for the metacircular evaluator. When he tries it, things go
   terribly wrong. Explain why Louis’s map fails even though Eva’s works. 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| Solution:
      Louis is trying to use a variable defined inside the *interpreters* stack
      frame, not the *interpreTED* stack frame |#

    #+end_src
** Exercise 4.15
   #+begin_quote
   Given a one-argument procedure p and an object a, p is said to “halt” on a if
   evaluating the expression (p a) returns a value (as opposed to terminating with
   an error message or running forever). Show that it is impossible to write a
   procedure halts? that correctly determines whether p halts on a for any
   procedure p and object a. Use the following reasoning: If you had such a
   procedure halts?, you could implement the following program:

   (define (run-forever)
   (run-forever))

   (define (try p)
   (if (halts? p p)
   (run-forever)
   'halted))

   Now consider evaluating the expression (try try) and show that any possible
   outcome (either halting or running forever) violates the intended behavior of
   halts?. 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| - - - - - Solution:
      This problem is an abstract description of a thought experiment Turing conducted in the 1930s which would later be known as the 'halting problem'.

      The problem has no solution for a similar reason to the 'liar' paradox:

      Suppose it returns true -- `try' enters an endless loop, so it obviously doesn’t halt, while halts? returned true. The contrawise position is identical

      Therefore there can be no solution to the problem |#

    #+end_src
