_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org04d0d12" class="outline-3">
<h3 id="org04d0d12">Exercise 4.11 &amp; Exercise 4.12</h3>
<div class="outline-text-3" id="text-org04d0d12">
<div class="question" id="org055b319">
<p>
4.11: Instead of representing a frame as a pair of lists, we can represent a
frame as a list of bindings, where each binding is a name-value pair. Rewrite
the environment operations to use this alternative representation.
</p>

<p>
4.12: The procedures define-variable!, set-variable-value! and
lookup-variable-value can be expressed in terms of more abstract procedures for
traversing the environment structure. Define abstractions that capture the
common patterns and redefine the three procedures in terms of these
abstractions. 
</p>

</div>
<p>
<b>*</b> Answer
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">make-frame</span> variables values<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">map</span> cons variables values<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">var-process</span> var environment fn<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">var-search</span> env<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>eq? env the-empty-environment<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">begin</span>
                                          <span style="color: #93a1a1;">;;</span><span style="color: #93a1a1;">(pretty-print environment)</span>
                                          <span style="color: #859900;">(</span>error <span style="color: #2aa198;">"Unbound variable"</span> var<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #859900;">(</span><span style="color: #b58900;">[</span>frame <span style="color: #268bd2;">(</span>first-frame env<span style="color: #268bd2;">)</span><span style="color: #b58900;">]</span>
               <span style="color: #b58900;">[</span>entry <span style="color: #268bd2;">(</span>assoc var frame<span style="color: #268bd2;">)</span><span style="color: #b58900;">]</span><span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">if</span> entry <span style="color: #b58900;">(</span>fn frame entry<span style="color: #b58900;">)</span>
              <span style="color: #b58900;">(</span>var-search <span style="color: #268bd2;">(</span>enclosing-environment env<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>var-search environment<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">lookup-variable-value</span> var env<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>var-process var env <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>_frame entry<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>cdr entry<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">set-variable-value!</span> var val env<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>var-process var env <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>frame entry<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>set-cdr! entry val<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">define-variable!</span> var val env<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>set-car! env <span style="color: #268bd2;">(</span>assoc-set! <span style="color: #6c71c4;">(</span>first-frame env<span style="color: #6c71c4;">)</span> var val<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org08553bd" class="outline-3">
<h3 id="org08553bd">Exercise 4.13</h3>
<div class="outline-text-3" id="text-org08553bd">
<div class="question" id="org9377b04">
<p>
Scheme allows us to create new bindings for variables by means of define, but
provides no way to get rid of bindings. Implement for the evaluator a special
form make-unbound! that removes the binding of a given symbol from the
environment in which the make-unbound! expression is evaluated. This problem is
not completely specified. For example, should we remove only the binding in the
first frame of the environment? Complete the specification and justify any
choices you make. 
</p>

</div>
</div>
<div id="outline-container-org35eb34d" class="outline-4">
<h4 id="org35eb34d">Answer</h4>
<div class="outline-text-4" id="text-org35eb34d">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Spec:</span>
<span style="color: #93a1a1;">`undefine' and `unset' are functions that set the name of the binding inside the</span>
<span style="color: #93a1a1;">closest stack-frame to null. |#</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">undefine-variable!</span> var env<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>var-process var env <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>frame entry<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>set-car! entry '<span style="color: #859900;">()</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">eval-undefinition</span> exp env<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>undefine-variable!
   <span style="color: #268bd2;">(</span>definition-variable exp<span style="color: #268bd2;">)</span> env<span style="color: #b58900;">)</span>
  'ok<span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>install-procedure `<span style="color: #b58900;">(</span>undefine ,eval-undefinition<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc9bef7d" class="outline-3">
<h3 id="orgc9bef7d">Exercise 4.14</h3>
<div class="outline-text-3" id="text-orgc9bef7d">
<div class="question" id="org7007828">
<p>
Eva Lu Ator and Louis Reasoner are each experimenting with the metacircular
evaluator. Eva types in the definition of map, and runs some test programs that
use it. They work fine. Louis, in contrast, has installed the system version of
map as a primitive for the metacircular evaluator. When he tries it, things go
terribly wrong. Explain why Louis’s map fails even though Eva’s works. 
</p>

</div>
</div>
<div id="outline-container-orgfbcd27c" class="outline-4">
<h4 id="orgfbcd27c">Answer</h4>
<div class="outline-text-4" id="text-orgfbcd27c">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solution:</span>
<span style="color: #93a1a1;">Louis is trying to use a variable defined inside the *interpreters* stack</span>
<span style="color: #93a1a1;">frame, not the *interpreTED* stack frame |#</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org39c3c69" class="outline-3">
<h3 id="org39c3c69">Exercise 4.15</h3>
<div class="outline-text-3" id="text-org39c3c69">
<div class="question" id="orgc802211">
<p>
Given a one-argument procedure p and an object a, p is said to “halt” on a if
evaluating the expression (p a) returns a value (as opposed to terminating with
an error message or running forever). Show that it is impossible to write a
procedure halts? that correctly determines whether p halts on a for any
procedure p and object a. Use the following reasoning: If you had such a
procedure halts?, you could implement the following program:
</p>

<p>
(define (run-forever)
(run-forever))
</p>

<p>
(define (try p)
(if (halts? p p)
(run-forever)
&rsquo;halted))
</p>

<p>
Now consider evaluating the expression (try try) and show that any possible
outcome (either halting or running forever) violates the intended behavior of
halts?. 
</p>

</div>
</div>
<div id="outline-container-orgfad772b" class="outline-4">
<h4 id="orgfad772b">Answer</h4>
<div class="outline-text-4" id="text-orgfad772b">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| - - - - - Solution:</span>
<span style="color: #93a1a1;">This problem is an abstract description of a thought experiment Turing conducted in the 1930s which would later be known as the 'halting problem'.</span>

<span style="color: #93a1a1;">The problem has no solution for a similar reason to the 'liar' paradox:</span>

<span style="color: #93a1a1;">Suppose it returns true -- `try' enters an endless loop, so it obviously doesn&#8217;t halt, while halts? returned true. The contrawise position is identical</span>

<span style="color: #93a1a1;">Therefore there can be no solution to the problem |#</span>

</pre>
</div>
</div>
</div>
</div>
