org/_posts/2019-06-23-sicp-chapter-4.org
** Exercise 4.16
   #+begin_quote
   In this exercise we implement the method just described for interpreting
   internal definitions. We assume that the evaluator supports let (see Exercise
   4.6).

   1. Change `lookup-variable-value' (4.1.3) to signal an error if the value it finds
   is the symbol *unassigned*.
   2. Write a procedure `scan-out-defines' that takes a procedure body and returns an
   equivalent one that has no internal definitions, by making the transformation
   described above.
   3. Install `scan-out-defines' in the interpreter, either in make-procedure or in
   procedure-body (see 4.1.3). Which place is better? Why? 
   #+end_quote
*** Answer
    #+begin_src scheme
      ;; 1. Solution
      (define (simultaneous/lookup-variable-value var env)
        (var-process var env (λ (_f entry)
                               (if (eq? (cdr entry) '*unassigned*)
                                   (error "Unassigned var: " var)
                                   (cdr entry)))))

      ;; 2
      (define (scan-out-defines expr)
        "Transform a procedure, returning an equivalent one with no internal
      definitions"
        (define has-define (find (λ (e) (and (pair? e) (eq? (car e) 'define)))
                                 expr))
        (if has-define
            (fold
             (λ (elt prev)
               (let ([bindings (let-bindings prev)]
                     [body     (let-body prev)])
                 ;; merge our (new) bindings & body
                 (match elt
                   [('define var val)
                    `(let ((,var '*unassigned*)
                           ,@bindings)
                       (set! ,var ,val)
                       ;; we use ,@ to prevent recursive lists
                       ,@body)]
                   [_ `(let ,bindings ,@body ,elt)])))
             '(let ()) ;; we start with a basic let expression
             expr)
            expr))

      ;; simulatanous test
      (assert-equal
       (scan-out-defines '((define a 1)
                           (make-thing 1)
                           (define b 2)
                           (define c 3)
                           (make-thing a 1)))
       '(let ((c '*unassigned*)
              (b '*unassigned*)
              (a '*unassigned*))
          (set! c 3)
          (set! b 2)
          (set! a 1)
          (make-thing 1)
          (make-thing a 1)))

      ;; 3 -- I've selected make-procedure so that the conversion is done at
      ;; interpretation, rather than runtime.
      (define (simultaneous/make-procedure parameters body env)
        (list 'procedure
              parameters
              (scan-out-defines body)
              env))
    #+end_src
** Exercise 4.18
   #+begin_quote
   Consider an alternative strategy for scanning out definitions that translates
   the example in the text to

   (lambda ⟨vars⟩
   (let ((u '*unassigned*)
   (v '*unassigned*))
   (let ((a ⟨e1⟩)
   (b ⟨e2⟩))
   (set! u a)
   (set! v b))
   ⟨e3⟩))

   Here a and b are meant to represent new variable names, created by the
   interpreter, that do not appear in the user’s program. Consider the solve
   procedure from 3.5.4:

   (define (solve f y0 dt)
   (define y (integral (delay dy) y0 dt))
   (define dy (stream-map f y))
   y)

   Will this procedure work if internal definitions are scanned out as shown in
   this exercise? What if they are scanned out as shown in the text? Explain. 
   #+end_quote
*** Answer
    #+begin_src scheme

                                              ; - - - - - - Solution:
      ;; This wont work because the proxy-value of `y' (a) cannot be directly
      ;; referenced upon the definition of `dy'

    #+end_src
