_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-orgbe1ef37" class="outline-3">
<h3 id="orgbe1ef37">Exercise 4.16</h3>
<div class="outline-text-3" id="text-orgbe1ef37">
<div class="question" id="org99d4941">
<p>
In this exercise we implement the method just described for interpreting
internal definitions. We assume that the evaluator supports let (see Exercise
4.6).
</p>

<ol class="org-ol">
<li>Change `lookup-variable-value&rsquo; (4.1.3) to signal an error if the value it finds</li>
</ol>
<p>
is the symbol <b>unassigned</b>.
</p>
<ol class="org-ol">
<li>Write a procedure `scan-out-defines&rsquo; that takes a procedure body and returns an</li>
</ol>
<p>
equivalent one that has no internal definitions, by making the transformation
described above.
</p>
<ol class="org-ol">
<li>Install `scan-out-defines&rsquo; in the interpreter, either in make-procedure or in</li>
</ol>
<p>
procedure-body (see 4.1.3). Which place is better? Why? 
</p>

</div>
</div>
<div id="outline-container-org073cdf6" class="outline-4">
<h4 id="org073cdf6">Answer</h4>
<div class="outline-text-4" id="text-org073cdf6">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">1. Solution</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">simultaneous/lookup-variable-value</span> var env<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>var-process var env <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>_f entry<span style="color: #6c71c4;">)</span>
                         <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>eq? <span style="color: #b58900;">(</span>cdr entry<span style="color: #b58900;">)</span> '*unassigned*<span style="color: #859900;">)</span>
                             <span style="color: #859900;">(</span>error <span style="color: #2aa198;">"Unassigned var: "</span> var<span style="color: #859900;">)</span>
                             <span style="color: #859900;">(</span>cdr entry<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">2</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">scan-out-defines</span> expr<span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">"Transform a procedure, returning an equivalent one with no internal</span>
<span style="color: #2aa198;">definitions"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">has-define</span> <span style="color: #268bd2;">(</span>find <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #859900;">(</span>e<span style="color: #859900;">)</span> <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #b58900;">(</span>pair? e<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>eq? <span style="color: #268bd2;">(</span>car e<span style="color: #268bd2;">)</span> 'define<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
                           expr<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> has-define
      <span style="color: #268bd2;">(</span>fold
       <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #859900;">(</span>elt prev<span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">[</span>bindings <span style="color: #6c71c4;">(</span>let-bindings prev<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
               <span style="color: #268bd2;">[</span>body     <span style="color: #6c71c4;">(</span>let-body prev<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span>
           <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">merge our (new) bindings &amp; body</span>
           <span style="color: #b58900;">(</span>match elt
             <span style="color: #268bd2;">[</span><span style="color: #6c71c4;">(</span>'define var val<span style="color: #6c71c4;">)</span>
              `<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #859900;">(</span><span style="color: #2aa198;">(</span>,var '*unassigned*<span style="color: #2aa198;">)</span>
                     ,@bindings<span style="color: #859900;">)</span>
                 <span style="color: #859900;">(</span>set! ,var ,val<span style="color: #859900;">)</span>
                 <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">we use ,@ to prevent recursive lists</span>
                 ,@body<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
             <span style="color: #268bd2;">[</span>_ `<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">let</span> ,bindings ,@body ,elt<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
       '<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #859900;">()</span><span style="color: #6c71c4;">)</span> <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">we start with a basic let expression</span>
       expr<span style="color: #268bd2;">)</span>
      expr<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">simulatanous test</span>
<span style="color: #2aa198;">(</span>assert-equal
 <span style="color: #b58900;">(</span>scan-out-defines '<span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">a</span> <span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">)</span>
                     <span style="color: #6c71c4;">(</span>make-thing <span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">)</span>
                     <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">b</span> <span style="color: #6c71c4;">2</span><span style="color: #6c71c4;">)</span>
                     <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">c</span> <span style="color: #6c71c4;">3</span><span style="color: #6c71c4;">)</span>
                     <span style="color: #6c71c4;">(</span>make-thing a <span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
 '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>c '*unassigned*<span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span>b '*unassigned*<span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span>a '*unassigned*<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>set! c <span style="color: #6c71c4;">3</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>set! b <span style="color: #6c71c4;">2</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>set! a <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>make-thing <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>make-thing a <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">3 -- I've selected make-procedure so that the conversion is done at</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">interpretation, rather than runtime.</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">simultaneous/make-procedure</span> parameters body env<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>list 'procedure
        parameters
        <span style="color: #268bd2;">(</span>scan-out-defines body<span style="color: #268bd2;">)</span>
        env<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9505dff" class="outline-3">
<h3 id="org9505dff">Exercise 4.18</h3>
<div class="outline-text-3" id="text-org9505dff">
<div class="question" id="orgf0ce267">
<p>
Consider an alternative strategy for scanning out definitions that translates
the example in the text to
</p>

<p>
(lambda ⟨vars⟩
(let ((u &rsquo;<b>unassigned</b>)
(v &rsquo;<b>unassigned</b>))
(let ((a ⟨e1⟩)
(b ⟨e2⟩))
(set! u a)
(set! v b))
⟨e3⟩))
</p>

<p>
Here a and b are meant to represent new variable names, created by the
interpreter, that do not appear in the user’s program. Consider the solve
procedure from 3.5.4:
</p>

<p>
(define (solve f y0 dt)
(define y (integral (delay dy) y0 dt))
(define dy (stream-map f y))
y)
</p>

<p>
Will this procedure work if internal definitions are scanned out as shown in
this exercise? What if they are scanned out as shown in the text? Explain. 
</p>

</div>
</div>
<div id="outline-container-org98c5161" class="outline-4">
<h4 id="org98c5161">Answer</h4>
<div class="outline-text-4" id="text-org98c5161">
<div class="org-src-container">
<pre class="src src-scheme">
                                        <span style="color: #93a1a1;">; </span><span style="color: #93a1a1;">- - - - - - Solution:</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">This wont work because the proxy-value of `y' (a) cannot be directly</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">referenced upon the definition of `dy'</span>

</pre>
</div>
</div>
</div>
</div>
