org/_posts/2019-06-23-sicp-chapter-4.org
** Exercise 4.19
   #+begin_quote
   Ben Bitdiddle, Alyssa P. Hacker, and Eva Lu Ator are arguing about the desired
   result of evaluating the expression

   (let ((a 1))
   (define (f x)
   (define b (+ a x))
   (define a 5)
   (+ a b))
   (f 10))

   Ben asserts that the result should be obtained using the sequential rule for
   define: `b' is defined to be 11, then `a' is defined to be 5, so the result is
   16. Alyssa objects that mutual recursion requires the simultaneous scope rule
   for internal procedure definitions, and that it is unreasonable to treat
   procedure names differently from other names. Thus, she argues for the mechanism
   implemented in Exercise 4.16. This would lead to a being unassigned at the time
   that the value for `b' is to be computed. Hence, in Alyssa’s view the procedure
   should produce an error. Eva has a third opinion. She says that if the
   definitions of `a' and `b' are truly meant to be simultaneous, then the value 5
   for `a' should be used in evaluating b. Hence, in Eva’s view `a' should be 5, `b'
   should be 15, and the result should be 20. Which (if any) of these viewpoints do
   you support? Can you devise a way to implement internal definitions so that they
   behave as Eva prefers? 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| Solution
      I like Alyssas view, although Ben's dominates most thinking.
      |#

      ;; Eva's view can be easily supported by swapping the order within the `let'
      ;; quasiquote of `set!' and `@,body'

    #+end_src
** Exercise 4.20 (lol)
   #+begin_quote
   Because internal definitions look sequential but are actually simultaneous, some
   people prefer to avoid them entirely, and use the special form letrec instead.
   Letrec looks like let, so it is not surprising that the variables it binds are
   bound simultaneously and have the same scope as each other. The sample procedure
   f above can be written without internal definitions, but with exactly the same
   meaning, as

   (define (f x)
   (letrec
   ((even?
   (lambda (n)
   (if (= n 0)
   true
   (odd? (- n 1)))))
   (odd?
   (lambda (n)
   (if (= n 0)
   false
   (even? (- n 1))))))
   ⟨rest of body of f⟩))

   `letrec' expressions, which have the form

   (letrec ((⟨var₁⟩ ⟨exp₁⟩) … (⟨varₙ⟩ ⟨expₙ⟩))
   ⟨body⟩)

   are a variation on let in which the expressions ⟨expₖ⟩ that provide the initial
   values for the variables ⟨varₖ⟩ are evaluated in an environment that includes
   all the letrec bindings. This permits recursion in the bindings, such as the
   mutual recursion of even? and odd? in the example above, or the evaluation of 10
   factorial with

   (letrec
   ((fact
   (lambda (n)
   (if (= n 1)
   1
   (* n (fact (- n 1)))))))
   (fact 10))

   1. Implement letrec as a derived expression, by transforming a letrec expression
   into a let expression as shown in the text above or in Exercise 4.18. That is,
   the letrec variables should be created with a let and then be assigned their
   values with set!.

   2. Louis Reasoner is confused by all this fuss about internal definitions. The
   way he sees it, if you don’t like to use define inside a procedure, you can just
   use let. Illustrate what is loose about his reasoning by drawing an environment
   diagram that shows the environment in which the ⟨rest of body of f⟩ is evaluated
   during evaluation of the expression (f 5), with f defined as in this exercise.
   Draw an environment diagram for the same evaluation, but with let in place of
   letrec in the definition of f. 
   #+end_quote
