_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org85242e0" class="outline-3">
<h3 id="org85242e0">Exercise 4.19</h3>
<div class="outline-text-3" id="text-org85242e0">
<div class="question" id="orgc54801b">
<p>
Ben Bitdiddle, Alyssa P. Hacker, and Eva Lu Ator are arguing about the desired
result of evaluating the expression
</p>

<p>
(let ((a 1))
(define (f x)
(define b (+ a x))
(define a 5)
(+ a b))
(f 10))
</p>

<p>
Ben asserts that the result should be obtained using the sequential rule for
define: `b&rsquo; is defined to be 11, then `a&rsquo; is defined to be 5, so the result is
</p>
<ol class="org-ol">
<li>Alyssa objects that mutual recursion requires the simultaneous scope rule</li>
</ol>
<p>
for internal procedure definitions, and that it is unreasonable to treat
procedure names differently from other names. Thus, she argues for the mechanism
implemented in Exercise 4.16. This would lead to a being unassigned at the time
that the value for `b&rsquo; is to be computed. Hence, in Alyssa’s view the procedure
should produce an error. Eva has a third opinion. She says that if the
definitions of `a&rsquo; and `b&rsquo; are truly meant to be simultaneous, then the value 5
for `a&rsquo; should be used in evaluating b. Hence, in Eva’s view `a&rsquo; should be 5, `b&rsquo;
should be 15, and the result should be 20. Which (if any) of these viewpoints do
you support? Can you devise a way to implement internal definitions so that they
behave as Eva prefers? 
</p>

</div>
</div>
<div id="outline-container-org173450f" class="outline-4">
<h4 id="org173450f">Answer</h4>
<div class="outline-text-4" id="text-org173450f">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solution</span>
<span style="color: #93a1a1;">I like Alyssas view, although Ben's dominates most thinking.</span>
<span style="color: #93a1a1;">|#</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Eva's view can be easily supported by swapping the order within the `let'</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">quasiquote of `set!' and `@,body'</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org308dd94" class="outline-3">
<h3 id="org308dd94">Exercise 4.20 (lol)</h3>
<div class="outline-text-3" id="text-org308dd94">
<div class="question" id="org2044ab4">
<p>
Because internal definitions look sequential but are actually simultaneous, some
people prefer to avoid them entirely, and use the special form letrec instead.
Letrec looks like let, so it is not surprising that the variables it binds are
bound simultaneously and have the same scope as each other. The sample procedure
f above can be written without internal definitions, but with exactly the same
meaning, as
</p>

<p>
(define (f x)
  (letrec
  ((even?
    (lambda (n)
      (if (= n 0)
        true
      (odd? (- n 1)))))
        (odd?
          (lambda (n)
            (if (= n 0)
              false
              (even? (- n 1))))))
⟨rest of body of f⟩))
</p>

<p>
`letrec&rsquo; expressions, which have the form
</p>

<p>
(letrec ((⟨var₁⟩ ⟨exp₁⟩) … (⟨varₙ⟩ ⟨expₙ⟩))
⟨body⟩)
</p>

<p>
are a variation on let in which the expressions ⟨expₖ⟩ that provide the initial
values for the variables ⟨varₖ⟩ are evaluated in an environment that includes
all the letrec bindings. This permits recursion in the bindings, such as the
mutual recursion of even? and odd? in the example above, or the evaluation of 10
factorial with
</p>

<p>
(letrec
((fact
(lambda (n)
(if (= n 1)
1
(* n (fact (- n 1)))))))
(fact 10))
</p>

<ol class="org-ol">
<li>Implement letrec as a derived expression, by transforming a letrec expression</li>
</ol>
<p>
into a let expression as shown in the text above or in Exercise 4.18. That is,
the letrec variables should be created with a let and then be assigned their
values with set!.
</p>

<ol class="org-ol">
<li>Louis Reasoner is confused by all this fuss about internal definitions. The</li>
</ol>
<p>
way he sees it, if you don’t like to use define inside a procedure, you can just
use let. Illustrate what is loose about his reasoning by drawing an environment
diagram that shows the environment in which the ⟨rest of body of f⟩ is evaluated
during evaluation of the expression (f 5), with f defined as in this exercise.
Draw an environment diagram for the same evaluation, but with let in place of
letrec in the definition of f. 
</p>

</div>
</div>
