org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme

      ;; 1.
      (define (letrec->let expr)
        (%as-syntax
         (let
             ,(map ; generate the (binding . '*unassigned) let binds
               (λ (v) (list v ''*unassigned))
               (map car (cadr expr)))

           ,@(map ; generate the `set!' expressions
              (λ (bind) `(set! ,(car bind) ,(cadr bind)))
              (let-bindings expr))

           ;; and merge our existing body
           ,@(let-body expr))))

      (assert-equal
       (letrec->let
        `(letrec ((a (lambda () (b)))
                  (b (lambda () (a))))
           (x a)
           (x b)
           (x c)))

       '(let ((a '*unassigned)
              (b '*unassigned))
          (set! a (lambda () (b)))
          (set! b (lambda () (a)))
          (x a)
          (x b)
          (x c)))

      (install-procedure `(letrec ,(λ (exp env) (zeval (letrec->let exp) env))))
      ;; 2.
      ;; The main problem with Louis's reasoning is that the environment that `let' is
      ;; being evaluating against is actually expressed in the form of a `lambda' whoses
      ;; actual function bodies are being passed in as arguments (in the case of (f x)),
      ;; this means that the lexical scope of `even?' cannot see that of `odd?' and
      ;; versa.

    #+end_src
