_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org0ab9e38" class="outline-4">
<h4 id="org0ab9e38">Answer</h4>
<div class="outline-text-4" id="text-org0ab9e38">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">1.</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">letrec-&gt;let</span> expr<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>%as-syntax
   <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">let</span>
       ,<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">map</span> <span style="color: #93a1a1;">; </span><span style="color: #93a1a1;">generate the (binding . '*unassigned) let binds</span>
         <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #b58900;">(</span>v<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>list v ''*unassigned<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
         <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">map</span> car <span style="color: #b58900;">(</span>cadr expr<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>

     ,@<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">map</span> <span style="color: #93a1a1;">; </span><span style="color: #93a1a1;">generate the `set!' expressions</span>
        <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #b58900;">(</span>bind<span style="color: #b58900;">)</span> `<span style="color: #b58900;">(</span>set! ,<span style="color: #268bd2;">(</span>car bind<span style="color: #268bd2;">)</span> ,<span style="color: #268bd2;">(</span>cadr bind<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>let-bindings expr<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>

     <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">and merge our existing body</span>
     ,@<span style="color: #6c71c4;">(</span>let-body expr<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>assert-equal
 <span style="color: #b58900;">(</span>letrec-&gt;let
  `<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">letrec</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>a <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #268bd2;">()</span> <span style="color: #268bd2;">(</span>b<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
            <span style="color: #859900;">(</span>b <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #268bd2;">()</span> <span style="color: #268bd2;">(</span>a<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span>x a<span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span>x b<span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span>x c<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>

 '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>a '*unassigned<span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span>b '*unassigned<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>set! a <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #859900;">()</span> <span style="color: #859900;">(</span>b<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>set! b <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #859900;">()</span> <span style="color: #859900;">(</span>a<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>x a<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>x b<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>x c<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>install-procedure `<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">letrec</span> ,<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>exp env<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>zeval <span style="color: #859900;">(</span>letrec-&gt;let exp<span style="color: #859900;">)</span> env<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">2.</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">The main problem with Louis's reasoning is that the environment that `let' is</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">being evaluating against is actually expressed in the form of a `lambda' whoses</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">actual function bodies are being passed in as arguments (in the case of (f x)),</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">this means that the lexical scope of `even?' cannot see that of `odd?' and</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">versa.</span>

</pre>
</div>
</div>
</div>
</div>
