org/_posts/2019-06-23-sicp-chapter-4.org
** Exercise 4.21
   #+begin_quote
   Amazingly, Louis’s intuition in Exercise 4.20 is correct. It is indeed possible
   to specify recursive procedures without using letrec (or even define), although
   the method for accomplishing this is much more subtle than Louis imagined. The
   following expression computes 10 factorial by applying a recursive factorial
   procedure:231

   ((lambda (n)
   ((lambda (fact) (fact fact n))
   (lambda (ft k)
   (if (= k 1)
   1
   (* k (ft ft (- k 1)))))))
   10)

   1. Check (by evaluating the expression) that this really does compute
   factorials. Devise an analogous expression for computing Fibonacci numbers.

   Consider the following procedure, which includes mutually recursive internal
   definitions:

   (define (f x)
   (define (even? n)
   (if (= n 0)
   true
   (odd? (- n 1))))
   (define (odd? n)
   (if (= n 0)
   false
   (even? (- n 1))))
   (even? x))

   2. Fill in the missing expressions to complete an alternative definition of f,
   which uses neither internal definitions nor letrec:

   (define (f x)
   ((lambda (even? odd?)
   (even? even? odd? x))
   (lambda (ev? od? n)
   (if (= n 0)
   true
   (od? ⟨??⟩ ⟨??⟩ ⟨??⟩)))
   (lambda (ev? od? n)
   (if (= n 0)
   false
   (ev? ⟨??⟩ ⟨??⟩ ⟨??⟩))))) 
   #+end_quote
   *** Answer
   #+begin_src scheme

     ;; 1.
     ;; It does indeed produce Factorials
     (define funk-fibonacci
       (λ (n) ;; (it's a fibonacci number)
         ((λ (fib) (fib fib n))
          (λ (fb k)
            (match k
              [0 1]
              [1 1]
              [_ (+ (fb fb (- k 1))
                    (fb fb (- k 2)))])))))

     ;; 2.
     (define (feven-4.21 x)
       ((λ (even? odd?)
          (even? even? odd? x))
        (λ (ev? od? n)
          (if (= n 0)
              #t
              (od? ev? od? (- n 1))))
        (λ (ev? od? n)
          (if (= n 0)
              #f
              (ev? ev? od? (- n 1))))))

     (assert (= (funk-fibonacci 4) 5))
     (assert (feven-4.21 4))

   #+end_src


** Exercise 4.22
   #+begin_quote
   Extend the evaluator in this section to support the special form let. (See Exercise 4.6.) 
   #+end_quote
*** Answer
    #+begin_src scheme
      (install-analyze-procedure `(let ,(λ (exp) (analyze (let->combination exp)))))

    #+end_src

** Exercise 4.25
   #+begin_quote
   Suppose that (in ordinary applicative-order Scheme) we define unless as shown
   above and then define factorial in terms of unless as

   (define (factorial n)
   (unless (= n 1)
   (* n (factorial (- n 1)))
   1))
   What happens if we attempt to evaluate (factorial 5)? Will our definitions work
   in a normal-order language? 
   #+end_quote
*** Answer
    #+begin_src scheme

      ;; Solution:

      ;; Applicative order languages will cause an infinite loop with the definition
      ;; of `unless' provided by SICP -- on the other hand a normal-order language will
      ;; do just fine

    #+end_src
** Exercise 4.26
   #+begin_quote
   Ben Bitdiddle and Alyssa P. Hacker disagree over the importance of lazy
   evaluation for implementing things such as unless. Ben points out that it’s
   possible to implement unless in applicative order as a special form. Alyssa
   counters that, if one did that, unless would be merely syntax, not a procedure
   that could be used in conjunction with higher-order procedures. Fill in the
   details on both sides of the argument. Show how to implement unless as a derived
   expression (like cond or let), and give an example of a situation where it might
   be useful to have unless available as a procedure, rather than as a special
   form. 
   #+end_quote
