_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-orgaade11b" class="outline-3">
<h3 id="orgaade11b">Exercise 4.21</h3>
<div class="outline-text-3" id="text-orgaade11b">
<div class="question" id="org1a06269">
<p>
Amazingly, Louis’s intuition in Exercise 4.20 is correct. It is indeed possible
to specify recursive procedures without using letrec (or even define), although
the method for accomplishing this is much more subtle than Louis imagined. The
following expression computes 10 factorial by applying a recursive factorial
procedure:231
</p>

<p>
((lambda (n)
((lambda (fact) (fact fact n))
(lambda (ft k)
(if (= k 1)
1
(* k (ft ft (- k 1)))))))
</p>
<ol class="org-ol">
<li></li>
</ol>
<ol class="org-ol">
<li>Check (by evaluating the expression) that this really does compute</li>
</ol>
<p>
factorials. Devise an analogous expression for computing Fibonacci numbers.
</p>

<p>
Consider the following procedure, which includes mutually recursive internal
definitions:
</p>

<p>
(define (f x)
(define (even? n)
(if (= n 0)
true
(odd? (- n 1))))
(define (odd? n)
(if (= n 0)
false
(even? (- n 1))))
(even? x))
</p>

<ol class="org-ol">
<li>Fill in the missing expressions to complete an alternative definition of f,</li>
</ol>
<p>
which uses neither internal definitions nor letrec:
</p>

<p>
(define (f x)
((lambda (even? odd?)
(even? even? odd? x))
(lambda (ev? od? n)
(if (= n 0)
true
(od? ⟨??⟩ ⟨??⟩ ⟨??⟩)))
(lambda (ev? od? n)
(if (= n 0)
false
(ev? ⟨??⟩ ⟨??⟩ ⟨??⟩))))) 
</p>

</div>
<p>
<b>*</b> Answer
</p>
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">1.</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">It does indeed produce Factorials</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">funk-fibonacci</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #268bd2;">(</span>n<span style="color: #268bd2;">)</span> <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">(it's a fibonacci number)</span>
    <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #859900;">(</span>fib<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>fib fib n<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #859900;">(</span>fb k<span style="color: #859900;">)</span>
       <span style="color: #859900;">(</span>match k
         <span style="color: #b58900;">[</span><span style="color: #6c71c4;">0</span> <span style="color: #6c71c4;">1</span><span style="color: #b58900;">]</span>
         <span style="color: #b58900;">[</span><span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">1</span><span style="color: #b58900;">]</span>
         <span style="color: #b58900;">[</span>_ <span style="color: #268bd2;">(</span>+ <span style="color: #6c71c4;">(</span>fb fb <span style="color: #859900;">(</span>- k <span style="color: #6c71c4;">1</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
               <span style="color: #6c71c4;">(</span>fb fb <span style="color: #859900;">(</span>- k <span style="color: #6c71c4;">2</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">]</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">2.</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">feven-4.21</span> x<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>even? odd?<span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span>even? even? odd? x<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
   <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>ev? od? n<span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>= n <span style="color: #6c71c4;">0</span><span style="color: #859900;">)</span>
         #t
         <span style="color: #859900;">(</span>od? ev? od? <span style="color: #b58900;">(</span>- n <span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
   <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>ev? od? n<span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>= n <span style="color: #6c71c4;">0</span><span style="color: #859900;">)</span>
         #f
         <span style="color: #859900;">(</span>ev? ev? od? <span style="color: #b58900;">(</span>- n <span style="color: #6c71c4;">1</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>assert <span style="color: #b58900;">(</span>= <span style="color: #268bd2;">(</span>funk-fibonacci <span style="color: #6c71c4;">4</span><span style="color: #268bd2;">)</span> <span style="color: #6c71c4;">5</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>assert <span style="color: #b58900;">(</span>feven-4.21 <span style="color: #6c71c4;">4</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>


<div id="outline-container-orgbfb4436" class="outline-3">
<h3 id="orgbfb4436">Exercise 4.22</h3>
<div class="outline-text-3" id="text-orgbfb4436">
<div class="question" id="orga46bd23">
<p>
Extend the evaluator in this section to support the special form let. (See Exercise 4.6.) 
</p>

</div>
</div>
<div id="outline-container-orgd9e0646" class="outline-4">
<h4 id="orgd9e0646">Answer</h4>
<div class="outline-text-4" id="text-orgd9e0646">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span>install-analyze-procedure `<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> ,<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>exp<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>analyze <span style="color: #859900;">(</span>let-&gt;combination exp<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgbfb1012" class="outline-3">
<h3 id="orgbfb1012">Exercise 4.25</h3>
<div class="outline-text-3" id="text-orgbfb1012">
<div class="question" id="org281044a">
<p>
Suppose that (in ordinary applicative-order Scheme) we define unless as shown
above and then define factorial in terms of unless as
</p>

<p>
       (define (factorial n)
       (unless (= n 1)
       (* n (factorial (- n 1)))
       1))
What happens if we attempt to evaluate (factorial 5)? Will our definitions work
in a normal-order language? 
</p>

</div>
</div>
<div id="outline-container-org3b24cdf" class="outline-4">
<h4 id="org3b24cdf">Answer</h4>
<div class="outline-text-4" id="text-org3b24cdf">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Solution:</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Applicative order languages will cause an infinite loop with the definition</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">of `unless' provided by SICP -- on the other hand a normal-order language will</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">do just fine</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org00a0cee" class="outline-3">
<h3 id="org00a0cee">Exercise 4.26</h3>
<div class="outline-text-3" id="text-org00a0cee">
<div class="question" id="orge3b701b">
<p>
Ben Bitdiddle and Alyssa P. Hacker disagree over the importance of lazy
evaluation for implementing things such as unless. Ben points out that it’s
possible to implement unless in applicative order as a special form. Alyssa
counters that, if one did that, unless would be merely syntax, not a procedure
that could be used in conjunction with higher-order procedures. Fill in the
details on both sides of the argument. Show how to implement unless as a derived
expression (like cond or let), and give an example of a situation where it might
be useful to have unless available as a procedure, rather than as a special
form. 
</p>

</div>
</div>
