org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme
      (define (zv-unless condition consequent alternative)
        (if condition alternative
            consequent))

      (generate-accessors
       ([unless-predicate cadr]
        [unless-alternative caddr]))

      (define (unless-consequent exp)
        (if (not (null? (cdddr exp)))
            (cadddr exp)
            'false))

      (define (unless->if exp)
        (make-if
         (unless-predicate exp)
         (unless-consequent exp)
         (unless-alternative exp)))

      (define (analyze-unless exp)
        (let ([pproc (analyze (unless-predicate exp))]
              [cproc (analyze (unless-consequent exp))]
              [aproc (analyze (unless-alternative exp))])
          (lambda (env)
            (if (true? (pproc env))
                (cproc env)
                (aproc env)))))

      (install-procedure `(unless ,(λ (exp env) (zeval (unless->if exp) env))))
      (install-analyze-procedure `(unless ,analyze-unless))

      ;; this functions utility is for lazy bums who cant type `not'
      ;; Various evaluator utils
    #+end_src
    ;; Lazy Evaluator
    (include "/home/zv/z/practice/sicp/evaluator/lazy-evaluator.scm")

    ;; Install our new driver-loop
    (define (lazy-driver-loop)
    (prompt-for-input ";; Lazy (leval) input: ")
    (let* ((input (read))
    (output (actual-value input the-global-environment)))
    (announce-output output-prompt)
    (user-print output))
    (lazy-driver-loop))

    (install-driver-loop 'leval lazy-driver-loop)
    #+end_src
** Exercise 4.27
   #+begin_quote
   Suppose we type in the following definitions to the lazy evaluator:

   (define count 0)
   (define (id x) (set! count (+ count 1)) x)
   (define w (id (id 10)))

   Give the missing values in the following sequence of interactions, and explain
   your answers.


   ;;; L-Eval input:
   count

   ;;; L-Eval value:
   1

   ;;; L-Eval input:
   w

   ;;; L-Eval value:
   10

   ;;; L-Eval input:
   count

   ;;; L-Eval value:
   2

   #+end_quote
*** Answer
    #+begin_src scheme
    #+end_src
** Exercise 4.28
   #+begin_quote
   lazy-eval uses actual-value rather than leval to evaluate the operator before passing
   it to apply, in order to force the value of the operator. Give an example that
   demonstrates the need for this forcing.

   #+end_quote
*** Answer
    #+begin_src scheme

      ;; Solution
      ;; Any function using a lambda as an argument will fail -- the operands are
      ;; not forced and when trying to apply them you will attempt to apply a thunk
      ;; instead of a "real" value.
    #+end_src
** Exercise 4.29
   #+begin_quote
   Exhibit a program that you would expect to run much more slowly without
   memoization than with memoization. Also, consider the following interaction,
   where the id procedure is defined as in Exercise 4.27 and count starts at 0:

   (define (square x) (* x x))

   ;;; L-Eval input:
   (square (id 10))

   ;;; L-Eval value:
   ⟨response⟩

   ;;; L-Eval input:
   count

   ;;; L-Eval value:
   ⟨response⟩

   Give the responses both when the evaluator memoizes and when it does not.

   #+end_quote
*** Answer
    #+begin_src scheme

      ;; Solutions

      ;; The canonical example of a function sped up by memoization is factorial --
      ;; each of the components can be reused n^2 times


      #| Memoized:
      ;;; L-Eval input:
      (square (id 10))

      ;;; L-Eval value:
      100

      ;;; L-Eval input:
      count

      ;;; L-Eval value:
      1
      |#

      #| Raw:

      ;;; L-Eval input:
      (square (id 10))

      ;;; L-Eval value:
      100

      ;;; L-Eval input:
      count

      ;;; L-Eval value:
      2

      |#
    #+end_src
