_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-orged82170" class="outline-4">
<h4 id="orged82170">Answer</h4>
<div class="outline-text-4" id="text-orged82170">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">zv-unless</span> condition consequent alternative<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> condition alternative
      consequent<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>generate-accessors
 <span style="color: #b58900;">(</span><span style="color: #268bd2;">[</span>unless-predicate cadr<span style="color: #268bd2;">]</span>
  <span style="color: #268bd2;">[</span>unless-alternative caddr<span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">unless-consequent</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>not <span style="color: #6c71c4;">(</span>null? <span style="color: #859900;">(</span>cdddr exp<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
      <span style="color: #268bd2;">(</span>cadddr exp<span style="color: #268bd2;">)</span>
      'false<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">unless-&gt;if</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>make-if
   <span style="color: #268bd2;">(</span>unless-predicate exp<span style="color: #268bd2;">)</span>
   <span style="color: #268bd2;">(</span>unless-consequent exp<span style="color: #268bd2;">)</span>
   <span style="color: #268bd2;">(</span>unless-alternative exp<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">analyze-unless</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>pproc <span style="color: #859900;">(</span>analyze <span style="color: #b58900;">(</span>unless-predicate exp<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
        <span style="color: #6c71c4;">[</span>cproc <span style="color: #859900;">(</span>analyze <span style="color: #b58900;">(</span>unless-consequent exp<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
        <span style="color: #6c71c4;">[</span>aproc <span style="color: #859900;">(</span>analyze <span style="color: #b58900;">(</span>unless-alternative exp<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #6c71c4;">(</span>env<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>true? <span style="color: #b58900;">(</span>pproc env<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>cproc env<span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>aproc env<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>install-procedure `<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">unless</span> ,<span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>exp env<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>zeval <span style="color: #859900;">(</span>unless-&gt;if exp<span style="color: #859900;">)</span> env<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>install-analyze-procedure `<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">unless</span> ,analyze-unless<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">this functions utility is for lazy bums who cant type `not'</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Various evaluator utils</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf8534e8" class="outline-3">
<h3 id="orgf8534e8">Exercise 4.27</h3>
<div class="outline-text-3" id="text-orgf8534e8">
<div class="question" id="orgff53ee8">
<p>
Suppose we type in the following definitions to the lazy evaluator:
</p>

<p>
(define count 0)
(define (id x) (set! count (+ count 1)) x)
(define w (id (id 10)))
</p>

<p>
Give the missing values in the following sequence of interactions, and explain
your answers.
</p>


<p>
;;; L-Eval input:
count
</p>

<p>
;;; L-Eval value:
1
</p>

<p>
;;; L-Eval input:
w
</p>

<p>
;;; L-Eval value:
10
</p>

<p>
;;; L-Eval input:
count
</p>

<p>
;;; L-Eval value:
2
</p>

</div>
</div>
<div id="outline-container-orgf58a2ce" class="outline-4">
<h4 id="orgf58a2ce">Answer</h4>
<div class="outline-text-4" id="text-orgf58a2ce">
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb86c5a8" class="outline-3">
<h3 id="orgb86c5a8">Exercise 4.28</h3>
<div class="outline-text-3" id="text-orgb86c5a8">
<div class="question" id="orgb87fca4">
<p>
lazy-eval uses actual-value rather than leval to evaluate the operator before passing
it to apply, in order to force the value of the operator. Give an example that
demonstrates the need for this forcing.
</p>

</div>
</div>
<div id="outline-container-orgc282545" class="outline-4">
<h4 id="orgc282545">Answer</h4>
<div class="outline-text-4" id="text-orgc282545">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Solution</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Any function using a lambda as an argument will fail -- the operands are</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">not forced and when trying to apply them you will attempt to apply a thunk</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">instead of a "real" value.</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc980443" class="outline-3">
<h3 id="orgc980443">Exercise 4.29</h3>
<div class="outline-text-3" id="text-orgc980443">
<div class="question" id="org8dd3c13">
<p>
Exhibit a program that you would expect to run much more slowly without
memoization than with memoization. Also, consider the following interaction,
where the id procedure is defined as in Exercise 4.27 and count starts at 0:
</p>

<p>
(define (square x) (* x x))
</p>

<p>
;;; L-Eval input:
(square (id 10))
</p>

<p>
;;; L-Eval value:
⟨response⟩
</p>

<p>
;;; L-Eval input:
count
</p>

<p>
;;; L-Eval value:
⟨response⟩
</p>

<p>
Give the responses both when the evaluator memoizes and when it does not.
</p>

</div>
</div>
<div id="outline-container-org01cdda4" class="outline-4">
<h4 id="org01cdda4">Answer</h4>
<div class="outline-text-4" id="text-org01cdda4">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Solutions</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">The canonical example of a function sped up by memoization is factorial --</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">each of the components can be reused n^2 times</span>


<span style="color: #93a1a1;">#| Memoized:</span>
<span style="color: #93a1a1;">;;; L-Eval input:</span>
<span style="color: #93a1a1;">(square (id 10))</span>

<span style="color: #93a1a1;">;;; L-Eval value:</span>
<span style="color: #93a1a1;">100</span>

<span style="color: #93a1a1;">;;; L-Eval input:</span>
<span style="color: #93a1a1;">count</span>

<span style="color: #93a1a1;">;;; L-Eval value:</span>
<span style="color: #93a1a1;">1</span>
<span style="color: #93a1a1;">|#</span>

<span style="color: #93a1a1;">#| Raw:</span>

<span style="color: #93a1a1;">;;; L-Eval input:</span>
<span style="color: #93a1a1;">(square (id 10))</span>

<span style="color: #93a1a1;">;;; L-Eval value:</span>
<span style="color: #93a1a1;">100</span>

<span style="color: #93a1a1;">;;; L-Eval input:</span>
<span style="color: #93a1a1;">count</span>

<span style="color: #93a1a1;">;;; L-Eval value:</span>
<span style="color: #93a1a1;">2</span>

<span style="color: #93a1a1;">|#</span>
</pre>
</div>
</div>
</div>
</div>
