org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme

      (define (perpetual-thunk? obj) (tagged-list? obj 'always-thunk))
      (define (delay-it-perpetually exp env)
        (list 'always-thunk exp env))

      (define (list-of-resolved-args parameters arguments env)
        (map
         (λ (p a)
           (match p
             [(_ 'lazy)       (delay-it-perpetually a env)]
             [(_ 'lazy-memo)  (delay-it a env)]
             [_               a]))
         parameters
         arguments))

      (define (force-it obj)
        "This is just a memoizing version of `force-it'"
        (define (fetch-result e)
          (actual-value (thunk-exp e) (thunk-env e)))
        (match obj
          [thunk?
           (let ([result (fetch-result obj)])
             (set! obj `(evaluated-thunk ,result))
             result)]
          [evaluated-thunk? (thunk-value obj)]
          [perpetual-thunk? (fetch-result obj)]
          [_ obj]))

      (define (fetch-parameter p) (if (pair? p) (car p) p))
      (define (extract-parameters fn)
        (map fetch-parameter (procedure-parameters fn)))

      (define (capply procedure arguments env)
        "capply is a combined `apply' function -- determining which parameters are
      lazy, memoized or raw and supplying them to the function at hand"
        ;;(format #t "procedure: ~a\narguments: ~a\nenv: ~a" procedure arguments env)
        (cond ((primitive-procedure? procedure)
               (apply-primitive-procedure
                procedure
                (list-of-arg-values arguments env)))  ; changed
              ((compound-procedure? procedure)
               (leval-sequence
                (procedure-body procedure)

                (extend-environment
                 (extract-parameters procedure)
                 (list-of-resolved-args (procedure-parameters procedure)
                                        arguments
                                        env) ; changed
                 (procedure-environment procedure))))
              (else (error "Unknown procedure type: APPLY" procedure))))

      ;; Install our new driver-loop
      (define (combined-driver-loop)
        (prompt-for-input ";; Strict/Lazy (ceval) input: ")
        (let* ((input (read))
               (output (actual-value input the-global-environment)))
          (announce-output output-prompt)
          (user-print output))
        (combined-driver-loop))

      (install-driver-loop 'ceval combined-driver-loop)
    #+end_src

** Exercise 4.35
   #+begin_quote
   Write a procedure an-integer-between that returns an integer between two given
   bounds. This can be used to implement a procedure that finds Pythagorean
   triples, i.e., triples of integers ( i , j , k ) between the given bounds such
   that i ≤ j and i 2 + j 2 = k 2 , as follows:

   (define (a-pythagorean-triple-between low high)
   (let ((i (an-integer-between low high)))
   (let ((j (an-integer-between i high)))
   (let ((k (an-integer-between j high)))
   (require (= (+ (* i i) (* j j))
   (* k k)))
   (list i j k)))))

   #+end_quote
*** Answer
    #+begin_src scheme

      (amb/infuse
       '(define (an-integer-between low high)
          (require (< low high))
          (amb low
               (an-integer-between (+ 1 low) high))))

    #+end_src
