_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-orgbfe0408" class="outline-4">
<h4 id="orgbfe0408">Answer</h4>
<div class="outline-text-4" id="text-orgbfe0408">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">perpetual-thunk?</span> obj<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>tagged-list? obj 'always-thunk<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">delay-it-perpetually</span> exp env<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>list 'always-thunk exp env<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">list-of-resolved-args</span> parameters arguments env<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">map</span>
   <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>p a<span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span>match p
       <span style="color: #859900;">[</span><span style="color: #b58900;">(</span>_ 'lazy<span style="color: #b58900;">)</span>       <span style="color: #b58900;">(</span>delay-it-perpetually a env<span style="color: #b58900;">)</span><span style="color: #859900;">]</span>
       <span style="color: #859900;">[</span><span style="color: #b58900;">(</span>_ 'lazy-memo<span style="color: #b58900;">)</span>  <span style="color: #b58900;">(</span>delay-it a env<span style="color: #b58900;">)</span><span style="color: #859900;">]</span>
       <span style="color: #859900;">[</span>_               a<span style="color: #859900;">]</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
   parameters
   arguments<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">force-it</span> obj<span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">"This is just a memoizing version of `force-it'"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">fetch-result</span> e<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>actual-value <span style="color: #6c71c4;">(</span>thunk-exp e<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>thunk-env e<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>match obj
    <span style="color: #268bd2;">[</span>thunk?
     <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #859900;">(</span><span style="color: #b58900;">[</span>result <span style="color: #268bd2;">(</span>fetch-result obj<span style="color: #268bd2;">)</span><span style="color: #b58900;">]</span><span style="color: #859900;">)</span>
       <span style="color: #859900;">(</span>set! obj `<span style="color: #b58900;">(</span>evaluated-thunk ,result<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
       result<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
    <span style="color: #268bd2;">[</span>evaluated-thunk? <span style="color: #6c71c4;">(</span>thunk-value obj<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
    <span style="color: #268bd2;">[</span>perpetual-thunk? <span style="color: #6c71c4;">(</span>fetch-result obj<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
    <span style="color: #268bd2;">[</span>_ obj<span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">fetch-parameter</span> p<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>pair? p<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>car p<span style="color: #268bd2;">)</span> p<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">extract-parameters</span> fn<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">map</span> fetch-parameter <span style="color: #268bd2;">(</span>procedure-parameters fn<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">capply</span> procedure arguments env<span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">"capply is a combined `apply' function -- determining which parameters are</span>
<span style="color: #2aa198;">lazy, memoized or raw and supplying them to the function at hand"</span>
  <span style="color: #93a1a1;">;;</span><span style="color: #93a1a1;">(format #t "procedure: ~a\narguments: ~a\nenv: ~a" procedure arguments env)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">cond</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>primitive-procedure? procedure<span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>apply-primitive-procedure
          procedure
          <span style="color: #859900;">(</span>list-of-arg-values arguments env<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>  <span style="color: #93a1a1;">; </span><span style="color: #93a1a1;">changed</span>
        <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>compound-procedure? procedure<span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>leval-sequence
          <span style="color: #859900;">(</span>procedure-body procedure<span style="color: #859900;">)</span>

          <span style="color: #859900;">(</span>extend-environment
           <span style="color: #b58900;">(</span>extract-parameters procedure<span style="color: #b58900;">)</span>
           <span style="color: #b58900;">(</span>list-of-resolved-args <span style="color: #268bd2;">(</span>procedure-parameters procedure<span style="color: #268bd2;">)</span>
                                  arguments
                                  env<span style="color: #b58900;">)</span> <span style="color: #93a1a1;">; </span><span style="color: #93a1a1;">changed</span>
           <span style="color: #b58900;">(</span>procedure-environment procedure<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">else</span> <span style="color: #6c71c4;">(</span>error <span style="color: #2aa198;">"Unknown procedure type: APPLY"</span> procedure<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Install our new driver-loop</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">combined-driver-loop</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>prompt-for-input <span style="color: #2aa198;">";; Strict/Lazy (ceval) input: "</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>input <span style="color: #859900;">(</span>read<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>output <span style="color: #859900;">(</span>actual-value input the-global-environment<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>announce-output output-prompt<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>user-print output<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>combined-driver-loop<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>install-driver-loop 'ceval combined-driver-loop<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org414fbe1" class="outline-3">
<h3 id="org414fbe1">Exercise 4.35</h3>
<div class="outline-text-3" id="text-org414fbe1">
<div class="question" id="orgdec388e">
<p>
Write a procedure an-integer-between that returns an integer between two given
bounds. This can be used to implement a procedure that finds Pythagorean
triples, i.e., triples of integers ( i , j , k ) between the given bounds such
that i ≤ j and i 2 + j 2 = k 2 , as follows:
</p>

<p>
(define (a-pythagorean-triple-between low high)
(let ((i (an-integer-between low high)))
(let ((j (an-integer-between i high)))
(let ((k (an-integer-between j high)))
(require (= (+ (* i i) (* j j))
(* k k)))
(list i j k)))))
</p>

</div>
</div>
<div id="outline-container-orgcf72ffa" class="outline-4">
<h4 id="orgcf72ffa">Answer</h4>
<div class="outline-text-4" id="text-orgcf72ffa">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #2aa198;">(</span>amb/infuse
 '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">an-integer-between</span> low high<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>require <span style="color: #6c71c4;">(</span>&lt; low high<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>amb low
         <span style="color: #6c71c4;">(</span>an-integer-between <span style="color: #859900;">(</span>+ <span style="color: #6c71c4;">1</span> low<span style="color: #859900;">)</span> high<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
