org/_posts/2019-06-23-sicp-chapter-4.org
** Exercise 4.36
   #+begin_quote
   Exercise 3.69 discussed how to generate the stream of all Pythagorean triples,
   with no upper bound on the size of the integers to be searched. Explain why
   simply replacing an-integer-between by an-integer-starting-from in the procedure
   in Exercise 4.35 is not an adequate way to generate arbitrary Pythagorean
   triples. Write a procedure that actually will accomplish this. (That is, write a
   procedure for which repeatedly typing try-again would in principle eventually
   generate all Pythagorean triples.) 
   #+end_quote
*** Answer
    #+begin_src scheme

      (append! primitive-procedures `((sqrt ,sqrt)))
      (amb/infuse
       '(define (pyth-triple)
          (define k (an-integer-starting-from 1))
          (define j (an-integer-between 1 k))
          (define i (an-integer-between 1 j))
          (require (= (+ (* i i) (* j j))
                      (* k k)))
          (list i j k)))

      #| Solution Explanation:
      Depth first search means that an infinite `amb' loop will never progress past
      the first 'amb' |#

    #+end_src
** Exercise 4.37
   #+begin_quote
   Ben Bitdiddle claims that the following method for generating Pythagorean
   triples is more efficient than the one in Exercise 4.35. Is he correct? (Hint:
   Consider the number of possibilities that must be explored.)

   (define (a-pythagorean-triple-between low high)
   (let ((i (an-integer-between low high))
   (hsq (* high high)))
   (let ((j (an-integer-between i high)))
   (let ((ksq (+ (* i i) (* j j))))
   (require (>= hsq ksq))
   (let ((k (sqrt ksq)))
   (require (integer? k))
   (list i j k))))))

   #+end_quote
*** Answer
    #+begin_src scheme

      ;; It seems to be -- Ben's method only uses N^2 space, while the .35 method uses
      ;; N^3 space, while also throwing away tons of 'impossible' results.
    #+end_src

** Exercise 4.38
   #+begin_quote
   Modify the multiple-dwelling procedure to omit the requirement that Smith and
   Fletcher do not live on adjacent floors. How many solutions are there to this
   modified puzzle? 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| Solution

      ;; There are 5 distinct solutions

      |#
      (amb/infuse
       '(define (multiple-dwelling)
          (define baker (amb 1 2 3 4 5))
          (define cooper (amb 1 2 3 4 5))
          (define fletcher (amb 1 2 3 4 5))
          (define miller (amb 1 2 3 4 5))
          (define smith (amb 1 2 3 4 5))
          (require
           (distinct? (list baker cooper fletcher
                            miller smith)))
          (require (not (= baker 5)))
          (require (not (= cooper 1)))
          (require (not (= fletcher 5)))
          (require (not (= fletcher 1)))
          (require (> miller cooper))
          (require
           (not (= (abs (- fletcher cooper)) 1)))
          (list (list 'baker baker)
                (list 'cooper cooper)
                (list 'fletcher fletcher)
                (list 'miller miller)
                (list 'smith smith))))

    #+end_src
** Exercise 4.39
   #+begin_quote
   Does the order of the restrictions in the multiple-dwelling procedure affect the
   answer? Does it affect the time to find an answer? If you think it matters,
   demonstrate a faster program obtained from the given one by reordering the
   restrictions. If you think it does not matter, argue your case. 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| Solution:
      The order of the restrictions can matter regarding runtime invoking the
      'failure' continuation through a `require' statement or otherwise can prevent a
      great deal of work from being performed.
      |#
    #+end_src
