_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org436173f" class="outline-3">
<h3 id="org436173f">Exercise 4.36</h3>
<div class="outline-text-3" id="text-org436173f">
<div class="question" id="org7ea298d">
<p>
Exercise 3.69 discussed how to generate the stream of all Pythagorean triples,
with no upper bound on the size of the integers to be searched. Explain why
simply replacing an-integer-between by an-integer-starting-from in the procedure
in Exercise 4.35 is not an adequate way to generate arbitrary Pythagorean
triples. Write a procedure that actually will accomplish this. (That is, write a
procedure for which repeatedly typing try-again would in principle eventually
generate all Pythagorean triples.) 
</p>

</div>
</div>
<div id="outline-container-orgcb9e2fb" class="outline-4">
<h4 id="orgcb9e2fb">Answer</h4>
<div class="outline-text-4" id="text-orgcb9e2fb">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #2aa198;">(</span>append! primitive-procedures `<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>sqrt ,sqrt<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>amb/infuse
 '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">pyth-triple</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">k</span> <span style="color: #6c71c4;">(</span>an-integer-starting-from <span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">j</span> <span style="color: #6c71c4;">(</span>an-integer-between <span style="color: #6c71c4;">1</span> k<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">i</span> <span style="color: #6c71c4;">(</span>an-integer-between <span style="color: #6c71c4;">1</span> j<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>require <span style="color: #6c71c4;">(</span>= <span style="color: #859900;">(</span>+ <span style="color: #b58900;">(</span>* i i<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>* j j<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
                <span style="color: #859900;">(</span>* k k<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>list i j k<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">#| Solution Explanation:</span>
<span style="color: #93a1a1;">Depth first search means that an infinite `amb' loop will never progress past</span>
<span style="color: #93a1a1;">the first 'amb' |#</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgcdde925" class="outline-3">
<h3 id="orgcdde925">Exercise 4.37</h3>
<div class="outline-text-3" id="text-orgcdde925">
<div class="question" id="org251b528">
<p>
Ben Bitdiddle claims that the following method for generating Pythagorean
triples is more efficient than the one in Exercise 4.35. Is he correct? (Hint:
Consider the number of possibilities that must be explored.)
</p>

<p>
(define (a-pythagorean-triple-between low high)
(let ((i (an-integer-between low high))
(hsq (* high high)))
(let ((j (an-integer-between i high)))
(let ((ksq (+ (* i i) (* j j))))
(require (&gt;= hsq ksq))
(let ((k (sqrt ksq)))
(require (integer? k))
(list i j k))))))
</p>

</div>
</div>
<div id="outline-container-org419669a" class="outline-4">
<h4 id="org419669a">Answer</h4>
<div class="outline-text-4" id="text-org419669a">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">It seems to be -- Ben's method only uses N^2 space, while the .35 method uses</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">N^3 space, while also throwing away tons of 'impossible' results.</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2a8028f" class="outline-3">
<h3 id="org2a8028f">Exercise 4.38</h3>
<div class="outline-text-3" id="text-org2a8028f">
<div class="question" id="org553ff34">
<p>
Modify the multiple-dwelling procedure to omit the requirement that Smith and
Fletcher do not live on adjacent floors. How many solutions are there to this
modified puzzle? 
</p>

</div>
</div>
<div id="outline-container-org998055e" class="outline-4">
<h4 id="org998055e">Answer</h4>
<div class="outline-text-4" id="text-org998055e">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solution</span>

<span style="color: #93a1a1;">;; There are 5 distinct solutions</span>

<span style="color: #93a1a1;">|#</span>
<span style="color: #2aa198;">(</span>amb/infuse
 '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">multiple-dwelling</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">baker</span> <span style="color: #6c71c4;">(</span>amb <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">cooper</span> <span style="color: #6c71c4;">(</span>amb <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">fletcher</span> <span style="color: #6c71c4;">(</span>amb <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">miller</span> <span style="color: #6c71c4;">(</span>amb <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">smith</span> <span style="color: #6c71c4;">(</span>amb <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>require
     <span style="color: #6c71c4;">(</span>distinct? <span style="color: #859900;">(</span>list baker cooper fletcher
                      miller smith<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>require <span style="color: #6c71c4;">(</span>not <span style="color: #859900;">(</span>= baker <span style="color: #6c71c4;">5</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>require <span style="color: #6c71c4;">(</span>not <span style="color: #859900;">(</span>= cooper <span style="color: #6c71c4;">1</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>require <span style="color: #6c71c4;">(</span>not <span style="color: #859900;">(</span>= fletcher <span style="color: #6c71c4;">5</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>require <span style="color: #6c71c4;">(</span>not <span style="color: #859900;">(</span>= fletcher <span style="color: #6c71c4;">1</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>require <span style="color: #6c71c4;">(</span>&gt; miller cooper<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>require
     <span style="color: #6c71c4;">(</span>not <span style="color: #859900;">(</span>= <span style="color: #b58900;">(</span>abs <span style="color: #268bd2;">(</span>- fletcher cooper<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> <span style="color: #6c71c4;">1</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>list <span style="color: #6c71c4;">(</span>list 'baker baker<span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span>list 'cooper cooper<span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span>list 'fletcher fletcher<span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span>list 'miller miller<span style="color: #6c71c4;">)</span>
          <span style="color: #6c71c4;">(</span>list 'smith smith<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org97fa254" class="outline-3">
<h3 id="org97fa254">Exercise 4.39</h3>
<div class="outline-text-3" id="text-org97fa254">
<div class="question" id="orgdf7c89d">
<p>
Does the order of the restrictions in the multiple-dwelling procedure affect the
answer? Does it affect the time to find an answer? If you think it matters,
demonstrate a faster program obtained from the given one by reordering the
restrictions. If you think it does not matter, argue your case. 
</p>

</div>
</div>
<div id="outline-container-orgdc851b4" class="outline-4">
<h4 id="orgdc851b4">Answer</h4>
<div class="outline-text-4" id="text-orgdc851b4">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solution:</span>
<span style="color: #93a1a1;">The order of the restrictions can matter regarding runtime invoking the</span>
<span style="color: #93a1a1;">'failure' continuation through a `require' statement or otherwise can prevent a</span>
<span style="color: #93a1a1;">great deal of work from being performed.</span>
<span style="color: #93a1a1;">|#</span>
</pre>
</div>
</div>
</div>
</div>
