org/_posts/2019-06-23-sicp-chapter-4.org
** TODO: Exercise 4.40
   #+begin_quote
   In the multiple dwelling problem, how many sets of assignments are there of
   people to floors, both before and after the requirement that floor assignments
   be distinct? It is very inefficient to generate all possible assignments of
   people to floors and then leave it to backtracking to eliminate them. For
   example, most of the restrictions depend on only one or two of the person-floor
   variables, and can thus be imposed before floors have been selected for all the
   people. Write and demonstrate a much more efficient nondeterministic procedure
   that solves this problem based upon generating only those possibilities that are
   not already ruled out by previous restrictions. (Hint: This will require a nest
   of `let' expressions.) 
   #+end_quote
*** Answer
    #+begin_src scheme
    #+end_src
** Exercise 4.41
   #+begin_quote
   Write an ordinary Scheme program to solve the multiple dwelling puzzle. 
   #+end_quote
*** Answer
    #+begin_src scheme

      (define possible-floors '([baker (1 2 3 4)]
                                [cooper (2 3 4 5)]
                                [fletcher (2 3 4)]
                                [miller (3 4 5)]
                                [smith (1 2 3 4 5)]))


      (define (solve-it floors)
        (define (valid? lst)
          (define (distinct? lst)
            (cond
             ((null? lst) #t)
             ((null? (cdr lst)) #t)
             (else
              (and (not (member (car lst) (cdr lst)))
                   (distinct? (cdr lst))))))
          (and (distinct? (map cdr lst))
               (> (assoc-ref lst 'miller)
                  (assoc-ref lst 'cooper))
               ;; check that smith and fletcher are not adjacent
               (not (= 1 (abs (- (assoc-ref lst 'smith)
                                 (assoc-ref lst 'fletcher)))))
               (not (= 1 (abs (- (assoc-ref lst 'cooper)
                                 (assoc-ref lst 'fletcher)))))))

        (define (recursive-level lst acc)
          (if (null? lst) (if (valid? acc) (display acc))
              (let* ((top (car lst))
                     (name (car top))
                     (pfloors (cadr top)))
                (map
                 (λ (elt)
                   (recursive-level (cdr lst)
                                    (cons (cons name elt) acc)))
                 pfloors))))

        (recursive-level floors '()))

    #+end_src
** Exercise 4.42
   #+begin_quote
   Solve the following "Liars" puzzle (from Phillips 1934):

   Five schoolgirls sat for an examination.  Their parents--so they
   thought--showed an undue degree of interest in the result.  They
   therefore agreed that, in writing home about the examination, each
   girl should make one true statement and one untrue one.  The
   following are the relevant passages from their letters:

* Betty: "Kitty was second in the examination.  I was only
  third."

* Ethel: "You'll be glad to hear that I was on top.  Joan was
  second."

* Joan: "I was third, and poor old Ethel was bottom."

* Kitty: "I came out second.  Mary was only fourth."

* Mary: "I was fourth.  Top place was taken by Betty."


  What in fact was the order in which the five girls were placed? 
  #+end_quote
