_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org43347e3" class="outline-3">
<h3 id="org43347e3">TODO: Exercise 4.40</h3>
<div class="outline-text-3" id="text-org43347e3">
<div class="question" id="org5944fc7">
<p>
In the multiple dwelling problem, how many sets of assignments are there of
people to floors, both before and after the requirement that floor assignments
be distinct? It is very inefficient to generate all possible assignments of
people to floors and then leave it to backtracking to eliminate them. For
example, most of the restrictions depend on only one or two of the person-floor
variables, and can thus be imposed before floors have been selected for all the
people. Write and demonstrate a much more efficient nondeterministic procedure
that solves this problem based upon generating only those possibilities that are
not already ruled out by previous restrictions. (Hint: This will require a nest
of `let&rsquo; expressions.) 
</p>

</div>
</div>
<div id="outline-container-org9beac85" class="outline-4">
<h4 id="org9beac85">Answer</h4>
<div class="outline-text-4" id="text-org9beac85">
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org87ea358" class="outline-3">
<h3 id="org87ea358">Exercise 4.41</h3>
<div class="outline-text-3" id="text-org87ea358">
<div class="question" id="orgbbc20f7">
<p>
Write an ordinary Scheme program to solve the multiple dwelling puzzle. 
</p>

</div>
</div>
<div id="outline-container-org21a828d" class="outline-4">
<h4 id="org21a828d">Answer</h4>
<div class="outline-text-4" id="text-org21a828d">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">possible-floors</span> '<span style="color: #b58900;">(</span><span style="color: #268bd2;">[</span>baker <span style="color: #6c71c4;">(</span><span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
                          <span style="color: #268bd2;">[</span>cooper <span style="color: #6c71c4;">(</span><span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
                          <span style="color: #268bd2;">[</span>fletcher <span style="color: #6c71c4;">(</span><span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
                          <span style="color: #268bd2;">[</span>miller <span style="color: #6c71c4;">(</span><span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span>
                          <span style="color: #268bd2;">[</span>smith <span style="color: #6c71c4;">(</span><span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">]</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>


<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">solve-it</span> floors<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">valid?</span> lst<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">distinct?</span> lst<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">cond</span>
       <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>null? lst<span style="color: #b58900;">)</span> #t<span style="color: #859900;">)</span>
       <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>null? <span style="color: #268bd2;">(</span>cdr lst<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span> #t<span style="color: #859900;">)</span>
       <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">else</span>
        <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #268bd2;">(</span>not <span style="color: #6c71c4;">(</span>member <span style="color: #859900;">(</span>car lst<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>cdr lst<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
             <span style="color: #268bd2;">(</span>distinct? <span style="color: #6c71c4;">(</span>cdr lst<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #6c71c4;">(</span>distinct? <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">map</span> cdr lst<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>&gt; <span style="color: #859900;">(</span>assoc-ref lst 'miller<span style="color: #859900;">)</span>
            <span style="color: #859900;">(</span>assoc-ref lst 'cooper<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">check that smith and fletcher are not adjacent</span>
         <span style="color: #6c71c4;">(</span>not <span style="color: #859900;">(</span>= <span style="color: #6c71c4;">1</span> <span style="color: #b58900;">(</span>abs <span style="color: #268bd2;">(</span>- <span style="color: #6c71c4;">(</span>assoc-ref lst 'smith<span style="color: #6c71c4;">)</span>
                           <span style="color: #6c71c4;">(</span>assoc-ref lst 'fletcher<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>not <span style="color: #859900;">(</span>= <span style="color: #6c71c4;">1</span> <span style="color: #b58900;">(</span>abs <span style="color: #268bd2;">(</span>- <span style="color: #6c71c4;">(</span>assoc-ref lst 'cooper<span style="color: #6c71c4;">)</span>
                           <span style="color: #6c71c4;">(</span>assoc-ref lst 'fletcher<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">recursive-level</span> lst acc<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>null? lst<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>valid? acc<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>display acc<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>top <span style="color: #268bd2;">(</span>car lst<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
               <span style="color: #b58900;">(</span>name <span style="color: #268bd2;">(</span>car top<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
               <span style="color: #b58900;">(</span>pfloors <span style="color: #268bd2;">(</span>cadr top<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">map</span>
           <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #268bd2;">(</span>elt<span style="color: #268bd2;">)</span>
             <span style="color: #268bd2;">(</span>recursive-level <span style="color: #6c71c4;">(</span>cdr lst<span style="color: #6c71c4;">)</span>
                              <span style="color: #6c71c4;">(</span>cons <span style="color: #859900;">(</span>cons name elt<span style="color: #859900;">)</span> acc<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
           pfloors<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>

  <span style="color: #b58900;">(</span>recursive-level floors '<span style="color: #268bd2;">()</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org7ac17ad" class="outline-3">
<h3 id="org7ac17ad">Exercise 4.42</h3>
<div class="outline-text-3" id="text-org7ac17ad">
<div class="question" id="org3f8f51b">
<p>
Solve the following &ldquo;Liars&rdquo; puzzle (from Phillips 1934):
</p>

<p>
Five schoolgirls sat for an examination.  Their parents&#x2013;so they
thought&#x2013;showed an undue degree of interest in the result.  They
therefore agreed that, in writing home about the examination, each
girl should make one true statement and one untrue one.  The
following are the relevant passages from their letters:
</p>

<ul class="org-ul">
<li>Betty: &ldquo;Kitty was second in the examination.  I was only
third.&rdquo;</li>

<li>Ethel: &ldquo;You&rsquo;ll be glad to hear that I was on top.  Joan was
second.&rdquo;</li>

<li>Joan: &ldquo;I was third, and poor old Ethel was bottom.&rdquo;</li>

<li>Kitty: &ldquo;I came out second.  Mary was only fourth.&rdquo;</li>

<li>Mary: &ldquo;I was fourth.  Top place was taken by Betty.&rdquo;</li>
</ul>

<p>
What in fact was the order in which the five girls were placed? 
</p>

</div>
</div>
