org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme
      (append! primitive-procedures `((and ,(λ (a b) (and a b)))))

      ;;(append! primitive-procedures `((or ,(λ (a b) (or a b)))))
      (define (amb/eval-or expr)
        "Both `or' and `and' can be implemented as primitive procedures without
      significant issue, `amb/eval-or' exists to advance my knowledge of the
      evaluator"
        (let ([disjunction (amb/analyze (disjunct expr))]
              [rest-disjunctions (rest-disjunctions expr)])
          (λ (env succeed fail)
            (disjunction
             env
             (λ (value fail2)
               (if (true? value) (succeed value fail2)
                   (if (null? rest-disjunctions) (succeed #f fail2)
                       ((amb/eval-or (cons 'or rest-disjunctions)) env succeed fail))))
             fail))))
      (amb/install-procedure `(or ,amb/eval-or))

      (amb/infuse
       '(define (xor a b)
          (and (or a b)
               (not (and a b)))))

      (amb/infuse
       '(define (require-or p1 p2)
          (require (xor p1 p2))))

      (amb/infuse
       '(define (solve-liars)
          (define betty (amb 1 2 3 4 5))
          (define ethel (amb 1 2 3 4 5))
          (define joan  (amb 1 2 3 4 5))
          (define kitty (amb 1 2 3 4 5))
          (define mary  (amb 1 2 3 4 5))

          (require
           (distinct? (list betty ethel joan kitty mary)))

          ;; betty
          (require-or (= kitty 2) (= betty 3))
          ;; ethel
          (require-or (= ethel 1) (= joan 2))
          ;; joan
          (require-or (= joan 3) (= ethel 5))
          ;; kitty
          (require-or (= kitty 2) (= mary 4))
          ;; mary
          (require-or (= mary 4) (= 1 betty))
          (list
           (list 'betty betty)
           (list 'ethel ethel)
           (list 'joan joan)
           (list 'kitty kitty)
           (list 'mary mary))))

    #+end_src
** Exercise 4.43
   #+begin_quote
   Use the `amb' evaluator to solve the following puzzle

   Mary Ann Moore's father has a yacht and so has each of his four friends: Colonel
   Downing, Mr. Hall, Sir Barnacle Hood, and Dr. Parker. Each of the five also has
   one daughter and each has named his yacht after a daughter of one of the others.
   Sir Barnacle's yacht is the Gabrielle, Mr. Moore owns the Lorna; Mr. Hall the
   Rosalind. The Melissa, owned by Colonel Downing, is named after Sir Barnacle's
   daughter. Gabrielle's father owns the yacht that is named after Dr. Parker's
   daughter. Who is Lorna's father?

   Try to write the program so that it runs efficiently. Also determine how many
   solutions there are if we are not told that Mary Ann's last name is Moore. 
   #+end_quote
