_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org290f1f2" class="outline-4">
<h4 id="org290f1f2">Answer</h4>
<div class="outline-text-4" id="text-org290f1f2">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span>append! primitive-procedures `<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">and</span> ,<span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #859900;">(</span>a b<span style="color: #859900;">)</span> <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">and</span> a b<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;;</span><span style="color: #93a1a1;">(append! primitive-procedures `((or ,(&#955; (a b) (or a b)))))</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">amb/eval-or</span> expr<span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">"Both `or' and `and' can be implemented as primitive procedures without</span>
<span style="color: #2aa198;">significant issue, `amb/eval-or' exists to advance my knowledge of the</span>
<span style="color: #2aa198;">evaluator"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>disjunction <span style="color: #859900;">(</span>amb/analyze <span style="color: #b58900;">(</span>disjunct expr<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
        <span style="color: #6c71c4;">[</span>rest-disjunctions <span style="color: #859900;">(</span>rest-disjunctions expr<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>env succeed fail<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span>disjunction
       env
       <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #b58900;">(</span>value fail2<span style="color: #b58900;">)</span>
         <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>true? value<span style="color: #268bd2;">)</span> <span style="color: #268bd2;">(</span>succeed value fail2<span style="color: #268bd2;">)</span>
             <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #6c71c4;">(</span>null? rest-disjunctions<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>succeed #f fail2<span style="color: #6c71c4;">)</span>
                 <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>amb/eval-or <span style="color: #2aa198;">(</span>cons 'or rest-disjunctions<span style="color: #2aa198;">)</span><span style="color: #859900;">)</span> env succeed fail<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
       fail<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>amb/install-procedure `<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">or</span> ,amb/eval-or<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>amb/infuse
 '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">xor</span> a b<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">or</span> a b<span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>not <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">and</span> a b<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>amb/infuse
 '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">require-or</span> p1 p2<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>require <span style="color: #6c71c4;">(</span>xor p1 p2<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>amb/infuse
 '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">solve-liars</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">betty</span> <span style="color: #6c71c4;">(</span>amb <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">ethel</span> <span style="color: #6c71c4;">(</span>amb <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">joan</span>  <span style="color: #6c71c4;">(</span>amb <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">kitty</span> <span style="color: #6c71c4;">(</span>amb <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">mary</span>  <span style="color: #6c71c4;">(</span>amb <span style="color: #6c71c4;">1</span> <span style="color: #6c71c4;">2</span> <span style="color: #6c71c4;">3</span> <span style="color: #6c71c4;">4</span> <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>

    <span style="color: #268bd2;">(</span>require
     <span style="color: #6c71c4;">(</span>distinct? <span style="color: #859900;">(</span>list betty ethel joan kitty mary<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>

    <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">betty</span>
    <span style="color: #268bd2;">(</span>require-or <span style="color: #6c71c4;">(</span>= kitty <span style="color: #6c71c4;">2</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>= betty <span style="color: #6c71c4;">3</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">ethel</span>
    <span style="color: #268bd2;">(</span>require-or <span style="color: #6c71c4;">(</span>= ethel <span style="color: #6c71c4;">1</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>= joan <span style="color: #6c71c4;">2</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">joan</span>
    <span style="color: #268bd2;">(</span>require-or <span style="color: #6c71c4;">(</span>= joan <span style="color: #6c71c4;">3</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>= ethel <span style="color: #6c71c4;">5</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">kitty</span>
    <span style="color: #268bd2;">(</span>require-or <span style="color: #6c71c4;">(</span>= kitty <span style="color: #6c71c4;">2</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>= mary <span style="color: #6c71c4;">4</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">mary</span>
    <span style="color: #268bd2;">(</span>require-or <span style="color: #6c71c4;">(</span>= mary <span style="color: #6c71c4;">4</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>= <span style="color: #6c71c4;">1</span> betty<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>list
     <span style="color: #6c71c4;">(</span>list 'betty betty<span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span>list 'ethel ethel<span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span>list 'joan joan<span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span>list 'kitty kitty<span style="color: #6c71c4;">)</span>
     <span style="color: #6c71c4;">(</span>list 'mary mary<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org67b7986" class="outline-3">
<h3 id="org67b7986">Exercise 4.43</h3>
<div class="outline-text-3" id="text-org67b7986">
<div class="question" id="orgd7088b2">
<p>
Use the `amb&rsquo; evaluator to solve the following puzzle
</p>

<p>
Mary Ann Moore&rsquo;s father has a yacht and so has each of his four friends: Colonel
Downing, Mr. Hall, Sir Barnacle Hood, and Dr. Parker. Each of the five also has
one daughter and each has named his yacht after a daughter of one of the others.
Sir Barnacle&rsquo;s yacht is the Gabrielle, Mr. Moore owns the Lorna; Mr. Hall the
Rosalind. The Melissa, owned by Colonel Downing, is named after Sir Barnacle&rsquo;s
daughter. Gabrielle&rsquo;s father owns the yacht that is named after Dr. Parker&rsquo;s
daughter. Who is Lorna&rsquo;s father?
</p>

<p>
Try to write the program so that it runs efficiently. Also determine how many
solutions there are if we are not told that Mary Ann&rsquo;s last name is Moore. 
</p>

</div>
</div>
