org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme


      #| ╔═════════════╦════════════╗
      ║ Individual  ║ Yacht      ║
      ╠═════════════╬════════════╣
      ║ Downing     ║ Melissa    ║
      ╠═════════════╬════════════╣
      ║ Hall        ║ Rosalind   ║
      ╠═════════════╬════════════╣
      ║ Moore       ║ Lorna      ║
      ╠═════════════╬════════════╣
      ║ Hood        ║ Gabrielle  ║
      ╚═════════════╩════════════╝
      Gabrielle's father owns the yacht that is named after Dr. Parker's daughter
      ╔════════════════════════╦═══════════════════════════╗
      ║ Parker's Daughter      ║ Gabrielle's Father's Ship ║
      ╚════════════════════════╩═══════════════════════════╝
      The Melissa, owned by Colonel Downing, is named after Sir Barnacle's daughter.
      ╔═════════════╦═══════════════════════════╗
      ║ Barnacle    ║ (Daughter: Melissa)       ║
      ╚═════════════╩═══════════════════════════╝
      |#

      ;; i have ripped this answer (with great shame).
      (append! primitive-procedures `((eq? ,eq?)))
      (append! primitive-procedures `((cadr ,cadr)))
      (append! primitive-procedures `((caddr ,caddr)))
      (amb/infuse
       '(define (sailors)
          (define father car)
          (define daughter cadr)
          (define yacht caddr)
          (define (different-names father)
            (not (eq? (daughter father)
                      (yacht father))))

          (let ((moore   (list 'moore
                               'mary-ann
                               'lorna))
                (hood    (list 'hood
                               'melissa
                               'gabrielle))
                (hall    (list 'hall
                               (amb 'gabrielle 'lorna)
                               'rosalind))
                (downing (list 'downing
                               (amb 'gabrielle 'lorna 'rosalind)
                               'melissa))
                (parker (list 'parker
                              (amb 'gabrielle 'lorna 'rosalind)
                              'mary-anne)))

            (let ((gabrielle-father (amb hall downing parker))
                  (lorna-father     (amb hall downing parker)))
              (require (eq? (daughter gabrielle-father) 'gabrielle))
              (require (eq? (daughter lorna-father) 'lorna))
              (require (different-names lorna-father))
              (require (different-names gabrielle-father))
              (require (eq? (daughter parker)
                            (yacht gabrielle-father)))
              lorna-father))))
    #+end_src
** TODO: Exercise 4.44
   #+begin_quote
   Exercise 2.42 described the “eight-queens puzzle” of placing queens on a
   chessboard so that no two attack each other. Write a nondeterministic program to
   solve this puzzle. 
   #+end_quote
