_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org561c2b0" class="outline-4">
<h4 id="org561c2b0">Answer</h4>
<div class="outline-text-4" id="text-org561c2b0">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #93a1a1;">#| </span>
<span style="color: #93a1a1;">&#9556;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9574;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9559;</span>
<span style="color: #93a1a1;">&#9553; Individual  &#9553; Yacht      &#9553;</span>
<span style="color: #93a1a1;">&#9568;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9580;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9571;</span>
<span style="color: #93a1a1;">&#9553; Downing     &#9553; Melissa    &#9553;</span>
<span style="color: #93a1a1;">&#9568;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9580;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9571;</span>
<span style="color: #93a1a1;">&#9553; Hall        &#9553; Rosalind   &#9553;</span>
<span style="color: #93a1a1;">&#9568;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9580;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9571;</span>
<span style="color: #93a1a1;">&#9553; Moore       &#9553; Lorna      &#9553;</span>
<span style="color: #93a1a1;">&#9568;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9580;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9571;</span>
<span style="color: #93a1a1;">&#9553; Hood        &#9553; Gabrielle  &#9553;</span>
<span style="color: #93a1a1;">&#9562;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9577;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9565;</span>
<span style="color: #93a1a1;">Gabrielle's father owns the yacht that is named after Dr. Parker's daughter</span>
<span style="color: #93a1a1;">&#9556;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9574;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9559;</span>
<span style="color: #93a1a1;">&#9553; Parker's Daughter      &#9553; Gabrielle's Father's Ship &#9553;</span>
<span style="color: #93a1a1;">&#9562;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9577;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9565;</span>
<span style="color: #93a1a1;">The Melissa, owned by Colonel Downing, is named after Sir Barnacle's daughter.</span>
<span style="color: #93a1a1;">&#9556;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9574;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9559;</span>
<span style="color: #93a1a1;">&#9553; Barnacle    &#9553; (Daughter: Melissa)       &#9553;</span>
<span style="color: #93a1a1;">&#9562;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9577;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9552;&#9565;</span>
<span style="color: #93a1a1;">|#</span>

<span style="color: #2aa198;">(</span>append! primitive-procedures `<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>eq? ,eq?<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>append! primitive-procedures `<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>cadr ,cadr<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>append! primitive-procedures `<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>caddr ,caddr<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>amb/infuse
 '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">sailors</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">father</span> car<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">daughter</span> cadr<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">yacht</span> caddr<span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">different-names</span> father<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span>not <span style="color: #859900;">(</span>eq? <span style="color: #b58900;">(</span>daughter father<span style="color: #b58900;">)</span>
                <span style="color: #b58900;">(</span>yacht father<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>

    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>moore   <span style="color: #b58900;">(</span>list 'moore
                         'mary-ann
                         'lorna<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>hood    <span style="color: #b58900;">(</span>list 'hood
                         'melissa
                         'gabrielle<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>hall    <span style="color: #b58900;">(</span>list 'hall
                         <span style="color: #268bd2;">(</span>amb 'gabrielle 'lorna<span style="color: #268bd2;">)</span>
                         'rosalind<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>downing <span style="color: #b58900;">(</span>list 'downing
                         <span style="color: #268bd2;">(</span>amb 'gabrielle 'lorna 'rosalind<span style="color: #268bd2;">)</span>
                         'melissa<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>parker <span style="color: #b58900;">(</span>list 'parker
                        <span style="color: #268bd2;">(</span>amb 'gabrielle 'lorna 'rosalind<span style="color: #268bd2;">)</span>
                        'mary-anne<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>

      <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #859900;">(</span><span style="color: #b58900;">(</span>gabrielle-father <span style="color: #268bd2;">(</span>amb hall downing parker<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span>
            <span style="color: #b58900;">(</span>lorna-father     <span style="color: #268bd2;">(</span>amb hall downing parker<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>require <span style="color: #b58900;">(</span>eq? <span style="color: #268bd2;">(</span>daughter gabrielle-father<span style="color: #268bd2;">)</span> 'gabrielle<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>require <span style="color: #b58900;">(</span>eq? <span style="color: #268bd2;">(</span>daughter lorna-father<span style="color: #268bd2;">)</span> 'lorna<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>require <span style="color: #b58900;">(</span>different-names lorna-father<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>require <span style="color: #b58900;">(</span>different-names gabrielle-father<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
        <span style="color: #859900;">(</span>require <span style="color: #b58900;">(</span>eq? <span style="color: #268bd2;">(</span>daughter parker<span style="color: #268bd2;">)</span>
                      <span style="color: #268bd2;">(</span>yacht gabrielle-father<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
        lorna-father<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org874f41f" class="outline-3">
<h3 id="org874f41f">TODO: Exercise 4.44</h3>
<div class="outline-text-3" id="text-org874f41f">
<div class="question" id="orgec9ca88">
<p>
Exercise 2.42 described the “eight-queens puzzle” of placing queens on a
chessboard so that no two attack each other. Write a nondeterministic program to
solve this puzzle. 
</p>

</div>
</div>
