org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme

    #+end_src
    #| Parsing Natural Language Utils|#

    #| Programs designed to accept natural language as input usually start by
    attempting to "parse" the input, that is, to match the input against some
    grammatical structure. For example, we might try to recognize simple sentences
    consisting of an article followed by a noun followed by a verb, such as "The cat
    eats." To accomplish such an analysis, we must be able to identify the parts of
    speech of individual words. We could start with some lists that classify various
    words: |#
    (append! primitive-procedures `((set! ,(λ (x y) (set! x y)))))
    (append! primitive-procedures `((memq ,memq)))
    (map amb/infuse
    '((define nouns '(noun student professor cat class))
    (define verbs '(verb studies lectures eats sleeps))
    (define articles '(article the a))
    (define prepositions '(prep for to in by with))
    (define *unparsed* '())
    (define (parse-sentence)
    (list 'sentence
    (parse-noun-phrase)
    (parse-verb-phrase)))
    (define (parse-word word-list)
    (require (not (null? *unparsed*)))
    (require (memq (car *unparsed*) (cdr word-list)))
    (let ((found-word (car *unparsed*)))
    (set! *unparsed* (cdr *unparsed*))
    (list (car word-list) found-word)))
    (define (parse input)
    (set! *unparsed* input)
    (let ((sent (parse-sentence)))
    (require (null? *unparsed*))
    sent))
    (define (parse-prepositional-phrase)
    (list 'prep-phrase
    (parse-word prepositions)
    (parse-noun-phrase)))
    (define (parse-verb-phrase)
    (define (maybe-extend verb-phrase)
    (amb verb-phrase
    (maybe-extend (list 'verb-phrase
    verb-phrase
    (parse-prepositional-phrase)))))
    (maybe-extend (parse-word verbs)))
    (define (parse-simple-noun-phrase)
    (list 'simple-noun-phrase
    (parse-word articles)
    (parse-word nouns)))
    (define (parse-noun-phrase)
    (define (maybe-extend noun-phrase)
    (amb noun-phrase
    (maybe-extend (list 'noun-phrase
    noun-phrase
    (parse-prepositional-phrase)))))
    (maybe-extend (parse-simple-noun-phrase)))))

    #+end_src
** Exercise 4.45
   #+begin_quote
   With the grammar given above, the following sentence can be parsed in five
   different ways: "the professor lectures to the student in the class with the
   cat." Give the five parses and explain the differences in shades of meaning
   among them. 
   #+end_quote
*** Answer
    #+begin_src scheme

      #|
      (parse '(the professor lectures to the student in the class with the cat)) ~>

      (sentence
      (simple-noun-phrase (article the) (noun professor))
      (verb-phrase
      (verb-phrase
      (verb-phrase
      (verb lectures)
      (prep-phrase
      (prep to)
      (simple-noun-phrase (article the) (noun student))))
      (prep-phrase (prep in) (simple-noun-phrase (article the) (noun class))))
      (prep-phrase (prep with) (simple-noun-phrase (article the) (noun cat)))))


      (sentence
      (simple-noun-phrase (article the) (noun professor))
      (verb-phrase
      (verb-phrase
      (verb lectures)
      (prep-phrase (prep to) (simple-noun-phrase (article the) (noun student))))
      (prep-phrase
      (prep in)
      (noun-phrase
      (simple-noun-phrase (article the) (noun class))
      (prep-phrase
      (prep with)
      (simple-noun-phrase (article the) (noun cat)))))))

      (sentence
      (simple-noun-phrase (article the) (noun professor))
      (verb-phrase
      (verb-phrase
      (verb lectures)
      (prep-phrase
      (prep to)
      (noun-phrase
      (simple-noun-phrase (article the) (noun student))
      (prep-phrase
      (prep in)
      (simple-noun-phrase (article the) (noun class))))))
      (prep-phrase (prep with) (simple-noun-phrase (article the) (noun cat)))))

      (sentence
      (simple-noun-phrase (article the) (noun professor))
      (verb-phrase
      (verb lectures)
      (prep-phrase
      (prep to)
      (noun-phrase
      (noun-phrase
      (simple-noun-phrase (article the) (noun student))
      (prep-phrase (prep in) (simple-noun-phrase (article the) (noun class))))
      (prep-phrase
      (prep with)
      (simple-noun-phrase (article the) (noun cat)))))))

      (sentence
      (simple-noun-phrase (article the) (noun professor))
      (verb-phrase
      (verb lectures)
      (prep-phrase
      (prep to)
      (noun-phrase
      (simple-noun-phrase (article the) (noun student))
      (prep-phrase
      (prep in)
      (noun-phrase
      (simple-noun-phrase (article the) (noun class))
      (prep-phrase
      (prep with)
      (simple-noun-phrase (article the) (noun cat))))))))) |#

    #+end_src
** Exercise 4.46
   #+begin_quote
   The evaluators in sections *Note and do not determine what order operands are
   evaluated in. We will see that the `amb' evaluator evaluates them from left to
   right. Explain why our parsing program wouldn't work if the operands were
   evaluated in some other order. 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| parse-word advances the *unparsed* list from left to right, because it knows
      that the parser works this way. Without being sure of the order, we couldn’t
      implement parse-word. |#

    #+end_src
** Exercise 4.49
   #+begin_quote
   Alyssa P. Hacker is more interested in generating interesting sentences than in
   parsing them. She reasons that by simply changing the procedure `parse-word' so
   that it ignores the "input sentence" and instead always succeeds and generates
   an appropriate word, we can use the programs we had built for parsing to do
   generation instead. Implement Alyssa's idea, and show the first half-dozen or so
   sentences generated. 
   #+end_quote
