_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-orga5c9954" class="outline-4">
<h4 id="orga5c9954">Answer</h4>
<div class="outline-text-4" id="text-orga5c9954">
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>

<p>
#+end<sub>src</sub>
</p>
</div>
</div>
</div>
<div id="outline-container-orgfcd2120" class="outline-3">
<h3 id="orgfcd2120">Exercise 4.45</h3>
<div class="outline-text-3" id="text-orgfcd2120">
<div class="question" id="org13da1b6">
<p>
Programs designed to accept natural language as input usually start by
  attempting to &ldquo;parse&rdquo; the input, that is, to match the input against some
  grammatical structure. For example, we might try to recognize simple sentences
  consisting of an article followed by a noun followed by a verb, such as &ldquo;The cat
  eats.&rdquo; To accomplish such an analysis, we must be able to identify the parts of
  speech of individual words. We could start with some lists that classify various
  words:
          (append! primitive-procedures `((set! ,(λ (x y) (set! x y)))))
          (append! primitive-procedures `((memq ,memq)))
          (map amb/infuse
          &rsquo;((define nouns &rsquo;(noun student professor cat class))
          (define verbs &rsquo;(verb studies lectures eats sleeps))
          (define articles &rsquo;(article the a))
          (define prepositions &rsquo;(prep for to in by with))
          (define <b>unparsed</b> &rsquo;())
          (define (parse-sentence)
          (list &rsquo;sentence
          (parse-noun-phrase)
          (parse-verb-phrase)))
          (define (parse-word word-list)
          (require (not (null? <b>unparsed</b>)))
          (require (memq (car <b>unparsed</b>) (cdr word-list)))
          (let ((found-word (car <b>unparsed</b>)))
          (set! <b>unparsed</b> (cdr <b>unparsed</b>))
          (list (car word-list) found-word)))
          (define (parse input)
          (set! <b>unparsed</b> input)
          (let ((sent (parse-sentence)))
          (require (null? <b>unparsed</b>))
          sent))
          (define (parse-prepositional-phrase)
          (list &rsquo;prep-phrase
          (parse-word prepositions)
          (parse-noun-phrase)))
          (define (parse-verb-phrase)
          (define (maybe-extend verb-phrase)
          (amb verb-phrase
          (maybe-extend (list &rsquo;verb-phrase
          verb-phrase
          (parse-prepositional-phrase)))))
          (maybe-extend (parse-word verbs)))
          (define (parse-simple-noun-phrase)
          (list &rsquo;simple-noun-phrase
          (parse-word articles)
          (parse-word nouns)))
          (define (parse-noun-phrase)
          (define (maybe-extend noun-phrase)
          (amb noun-phrase
          (maybe-extend (list &rsquo;noun-phrase
          noun-phrase
          (parse-prepositional-phrase)))))
          (maybe-extend (parse-simple-noun-phrase)))))
 With the grammar given above, the following sentence can be parsed in five
 different ways: &ldquo;the professor lectures to the student in the class with the
 cat.&rdquo; Give the five parses and explain the differences in shades of meaning
 among them. 
</p>

</div>
</div>
<div id="outline-container-orga8263b2" class="outline-4">
<h4 id="orga8263b2">Answer</h4>
<div class="outline-text-4" id="text-orga8263b2">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#|</span>
<span style="color: #93a1a1;">(parse '(the professor lectures to the student in the class with the cat)) ~&gt;</span>

<span style="color: #93a1a1;">(sentence</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun professor))</span>
<span style="color: #93a1a1;">(verb-phrase</span>
<span style="color: #93a1a1;">(verb-phrase</span>
<span style="color: #93a1a1;">(verb-phrase</span>
<span style="color: #93a1a1;">(verb lectures)</span>
<span style="color: #93a1a1;">(prep-phrase</span>
<span style="color: #93a1a1;">(prep to)</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun student))))</span>
<span style="color: #93a1a1;">(prep-phrase (prep in) (simple-noun-phrase (article the) (noun class))))</span>
<span style="color: #93a1a1;">(prep-phrase (prep with) (simple-noun-phrase (article the) (noun cat)))))</span>


<span style="color: #93a1a1;">(sentence</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun professor))</span>
<span style="color: #93a1a1;">(verb-phrase</span>
<span style="color: #93a1a1;">(verb-phrase</span>
<span style="color: #93a1a1;">(verb lectures)</span>
<span style="color: #93a1a1;">(prep-phrase (prep to) (simple-noun-phrase (article the) (noun student))))</span>
<span style="color: #93a1a1;">(prep-phrase</span>
<span style="color: #93a1a1;">(prep in)</span>
<span style="color: #93a1a1;">(noun-phrase</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun class))</span>
<span style="color: #93a1a1;">(prep-phrase</span>
<span style="color: #93a1a1;">(prep with)</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun cat)))))))</span>

<span style="color: #93a1a1;">(sentence</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun professor))</span>
<span style="color: #93a1a1;">(verb-phrase</span>
<span style="color: #93a1a1;">(verb-phrase</span>
<span style="color: #93a1a1;">(verb lectures)</span>
<span style="color: #93a1a1;">(prep-phrase</span>
<span style="color: #93a1a1;">(prep to)</span>
<span style="color: #93a1a1;">(noun-phrase</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun student))</span>
<span style="color: #93a1a1;">(prep-phrase</span>
<span style="color: #93a1a1;">(prep in)</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun class))))))</span>
<span style="color: #93a1a1;">(prep-phrase (prep with) (simple-noun-phrase (article the) (noun cat)))))</span>

<span style="color: #93a1a1;">(sentence</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun professor))</span>
<span style="color: #93a1a1;">(verb-phrase</span>
<span style="color: #93a1a1;">(verb lectures)</span>
<span style="color: #93a1a1;">(prep-phrase</span>
<span style="color: #93a1a1;">(prep to)</span>
<span style="color: #93a1a1;">(noun-phrase</span>
<span style="color: #93a1a1;">(noun-phrase</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun student))</span>
<span style="color: #93a1a1;">(prep-phrase (prep in) (simple-noun-phrase (article the) (noun class))))</span>
<span style="color: #93a1a1;">(prep-phrase</span>
<span style="color: #93a1a1;">(prep with)</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun cat)))))))</span>

<span style="color: #93a1a1;">(sentence</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun professor))</span>
<span style="color: #93a1a1;">(verb-phrase</span>
<span style="color: #93a1a1;">(verb lectures)</span>
<span style="color: #93a1a1;">(prep-phrase</span>
<span style="color: #93a1a1;">(prep to)</span>
<span style="color: #93a1a1;">(noun-phrase</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun student))</span>
<span style="color: #93a1a1;">(prep-phrase</span>
<span style="color: #93a1a1;">(prep in)</span>
<span style="color: #93a1a1;">(noun-phrase</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun class))</span>
<span style="color: #93a1a1;">(prep-phrase</span>
<span style="color: #93a1a1;">(prep with)</span>
<span style="color: #93a1a1;">(simple-noun-phrase (article the) (noun cat))))))))) |#</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga56de0b" class="outline-3">
<h3 id="orga56de0b">Exercise 4.46</h3>
<div class="outline-text-3" id="text-orga56de0b">
<div class="question" id="orgb53c24e">
<p>
The evaluators in sections *Note and do not determine what order operands are
evaluated in. We will see that the `amb&rsquo; evaluator evaluates them from left to
right. Explain why our parsing program wouldn&rsquo;t work if the operands were
evaluated in some other order. 
</p>

</div>
</div>
<div id="outline-container-org2625976" class="outline-4">
<h4 id="org2625976">Answer</h4>
<div class="outline-text-4" id="text-org2625976">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| parse-word advances the *unparsed* list from left to right, because it knows</span>
<span style="color: #93a1a1;">that the parser works this way. Without being sure of the order, we couldn&#8217;t</span>
<span style="color: #93a1a1;">implement parse-word. |#</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgea379d8" class="outline-3">
<h3 id="orgea379d8">Exercise 4.49</h3>
<div class="outline-text-3" id="text-orgea379d8">
<div class="question" id="org2967bc7">
<p>
Alyssa P. Hacker is more interested in generating interesting sentences than in
parsing them. She reasons that by simply changing the procedure `parse-word&rsquo; so
that it ignores the &ldquo;input sentence&rdquo; and instead always succeeds and generates
an appropriate word, we can use the programs we had built for parsing to do
generation instead. Implement Alyssa&rsquo;s idea, and show the first half-dozen or so
sentences generated. 
</p>

</div>
</div>
