org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme
      (map amb/infuse
           '(
             (define (generate) (generate-sentence))
             (define (generate-sentence)
               (list 'sentence
                     (generate-noun-phrase)
                     (generate-verb-phrase)))
             (define (generate-word word-list)
               (list (car word-list) (amb word-list)))
             (define (generate-prepositional-phrase)
               (list 'prep-phrase
                     (generate-word prepositions)
                     (generate-noun-phrase)))
             (define (generate-verb-phrase)
               (define (maybe-extend verb-phrase)
                 (amb verb-phrase
                      (maybe-extend (list 'verb-phrase
                                          verb-phrase
                                          (generate-prepositional-phrase)))))
               (maybe-extend (generate-word verbs)))
             (define (generate-simple-noun-phrase)
               (list 'simple-noun-phrase
                     (generate-word articles)
                     (generate-word nouns)))
             (define (generate-noun-phrase)
               (define (maybe-extend noun-phrase)
                 (amb noun-phrase
                      (maybe-extend (list 'noun-phrase
                                          noun-phrase
                                          (generate-prepositional-phrase)))))
               (maybe-extend (generate-simple-noun-phrase)))))

    #+end_src
** Exercise 4.50
   #+begin_quote
   Implement a new special form ramb that is like amb except
   that it searches alternatives in a random order, rather than
   from left to right. Show how this can help with Alyssa’s
   problem in Exercise 4.49. 
   #+end_quote
*** Answer
    #+begin_src scheme
      (define (shuffle lst)
        "Returns a randomly re-ordered copy of `lst'"
        (if (< (length lst) 1) lst
            (let ([item (list-ref lst (random (length lst)))])
              (cons item (shuffle (delete item lst))))))

      (define (amb/analyze-ramb exp)
        (amb/analyze-amb (cons
                          (car exp)
                          (shuffle (amb/choices exp)))))

    #+end_src
** Exercise 4.51
   #+begin_quote
   Implement a new kind of assignment called permanent-set!
   that is not undone upon failure. For example, we can choose
   two distinct elements from a list and count the number of
   trials required to make a successful choice as follows:

   (define count 0)
   (let ((x (an-element-of '(a b c)))
   (y (an-element-of '(a b c))))
   (permanent-set! count (+ count 1))
   (require (not (eq? x y)))
   (list x y count))

   ;;; Starting a new problem
   ;;; Amb-Eval value:
   (a b 2)

   ;;; Amb-Eval input:
   try-again

   ;;; Amb-Eval value:
   (a c 3)

   What values would have been displayed if we had used set!
   here rather than permanent-set!? 
   #+end_quote
