_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org3b16b2a" class="outline-4">
<h4 id="org3b16b2a">Answer</h4>
<div class="outline-text-4" id="text-org3b16b2a">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">map</span> amb/infuse
     '<span style="color: #b58900;">(</span>
       <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">generate</span><span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>generate-sentence<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">generate-sentence</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>list 'sentence
               <span style="color: #859900;">(</span>generate-noun-phrase<span style="color: #859900;">)</span>
               <span style="color: #859900;">(</span>generate-verb-phrase<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">generate-word</span> word-list<span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>list <span style="color: #859900;">(</span>car word-list<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>amb word-list<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">generate-prepositional-phrase</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>list 'prep-phrase
               <span style="color: #859900;">(</span>generate-word prepositions<span style="color: #859900;">)</span>
               <span style="color: #859900;">(</span>generate-noun-phrase<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">generate-verb-phrase</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #859900;">(</span><span style="color: #268bd2;">maybe-extend</span> verb-phrase<span style="color: #859900;">)</span>
           <span style="color: #859900;">(</span>amb verb-phrase
                <span style="color: #b58900;">(</span>maybe-extend <span style="color: #268bd2;">(</span>list 'verb-phrase
                                    verb-phrase
                                    <span style="color: #6c71c4;">(</span>generate-prepositional-phrase<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>maybe-extend <span style="color: #859900;">(</span>generate-word verbs<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">generate-simple-noun-phrase</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>list 'simple-noun-phrase
               <span style="color: #859900;">(</span>generate-word articles<span style="color: #859900;">)</span>
               <span style="color: #859900;">(</span>generate-word nouns<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #6c71c4;">(</span><span style="color: #268bd2;">generate-noun-phrase</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #859900;">(</span><span style="color: #268bd2;">maybe-extend</span> noun-phrase<span style="color: #859900;">)</span>
           <span style="color: #859900;">(</span>amb noun-phrase
                <span style="color: #b58900;">(</span>maybe-extend <span style="color: #268bd2;">(</span>list 'noun-phrase
                                    noun-phrase
                                    <span style="color: #6c71c4;">(</span>generate-prepositional-phrase<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>maybe-extend <span style="color: #859900;">(</span>generate-simple-noun-phrase<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd5fd81d" class="outline-3">
<h3 id="orgd5fd81d">Exercise 4.50</h3>
<div class="outline-text-3" id="text-orgd5fd81d">
<div class="question" id="orgfbe27ae">
<p>
Implement a new special form ramb that is like amb except
that it searches alternatives in a random order, rather than
from left to right. Show how this can help with Alyssa’s
problem in Exercise 4.49. 
</p>

</div>
</div>
<div id="outline-container-org69385a7" class="outline-4">
<h4 id="org69385a7">Answer</h4>
<div class="outline-text-4" id="text-org69385a7">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">shuffle</span> lst<span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">"Returns a randomly re-ordered copy of `lst'"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>&lt; <span style="color: #6c71c4;">(</span>length lst<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">1</span><span style="color: #268bd2;">)</span> lst
      <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">[</span>item <span style="color: #b58900;">(</span>list-ref lst <span style="color: #268bd2;">(</span>random <span style="color: #6c71c4;">(</span>length lst<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">]</span><span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span>cons item <span style="color: #859900;">(</span>shuffle <span style="color: #b58900;">(</span>delete item lst<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">amb/analyze-ramb</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>amb/analyze-amb <span style="color: #268bd2;">(</span>cons
                    <span style="color: #6c71c4;">(</span>car exp<span style="color: #6c71c4;">)</span>
                    <span style="color: #6c71c4;">(</span>shuffle <span style="color: #859900;">(</span>amb/choices exp<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org35b0367" class="outline-3">
<h3 id="org35b0367">Exercise 4.51</h3>
<div class="outline-text-3" id="text-org35b0367">
<div class="question" id="org8844429">
<p>
Implement a new kind of assignment called permanent-set!
that is not undone upon failure. For example, we can choose
two distinct elements from a list and count the number of
trials required to make a successful choice as follows:
</p>

<p>
(define count 0)
(let ((x (an-element-of &rsquo;(a b c)))
(y (an-element-of &rsquo;(a b c))))
(permanent-set! count (+ count 1))
(require (not (eq? x y)))
(list x y count))
</p>

<p>
;;; Starting a new problem
;;; Amb-Eval value:
(a b 2)
</p>

<p>
;;; Amb-Eval input:
try-again
</p>

<p>
;;; Amb-Eval value:
(a c 3)
</p>

<p>
What values would have been displayed if we had used set!
here rather than permanent-set!? 
</p>

</div>
</div>
