org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme
      (append! primitive-procedures `((shuffle ,shuffle)))

      (define (amb/analyze-permanent-assignment exp)
        "The execution procedure for permanent assignment is essentially a
      redaction of the components of `analyze-assignment' that restore the value
      of the old variable proceeding from a failed assignment"
        (let ([var (definition-variable exp)]
              (vproc (amb/analyze (definition-value exp))))
          (lambda (env succeed fail)
            (vproc
             env
             (λ (val fail2)
               (set-variable-value! var val env)
               (succeed
                'ok
                ;; a failure continues without restoring the old value
                (λ () (fail2))))
             fail))))

      (amb/install-procedure `(permanent-set! ,amb/analyze-permanent-assignment))

      (amb/infuse
       '(define (cps)
          (define count 0)
          (let ((x (car (amb '(a b c))))
                (y (car (amb '(z b c)))))
            (permanent-set! count (+ count 1))
            (require (not (eq? x y)))
            (list x y count))))

    #+end_src
** Exercise 4.52
   #+begin_quote
   Implement a new construct called `if-fail' that permits the
   user to catch the failure of an expression. `if-fail' takes
   two expressions. It evaluates the first expression as usual
   and returns as usual if the evaluation succeeds. If the
   evaluation fails, however, the value of the second
   expression is returned, as in the following example:

   ;;; Amb-Eval input:
   (if-fail
   (let ((x (an-element-of '(1 3 5))))
   (require (even? x))
   x)
   'all-odd)

   ;;; Starting a new problem
   ;;; Amb-Eval value:
   all-odd

   ;;; Amb-Eval input:
   (if-fail
   (let ((x (an-element-of '(1 3 5 8))))
   (require (even? x))
   x)
   'all-odd)

   ;;; Starting a new problem
   ;;; Amb-Eval value:
   8                 
   #+end_quote
   *** Answer
   #+begin_src scheme
     (define (amb/analyze-if-fail exp)
       (let ((clause      (amb/analyze (cadr exp)))
             (alternative (caddr exp)))
         (λ (env succeed fail)
           (clause env
                   ;; success, just suplly the result
                   (λ (value fail2) (succeed value fail2))
                   ;; fail, send our alternative
                   (λ () (succeed alternative fail))))))

     (amb/install-procedure `(if-fail ,amb/analyze-if-fail))
   #+end_src
** Exercise 4.53
   #+begin_quote
   With `permanent-set!' as described in *Note4.51 and
   `if-fail' as in *Note Exercise 4.52, what will be the result
   of evaluating

   (let ((pairs '()))
   (if-fail (let ((p (prime-sum-pair '(1 3 5 8) '(20 35 110))))
   (permanent-set! pairs (cons p pairs))
   (amb))
   pairs))

   #+end_quote
*** Answer
    #+begin_src scheme

      #| Solution:
      It prints:

      ((8 35) (3 110) (3 20))

      Although the let form always fails (it calls (amb) as its
      last statement), the pairs get added into pairs, because
      permanent-set! doesn’t roll assignments back from failed
      paths. |#

    #+end_src
