_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org6ad0966" class="outline-4">
<h4 id="org6ad0966">Answer</h4>
<div class="outline-text-4" id="text-org6ad0966">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span>append! primitive-procedures `<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>shuffle ,shuffle<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">amb/analyze-permanent-assignment</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #2aa198;">"The execution procedure for permanent assignment is essentially a</span>
<span style="color: #2aa198;">redaction of the components of `analyze-assignment' that restore the value</span>
<span style="color: #2aa198;">of the old variable proceeding from a failed assignment"</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>var <span style="color: #859900;">(</span>definition-variable exp<span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span>
        <span style="color: #6c71c4;">(</span>vproc <span style="color: #859900;">(</span>amb/analyze <span style="color: #b58900;">(</span>definition-value exp<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #6c71c4;">(</span>env succeed fail<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span>vproc
       env
       <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #b58900;">(</span>val fail2<span style="color: #b58900;">)</span>
         <span style="color: #b58900;">(</span>set-variable-value! var val env<span style="color: #b58900;">)</span>
         <span style="color: #b58900;">(</span>succeed
          'ok
          <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">a failure continues without restoring the old value</span>
          <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">()</span> <span style="color: #6c71c4;">(</span>fail2<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
       fail<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>amb/install-procedure `<span style="color: #b58900;">(</span>permanent-set! ,amb/analyze-permanent-assignment<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>amb/infuse
 '<span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">(</span><span style="color: #268bd2;">cps</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">count</span> <span style="color: #6c71c4;">0</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">(</span>x <span style="color: #b58900;">(</span>car <span style="color: #268bd2;">(</span>amb '<span style="color: #6c71c4;">(</span>a b c<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>y <span style="color: #b58900;">(</span>car <span style="color: #268bd2;">(</span>amb '<span style="color: #6c71c4;">(</span>z b c<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span>permanent-set! count <span style="color: #859900;">(</span>+ count <span style="color: #6c71c4;">1</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span>require <span style="color: #859900;">(</span>not <span style="color: #b58900;">(</span>eq? x y<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span>list x y count<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgff1c4d4" class="outline-3">
<h3 id="orgff1c4d4">Exercise 4.52</h3>
<div class="outline-text-3" id="text-orgff1c4d4">
<div class="question" id="org3298cad">
<p>
Implement a new construct called `if-fail&rsquo; that permits the
user to catch the failure of an expression. `if-fail&rsquo; takes
two expressions. It evaluates the first expression as usual
and returns as usual if the evaluation succeeds. If the
evaluation fails, however, the value of the second
expression is returned, as in the following example:
</p>

<p>
;;; Amb-Eval input:
(if-fail
(let ((x (an-element-of &rsquo;(1 3 5))))
(require (even? x))
x)
&rsquo;all-odd)
</p>

<p>
;;; Starting a new problem
;;; Amb-Eval value:
all-odd
</p>

<p>
;;; Amb-Eval input:
(if-fail
(let ((x (an-element-of &rsquo;(1 3 5 8))))
(require (even? x))
x)
&rsquo;all-odd)
</p>

<p>
;;; Starting a new problem
;;; Amb-Eval value:
8                 
</p>

</div>
<p>
<b>*</b> Answer
</p>
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">amb/analyze-if-fail</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>clause      <span style="color: #859900;">(</span>amb/analyze <span style="color: #b58900;">(</span>cadr exp<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span>alternative <span style="color: #859900;">(</span>caddr exp<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>env succeed fail<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span>clause env
              <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">success, just suplly the result</span>
              <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #b58900;">(</span>value fail2<span style="color: #b58900;">)</span> <span style="color: #b58900;">(</span>succeed value fail2<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
              <span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">fail, send our alternative</span>
              <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #b58900;">()</span> <span style="color: #b58900;">(</span>succeed alternative fail<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>amb/install-procedure `<span style="color: #b58900;">(</span>if-fail ,amb/analyze-if-fail<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org42b77db" class="outline-3">
<h3 id="org42b77db">Exercise 4.53</h3>
<div class="outline-text-3" id="text-org42b77db">
<div class="question" id="org2c9cafe">
<p>
With `permanent-set!&rsquo; as described in *Note4.51 and
`if-fail&rsquo; as in *Note Exercise 4.52, what will be the result
of evaluating
</p>

<p>
(let ((pairs &rsquo;()))
(if-fail (let ((p (prime-sum-pair &rsquo;(1 3 5 8) &rsquo;(20 35 110))))
(permanent-set! pairs (cons p pairs))
(amb))
pairs))
</p>

</div>
</div>
<div id="outline-container-org37bd068" class="outline-4">
<h4 id="org37bd068">Answer</h4>
<div class="outline-text-4" id="text-org37bd068">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solution:</span>
<span style="color: #93a1a1;">It prints:</span>

<span style="color: #93a1a1;">((8 35) (3 110) (3 20))</span>

<span style="color: #93a1a1;">Although the let form always fails (it calls (amb) as its</span>
<span style="color: #93a1a1;">last statement), the pairs get added into pairs, because</span>
<span style="color: #93a1a1;">permanent-set! doesn&#8217;t roll assignments back from failed</span>
<span style="color: #93a1a1;">paths. |#</span>

</pre>
</div>
</div>
</div>
</div>
