org/_posts/2019-06-23-sicp-chapter-4.org
** Exercise 4.54
   #+begin_quote

If we had not realized that require could be implemented as an ordinary
procedure that uses `amb', to be defined by the user as part of a
nondeterministic program, we would have had to implement it as a special
form. This would require syntax procedures

(define (require? exp)
(tagged-list? exp 'require))

(define (require-predicate exp)
(cadr exp))

and a new clause in the dispatch in analyze

((require? exp) (analyze-require exp))

as well the procedure analyze-require that handles require expressions.
Complete the following definition of analyze-require.

(define (analyze-require exp)
(let ((pproc (analyze
(require-predicate exp))))
(lambda (env succeed fail)
(pproc env
(lambda (pred-value fail2)
(if ⟨??⟩
⟨??⟩
(succeed 'ok fail2)))
fail)))) 
   #+end_quote
   *** Answer
   #+begin_src scheme
     (define (require-predicate exp)
       (cadr exp))
     (define (amb/analyze-require exp)
       (let ([pproc (analyze (require-predicate exp))])
         (λ (env succeed fail)
           (pproc
            env
            (λ (value fail2)
              (if (not (true? value))
                  (fail)
                  (succeed 'ok fail2))))
           fail)))
   #+end_src
   #| 4.4 Logic Programming |#

   ;; Install our logical evaluator
   (include "/home/zv/z/practice/sicp/evaluator/query-evaluator.scm")
   (define (query/initialize-with rules-and-assertions)
   (define (deal-out r-and-a rules assertions)
   (cond [(null? r-and-a)
   (set! THE-ASSERTIONS (list->stream assertions))
   (set! THE-RULES (list->stream rules))
   'done]
   [else
   (let ((s (query-syntax-process (car r-and-a))))
   (cond ((rule? s)
   (store-rule-in-index s)
   (deal-out (cdr r-and-a)
   (cons s rules)
   assertions))
   (else
   (store-assertion-in-index s)
   (deal-out (cdr r-and-a)
   rules
   (cons s assertions)))))]))
   (deal-out rules-and-assertions '() '()))

   (define (query/infuse expr)
   (let ((s (query-syntax-process expr)))
   (cond [(rule? s)
   (store-rule-in-index s)
   (set! THE-RULES (stream-cons s THE-RULES))]
   [else
   (store-assertion-in-index s)
   (set! THE-ASSERTIONS
   (stream-cons s THE-ASSERTIONS))])))

   (define (query/eval expr)
   "A wrapper around the details of the 'real' evaluator so we can directly
   grab results"
   (let ((q (query-syntax-process expr)))
   (stream->list
   (stream-map
   (lambda (frame)
   (instantiate
   q
   frame
   (λ (v f) (contract-question-mark v))))
   (qeval q (singleton-stream '()))))))

   ;; Include & initialize our query database with microshaft employees
   (include "/home/zv/z/practice/sicp/vendor/microshaft.scm")
   (query/initialize-with microshaft-data-base)

   ;; Fulfill an infinite loop (married Mickey ?who)
   (query/infuse '(married Minnie Mickey))
   (query/infuse '(rule (married ?x ?y) (married ?y ?x)))

   (map query/infuse
   '((rule (append-to-form () ?y ?y))
   (rule (append-to-form (?u . ?v) ?y (?u . ?z))
   (append-to-form ?v ?y ?z))))

   ;; And install our driver for the query loop

   (install-driver-loop 'qeval query-driver-loop)
   #+end_src
** Exercise 4.55
   #+begin_quote
   Give simple queries that retrieve the following information from the data
   base:

   - all people supervised by Ben Bitdiddle;
   - the names and jobs of all people in the accounting division;
   - the names and addresses of all people who live in Slumerville. 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| Solution:
      Respectively:

      - (supervisor ?x (Bitdiddle Ben))
      - (job ?name (accounting . ?other))
      - (address ?name (Slumerville . ?rest))
      |#

    #+end_src
** Exercise 4.56
   #+begin_quote
   Formulate compound queries that retrieve the following information:

   a. the names of all people who are supervised by Ben Bitdiddle,
   together with their addresses;

   b. all people whose salary is less than Ben Bitdiddle's,
   together with their salary and Ben Bitdiddle's salary;

   c. all people who are supervised by someone who is not in the
   computer division, together with the supervisor's name and
   job. 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| Solutions:
      a. (and (supervisor ?name (Bitdiddle Ben))
      (address ?name . ?rest))

      b. (and (salary ?person ?salary)
      (salary (Bitdiddle Ben) ?ben-salary)
      (lisp-value > ?salary ?ben-salary))

      c. (and (supervisor ?supervisor ?supervisee)
      (job ?supervisor ?job))
      |#

    #+end_src
** Exercise 4.57
   #+begin_quote
   Define a rule that says that person 1 can replace person 2 if either person
   1 does the same job as person 2 or someone who does person 1’s job can also
   do person 2’s job, and if person 1 and person 2 are not the same person.
   Using your rule, give queries that find the following:

   - all people who can replace Cy D. Fect;
   - all people who can replace someone who is being paid more than they are,
     together with the two salaries. 
   #+end_quote
   *** Answer
   #+begin_src scheme
     (query/infuse
      '(rule (replaceable ?p1 ?p2)
             (and (or (and (job ?p1 ?p1post)
                           (job ?p2 ?p1post))
                      (and (job ?p1 ?p1post)
                           (job ?p2 ?p2post)
                           (can-do-job ?p1post ?p2post)))
                  (not (same ?p1 ?p2)))))

     #| Solution:
     - all people who can replace Cy D. Fect
     => (replaceable ?t (Fect Cy D))
     - all people who can replace someone who is being paid more than they are,
     together with the two salaries.
     => (and (replaceable ?p1 ?p2)
     (salary ?p1 ?s1)
     (salary ?p2 ?s2)
     (lisp-value > ?s2 ?s1))

     |#
   #+end_src
** Exercise 4.58
   #+begin_quote
   Define a rule that says that a person is a "big shot" in a division if the
   person works in the division but does not have a supervisor who works in
   the division. 
   #+end_quote
