_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org744a682" class="outline-3">
<h3 id="org744a682">Exercise 4.54</h3>
<div class="outline-text-3" id="text-org744a682">
<div class="question" id="orge218784">
<p>

</p>

<p>
If we had not realized that require could be implemented as an ordinary
procedure that uses `amb&rsquo;, to be defined by the user as part of a
nondeterministic program, we would have had to implement it as a special
form. This would require syntax procedures
</p>

<p>
(define (require? exp)
(tagged-list? exp &rsquo;require))
</p>

<p>
(define (require-predicate exp)
(cadr exp))
</p>

<p>
and a new clause in the dispatch in analyze
</p>

<p>
((require? exp) (analyze-require exp))
</p>

<p>
as well the procedure analyze-require that handles require expressions.
Complete the following definition of analyze-require.
</p>

<p>
(define (analyze-require exp)
(let ((pproc (analyze
(require-predicate exp))))
(lambda (env succeed fail)
(pproc env
(lambda (pred-value fail2)
(if ⟨??⟩
⟨??⟩
(succeed &rsquo;ok fail2)))
fail)))) 
</p>

</div>
</div>
<div id="outline-container-org507e88b" class="outline-4">
<h4 id="org507e88b">Answer</h4>
<div class="outline-text-4" id="text-org507e88b">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">require-predicate</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>cadr exp<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">amb/analyze-require</span> exp<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">[</span>pproc <span style="color: #859900;">(</span>analyze <span style="color: #b58900;">(</span>require-predicate exp<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">]</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>env succeed fail<span style="color: #6c71c4;">)</span>
      <span style="color: #6c71c4;">(</span>pproc
       env
       <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #b58900;">(</span>value fail2<span style="color: #b58900;">)</span>
         <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>not <span style="color: #6c71c4;">(</span>true? value<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
             <span style="color: #268bd2;">(</span>fail<span style="color: #268bd2;">)</span>
             <span style="color: #268bd2;">(</span>succeed 'ok fail2<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
      fail<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orga71b074" class="outline-3">
<h3 id="orga71b074">Exercise 4.55</h3>
<div class="outline-text-3" id="text-orga71b074">
<div class="question" id="orge145023">
<p>
Give simple queries that retrieve the following information from the data
base:
</p>

<ul class="org-ul">
<li>all people supervised by Ben Bitdiddle;</li>
<li>the names and jobs of all people in the accounting division;</li>
<li>the names and addresses of all people who live in Slumerville.</li>
</ul>

</div>
</div>
<div id="outline-container-orga77adb6" class="outline-4">
<h4 id="orga77adb6">Answer</h4>
<div class="outline-text-4" id="text-orga77adb6">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solution:</span>
<span style="color: #93a1a1;">Respectively:</span>

<span style="color: #93a1a1;">- (supervisor ?x (Bitdiddle Ben))</span>
<span style="color: #93a1a1;">- (job ?name (accounting . ?other))</span>
<span style="color: #93a1a1;">- (address ?name (Slumerville . ?rest))</span>
<span style="color: #93a1a1;">|#</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org43279bf" class="outline-3">
<h3 id="org43279bf">Exercise 4.56</h3>
<div class="outline-text-3" id="text-org43279bf">
<div class="question" id="org22f54b1">
<p>
Formulate compound queries that retrieve the following information:
</p>

<p>
a. the names of all people who are supervised by Ben Bitdiddle,
together with their addresses;
</p>

<p>
b. all people whose salary is less than Ben Bitdiddle&rsquo;s,
together with their salary and Ben Bitdiddle&rsquo;s salary;
</p>

<p>
c. all people who are supervised by someone who is not in the
computer division, together with the supervisor&rsquo;s name and
job. 
</p>

</div>
</div>
<div id="outline-container-orgbb02ce9" class="outline-4">
<h4 id="orgbb02ce9">Answer</h4>
<div class="outline-text-4" id="text-orgbb02ce9">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solutions:</span>
<span style="color: #93a1a1;">a. (and (supervisor ?name (Bitdiddle Ben))</span>
<span style="color: #93a1a1;">(address ?name . ?rest))</span>

<span style="color: #93a1a1;">b. (and (salary ?person ?salary)</span>
<span style="color: #93a1a1;">(salary (Bitdiddle Ben) ?ben-salary)</span>
<span style="color: #93a1a1;">(lisp-value &gt; ?salary ?ben-salary))</span>

<span style="color: #93a1a1;">c. (and (supervisor ?supervisor ?supervisee)</span>
<span style="color: #93a1a1;">(job ?supervisor ?job))</span>
<span style="color: #93a1a1;">|#</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgaaa4cc4" class="outline-3">
<h3 id="orgaaa4cc4">Exercise 4.57</h3>
<div class="outline-text-3" id="text-orgaaa4cc4">
<div class="question" id="orgc886880">
<p>
Define a rule that says that person 1 can replace person 2 if either person
1 does the same job as person 2 or someone who does person 1’s job can also
do person 2’s job, and if person 1 and person 2 are not the same person.
Using your rule, give queries that find the following:
</p>

<ul class="org-ul">
<li>all people who can replace Cy D. Fect;</li>
<li>all people who can replace someone who is being paid more than they are,
together with the two salaries.</li>
</ul>

</div>
</div>

<div id="outline-container-org7ad0c7a" class="outline-4">
<h4 id="org7ad0c7a">Answer</h4>
<div class="outline-text-4" id="text-org7ad0c7a">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span>query/infuse
 '<span style="color: #b58900;">(</span>rule <span style="color: #268bd2;">(</span>replaceable ?p1 ?p2<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">or</span> <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #b58900;">(</span>job ?p1 ?p1post<span style="color: #b58900;">)</span>
                      <span style="color: #b58900;">(</span>job ?p2 ?p1post<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
                 <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #b58900;">(</span>job ?p1 ?p1post<span style="color: #b58900;">)</span>
                      <span style="color: #b58900;">(</span>job ?p2 ?p2post<span style="color: #b58900;">)</span>
                      <span style="color: #b58900;">(</span>can-do-job ?p1post ?p2post<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
             <span style="color: #6c71c4;">(</span>not <span style="color: #859900;">(</span>same ?p1 ?p2<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">#| Solution:</span>
<span style="color: #93a1a1;">- all people who can replace Cy D. Fect</span>
<span style="color: #93a1a1;">=&gt; (replaceable ?t (Fect Cy D))</span>
<span style="color: #93a1a1;">- all people who can replace someone who is being paid more than they are,</span>
<span style="color: #93a1a1;">together with the two salaries.</span>
<span style="color: #93a1a1;">=&gt; (and (replaceable ?p1 ?p2)</span>
<span style="color: #93a1a1;">(salary ?p1 ?s1)</span>
<span style="color: #93a1a1;">(salary ?p2 ?s2)</span>
<span style="color: #93a1a1;">(lisp-value &gt; ?s2 ?s1))</span>

<span style="color: #93a1a1;">|#</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc0a6532" class="outline-3">
<h3 id="orgc0a6532">Exercise 4.58</h3>
<div class="outline-text-3" id="text-orgc0a6532">
<div class="question" id="org319931d">
<p>
Define a rule that says that a person is a &ldquo;big shot&rdquo; in a division if the
person works in the division but does not have a supervisor who works in
the division. 
</p>

</div>
</div>
