org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme
      (query/infuse
       '(rule (big-shot ?p1)
              (and
               (job ?p1 (?dept . ?job))
               (or
                (not (supervisor ?p1 ?p2))
                (and (supervisor ?p1 ?p2)
                     (not (job ?p2 (?dept . ?job2))))))))

    #+end_src
** Exercise 4.59
   #+begin_quote
   Ben Bitdiddle has missed one meeting too many. Fearing that his habit of
   forgetting meetings could cost him his job, Ben decides to do something
   about it. He adds all the weekly meetings of the firm to the Microshaft
   data base by asserting the following:

   #+end_quote
*** Answer
    #+begin_src scheme
      (map query/infuse
           '((meeting accounting (Monday 9am))
             (meeting administration (Monday 10am))
             (meeting computer (Wednesday 3pm))
             (meeting administration (Friday 1pm))))

      #|
      Each of the above assertions is for a meeting of an entire division.
      Ben also adds an entry for the company-wide meeting that spans all the
      divisions. All of the company's employees attend this meeting.
      |#

      (query/infuse '(meeting whole-company (Wednesday 4pm)))

      #|

      a. On Friday morning, Ben wants to query the data base for all the meetings
      that occur that day. What query should he use?

      b. Alyssa P. Hacker is unimpressed. She thinks it would be much more useful
      to be able to ask for her meetings by specifying her name. So she designs a
      rule that says that a person's meetings include all `whole-company'
      meetings plus all meetings of that person's division. Fill in the body of
      Alyssa's rule.

      (rule (meeting-time ?person ?day-and-time)
      <RULE-BODY>)

      c. Alyssa arrives at work on Wednesday morning and wonders what meetings
      she has to attend that day. Having defined the above rule, what query
      should she make to find this out?
      |#

      ;; Solutions:
      ;; a. (meeting ?meeting (Friday ?time))
      ;; b.
      (query/infuse
       '(rule (meeting-time ?person ?day-and-time)
              (or
               (meeting whole-company ?day-and-time)
               (and
                (meeting ?division ?day-and-time)
                (job ?person (?division . ?job))))))

      ;; c. (meeting-time (Hacker Alyssa P) (Wednesday . ?x))

    #+end_src
** Exercise 4.60
   #+begin_quote
   By giving the query

   (lives-near ?person (Hacker Alyssa P))

   Alyssa P. Hacker is able to find people who live near her, with
   whom she can ride to work.  On the other hand, when she tries to
   find all pairs of people who live near each other by querying

   (lives-near ?person-1 ?person-2)

   she notices that each pair of people who live near each other is
   listed twice; for example,

   (lives-near (Hacker Alyssa P) (Fect Cy D))
   (lives-near (Fect Cy D) (Hacker Alyssa P))

   Why does this happen?  Is there a way to find a list of people who
   live near each other, in which each pair appears only once?
   Explain. 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| Solution:
      The reason this occurs it that there is no 'ordering' on the results
      returned, e.g (Dewitt) (Louis) is equally valid to (Louis) (Dewitt) when
      the query analyzer searches through valid responses.
      |#

      (query/infuse
       '(rule (lives-near-only ?person-1 ?person-2)
              (and
               (address ?person-1 (?town . ?rest-1))
               (address ?person-2 (?town . ?rest-2))
               (not (same ?person-1 ?person-2))
               (lisp-value (lambda (x y)
                             (string<=? (symbol->string (car x))
                                        (symbol->string (car y)))) ?person-1 ?person-2))))

    #+end_src
** Exercise 4.61
   #+begin_quote
   The following rules implement a `next-to' relation that finds adjacent
   elements of a list:

   (rule (?x next-to ?y in (?x ?y . ?u)))

   (rule (?x next-to ?y in (?v . ?z))
   (?x next-to ?y in ?z))

   What will the response be to the following queries?

   (?x next-to ?y in (1 (2 3) 4))

   (?x next-to 1 in (2 1 3 1))

   #+end_quote
