_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org6056b4f" class="outline-4">
<h4 id="org6056b4f">Answer</h4>
<div class="outline-text-4" id="text-org6056b4f">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span>query/infuse
 '<span style="color: #b58900;">(</span>rule <span style="color: #268bd2;">(</span>big-shot ?p1<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">and</span>
         <span style="color: #6c71c4;">(</span>job ?p1 <span style="color: #859900;">(</span>?dept . ?job<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">or</span>
          <span style="color: #859900;">(</span>not <span style="color: #b58900;">(</span>supervisor ?p1 ?p2<span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #b58900;">(</span>supervisor ?p1 ?p2<span style="color: #b58900;">)</span>
               <span style="color: #b58900;">(</span>not <span style="color: #268bd2;">(</span>job ?p2 <span style="color: #6c71c4;">(</span>?dept . ?job2<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org02051c2" class="outline-3">
<h3 id="org02051c2">Exercise 4.59</h3>
<div class="outline-text-3" id="text-org02051c2">
<div class="question" id="org414e6d7">
<p>
Ben Bitdiddle has missed one meeting too many. Fearing that his habit of
forgetting meetings could cost him his job, Ben decides to do something
about it. He adds all the weekly meetings of the firm to the Microshaft
data base by asserting the following:
</p>

</div>
</div>
<div id="outline-container-org62336be" class="outline-4">
<h4 id="org62336be">Answer</h4>
<div class="outline-text-4" id="text-org62336be">
<div class="org-src-container">
<pre class="src src-scheme"><span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">map</span> query/infuse
     '<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>meeting accounting <span style="color: #6c71c4;">(</span>Monday 9am<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>meeting administration <span style="color: #6c71c4;">(</span>Monday 10am<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>meeting computer <span style="color: #6c71c4;">(</span>Wednesday 3pm<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>meeting administration <span style="color: #6c71c4;">(</span>Friday 1pm<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">#|</span>
<span style="color: #93a1a1;">Each of the above assertions is for a meeting of an entire division.</span>
<span style="color: #93a1a1;">Ben also adds an entry for the company-wide meeting that spans all the</span>
<span style="color: #93a1a1;">divisions. All of the company's employees attend this meeting.</span>
<span style="color: #93a1a1;">|#</span>

<span style="color: #2aa198;">(</span>query/infuse '<span style="color: #b58900;">(</span>meeting whole-company <span style="color: #268bd2;">(</span>Wednesday 4pm<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">#|</span>

<span style="color: #93a1a1;">a. On Friday morning, Ben wants to query the data base for all the meetings</span>
<span style="color: #93a1a1;">that occur that day. What query should he use?</span>

<span style="color: #93a1a1;">b. Alyssa P. Hacker is unimpressed. She thinks it would be much more useful</span>
<span style="color: #93a1a1;">to be able to ask for her meetings by specifying her name. So she designs a</span>
<span style="color: #93a1a1;">rule that says that a person's meetings include all `whole-company'</span>
<span style="color: #93a1a1;">meetings plus all meetings of that person's division. Fill in the body of</span>
<span style="color: #93a1a1;">Alyssa's rule.</span>

<span style="color: #93a1a1;">(rule (meeting-time ?person ?day-and-time)</span>
<span style="color: #93a1a1;">&lt;RULE-BODY&gt;)</span>

<span style="color: #93a1a1;">c. Alyssa arrives at work on Wednesday morning and wonders what meetings</span>
<span style="color: #93a1a1;">she has to attend that day. Having defined the above rule, what query</span>
<span style="color: #93a1a1;">should she make to find this out?</span>
<span style="color: #93a1a1;">|#</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Solutions:</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">a. (meeting ?meeting (Friday ?time))</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">b.</span>
<span style="color: #2aa198;">(</span>query/infuse
 '<span style="color: #b58900;">(</span>rule <span style="color: #268bd2;">(</span>meeting-time ?person ?day-and-time<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">or</span>
         <span style="color: #6c71c4;">(</span>meeting whole-company ?day-and-time<span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">and</span>
          <span style="color: #859900;">(</span>meeting ?division ?day-and-time<span style="color: #859900;">)</span>
          <span style="color: #859900;">(</span>job ?person <span style="color: #b58900;">(</span>?division . ?job<span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">c. (meeting-time (Hacker Alyssa P) (Wednesday . ?x))</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org9d0bd9f" class="outline-3">
<h3 id="org9d0bd9f">Exercise 4.60</h3>
<div class="outline-text-3" id="text-org9d0bd9f">
<div class="question" id="orgbc3d631">
<p>
By giving the query
</p>

<p>
(lives-near ?person (Hacker Alyssa P))
</p>

<p>
Alyssa P. Hacker is able to find people who live near her, with
whom she can ride to work.  On the other hand, when she tries to
find all pairs of people who live near each other by querying
</p>

<p>
(lives-near ?person-1 ?person-2)
</p>

<p>
she notices that each pair of people who live near each other is
listed twice; for example,
</p>

<p>
(lives-near (Hacker Alyssa P) (Fect Cy D))
(lives-near (Fect Cy D) (Hacker Alyssa P))
</p>

<p>
Why does this happen?  Is there a way to find a list of people who
live near each other, in which each pair appears only once?
Explain. 
</p>

</div>
</div>
<div id="outline-container-org94b6d85" class="outline-4">
<h4 id="org94b6d85">Answer</h4>
<div class="outline-text-4" id="text-org94b6d85">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solution:</span>
<span style="color: #93a1a1;">The reason this occurs it that there is no 'ordering' on the results</span>
<span style="color: #93a1a1;">returned, e.g (Dewitt) (Louis) is equally valid to (Louis) (Dewitt) when</span>
<span style="color: #93a1a1;">the query analyzer searches through valid responses.</span>
<span style="color: #93a1a1;">|#</span>

<span style="color: #2aa198;">(</span>query/infuse
 '<span style="color: #b58900;">(</span>rule <span style="color: #268bd2;">(</span>lives-near-only ?person-1 ?person-2<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">and</span>
         <span style="color: #6c71c4;">(</span>address ?person-1 <span style="color: #859900;">(</span>?town . ?rest-1<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>address ?person-2 <span style="color: #859900;">(</span>?town . ?rest-2<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>not <span style="color: #859900;">(</span>same ?person-1 ?person-2<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
         <span style="color: #6c71c4;">(</span>lisp-value <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">lambda</span> <span style="color: #b58900;">(</span>x y<span style="color: #b58900;">)</span>
                       <span style="color: #b58900;">(</span>string&lt;=? <span style="color: #268bd2;">(</span>symbol-&gt;string <span style="color: #6c71c4;">(</span>car x<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
                                  <span style="color: #268bd2;">(</span>symbol-&gt;string <span style="color: #6c71c4;">(</span>car y<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span> ?person-1 ?person-2<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5b5e776" class="outline-3">
<h3 id="org5b5e776">Exercise 4.61</h3>
<div class="outline-text-3" id="text-org5b5e776">
<div class="question" id="orgf028496">
<p>
The following rules implement a `next-to&rsquo; relation that finds adjacent
elements of a list:
</p>

<p>
(rule (?x next-to ?y in (?x ?y . ?u)))
</p>

<p>
(rule (?x next-to ?y in (?v . ?z))
(?x next-to ?y in ?z))
</p>

<p>
What will the response be to the following queries?
</p>

<p>
(?x next-to ?y in (1 (2 3) 4))
</p>

<p>
(?x next-to 1 in (2 1 3 1))
</p>

</div>
</div>
