org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme

      ;; Solution:
      ;; The rules written as-is are incompatible with the existing system, a s, I've resolved them in the following way:

      (query/infuse '(rule (next-to ?x ?y in (?x ?y . ?u))))
      (query/infuse '(rule (next-to ?x ?y in (?v . ?z))
                           (next-to ?x ?y in ?z)))

      ;; (next-to ?x ?y in (1 (2 3) 4)) => ((1 (2 3) 4) ((2 3) 4))
      ;; (next-to ?x 1 in (2 1 3 1)) => ((3 1)  (2 1))

    #+end_src
** Exercise 4.62
   #+begin_quote
   Define rules to implement the `last-pair' operation of *Note Exercise 2-17,
   which returns a list containing the last element of a nonempty list. Check
   your rules on queries such as `(last-pair (3) ?x)', `(last-pair (1 2 3)
   ?x)', and `(last-pair (2 ?x) (3))'. Do your rules work correctly on queries
   such as `(last-pair ?x (3))' ? 
   #+end_quote
*** Answer
    #+begin_src scheme

      ;; Solution, it does not work correctly on results that yield an infinite
      ;; nubmer of answers;
      (map query/infuse
           '((rule (last-pair (?h) (?h)))
             (rule (last-pair (?h . ?t) ?last)
                   (last-pair ?t ?last))))

    #+end_src
** Exercise 4.63
   #+begin_quote
   The following data base (see Genesis 4) traces the genealogy of the
   descendants of Ada back to Adam, by way of Cain:

   #+end_quote
*** Answer
    #+begin_src scheme

      (map query/infuse
           '((son Adam Cain)
             (son Cain Enoch)
             (son Enoch Irad)
             (son Irad Mehujael)
             (son Mehujael Methushael)
             (son Methushael Lamech)
             (wife Lamech Ada)
             (son Ada Jabal)
             (son Ada Jubal)))

      #|
      Formulate rules such as

      "If S is the son of f, and f is the son of
      G, then S is the grandson of G" and "If W is the wife of M, and S
      is the son of W, then S is the son of M"

      (which was supposedly more true in biblical times than today) that will
      enable the query system to find the grandson of Cain; the sons of Lamech;
      the grandsons of Methushael. (See *Note Exercise 4-69 for some rules to
      deduce more complicated relationships.)
      |#

      (query/infuse
       '(rule (grandparent ?g ?f ?s)
              (and (son ?g ?f) (son ?f ?s))))

      (query/infuse
       '(rule (son-of ?w ?m ?s)
              (and (wife ?m ?w) (son ?w ?s))))

    #+end_src
** Exercise 4.64
   #+begin_quote
   Louis Reasoner mistakenly deletes the `outranked-by' rule
   (section *Note 4.4.1) from the data base. When he realizes this,
   he quickly reinstalls it. Unfortunately, he makes a slight change
   in the rule, and types it in as

   #+end_quote
*** Answer
    #+begin_src scheme
    (query/infuse '(rule (loop-outranked-by ?staff-person ?boss)
    (or (supervisor ?staff-person ?boss)
    (and (outranked-by ?middle-manager ?boss)
    (supervisor ?staff-person ?middle-manager)))))
    #|

    Just after Louis types this information into the system, DeWitt
    Aull comes by to find out who outranks Ben Bitdiddle. He issues
    the query

    (outranked-by (Bitdiddle Ben) ?who)

    After answering, the system goes into an infinite loop.  Explain
    why. |#

    #| Solution:

    The problem with this query is the order in which applicable rules are
    specified.

* After finding the previous `supervisor' rule applied; that is, the
  rule conclusion `(supervisor (Bitdiddle Ben) ?boss)' successfully
  unifies with the query pattern `(supervisor ?staff-person ?boss)' to
  produce a frame in which `?boss' is bound to `?who'. The interpreter
  proceeds to evaluate the next rule: `(outranked-by ?middle-manager
  ?boss)' in the same frame.

* One answer appears in the database.

* The `outranked-by' rule is also applicable, so the evaluator again
  evaluators the `outranked-by' rule body which is equivalent to
  `(outranked-by ?middle-manager ?who)' |#
  #+end_src
** Exercise 4.65
   #+begin_quote
   Cy D. Fect, looking forward to the day when he will rise in the
   organization, gives a query to find all the wheels
   (using the `wheel' rule of section *Note 4-4-1)

   (wheel ?who)

   To his surprise, the system responds

   ;;; Query results:
   (wheel (Warbucks Oliver))
   (wheel (Bitdiddle Ben))
   (wheel (Warbucks Oliver))
   (wheel (Warbucks Oliver))
   (wheel (Warbucks Oliver))

   Why is Oliver Warbucks listed four times? 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| Solution:

      The body of `wheel' contains a query pattern
      `(supervisor ?x ?middle-manager)' that can be satisfied by a
      variety of different values, each of those values contributes
      a match to the rule |#

    #+end_src
