_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org731ac65" class="outline-4">
<h4 id="org731ac65">Answer</h4>
<div class="outline-text-4" id="text-org731ac65">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Solution:</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">The rules written as-is are incompatible with the existing system, a s, I've resolved them in the following way:</span>

<span style="color: #2aa198;">(</span>query/infuse '<span style="color: #b58900;">(</span>rule <span style="color: #268bd2;">(</span>next-to ?x ?y in <span style="color: #6c71c4;">(</span>?x ?y . ?u<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span>query/infuse '<span style="color: #b58900;">(</span>rule <span style="color: #268bd2;">(</span>next-to ?x ?y in <span style="color: #6c71c4;">(</span>?v . ?z<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
                     <span style="color: #268bd2;">(</span>next-to ?x ?y in ?z<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">(next-to ?x ?y in (1 (2 3) 4)) =&gt; ((1 (2 3) 4) ((2 3) 4))</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">(next-to ?x 1 in (2 1 3 1)) =&gt; ((3 1)  (2 1))</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org5bc876f" class="outline-3">
<h3 id="org5bc876f">Exercise 4.62</h3>
<div class="outline-text-3" id="text-org5bc876f">
<div class="question" id="org0ecc275">
<p>
Define rules to implement the `last-pair&rsquo; operation of *Note Exercise 2-17,
which returns a list containing the last element of a nonempty list. Check
your rules on queries such as `(last-pair (3) ?x)&rsquo;, `(last-pair (1 2 3)
?x)&rsquo;, and `(last-pair (2 ?x) (3))&rsquo;. Do your rules work correctly on queries
such as `(last-pair ?x (3))&rsquo; ? 
</p>

</div>
</div>
<div id="outline-container-org9116cd2" class="outline-4">
<h4 id="org9116cd2">Answer</h4>
<div class="outline-text-4" id="text-org9116cd2">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Solution, it does not work correctly on results that yield an infinite</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">nubmer of answers;</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">map</span> query/infuse
     '<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>rule <span style="color: #6c71c4;">(</span>last-pair <span style="color: #859900;">(</span>?h<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>?h<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>rule <span style="color: #6c71c4;">(</span>last-pair <span style="color: #859900;">(</span>?h . ?t<span style="color: #859900;">)</span> ?last<span style="color: #6c71c4;">)</span>
             <span style="color: #6c71c4;">(</span>last-pair ?t ?last<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd3ca4e5" class="outline-3">
<h3 id="orgd3ca4e5">Exercise 4.63</h3>
<div class="outline-text-3" id="text-orgd3ca4e5">
<div class="question" id="orga7f9aa6">
<p>
The following data base (see Genesis 4) traces the genealogy of the
descendants of Ada back to Adam, by way of Cain:
</p>

</div>
</div>
<div id="outline-container-org55e03cd" class="outline-4">
<h4 id="org55e03cd">Answer</h4>
<div class="outline-text-4" id="text-org55e03cd">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">map</span> query/infuse
     '<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>son Adam Cain<span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>son Cain Enoch<span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>son Enoch Irad<span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>son Irad Mehujael<span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>son Mehujael Methushael<span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>son Methushael Lamech<span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>wife Lamech Ada<span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>son Ada Jabal<span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>son Ada Jubal<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">#|</span>
<span style="color: #93a1a1;">Formulate rules such as</span>

<span style="color: #93a1a1;">"If S is the son of f, and f is the son of</span>
<span style="color: #93a1a1;">G, then S is the grandson of G" and "If W is the wife of M, and S</span>
<span style="color: #93a1a1;">is the son of W, then S is the son of M"</span>

<span style="color: #93a1a1;">(which was supposedly more true in biblical times than today) that will</span>
<span style="color: #93a1a1;">enable the query system to find the grandson of Cain; the sons of Lamech;</span>
<span style="color: #93a1a1;">the grandsons of Methushael. (See *Note Exercise 4-69 for some rules to</span>
<span style="color: #93a1a1;">deduce more complicated relationships.)</span>
<span style="color: #93a1a1;">|#</span>

<span style="color: #2aa198;">(</span>query/infuse
 '<span style="color: #b58900;">(</span>rule <span style="color: #268bd2;">(</span>grandparent ?g ?f ?s<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #6c71c4;">(</span>son ?g ?f<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>son ?f ?s<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>query/infuse
 '<span style="color: #b58900;">(</span>rule <span style="color: #268bd2;">(</span>son-of ?w ?m ?s<span style="color: #268bd2;">)</span>
        <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">and</span> <span style="color: #6c71c4;">(</span>wife ?m ?w<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>son ?w ?s<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8966f4b" class="outline-3">
<h3 id="org8966f4b">Exercise 4.64</h3>
<div class="outline-text-3" id="text-org8966f4b">
<div class="question" id="orgdca1458">
<p>
Louis Reasoner mistakenly deletes the `outranked-by&rsquo; rule
(section *Note 4.4.1) from the data base. When he realizes this,
he quickly reinstalls it. Unfortunately, he makes a slight change
in the rule, and types it in as
</p>

</div>
</div>
<div id="outline-container-orgc6b6a66" class="outline-4">
<h4 id="orgc6b6a66">Answer</h4>
<div class="outline-text-4" id="text-orgc6b6a66">
<p>
#+begin<sub>question</sub>
 (query/infuse &rsquo;(rule (loop-outranked-by ?staff-person ?boss)
 (or (supervisor ?staff-person ?boss)
 (and (outranked-by ?middle-manager ?boss)
 (supervisor ?staff-person ?middle-manager)))))
</p>

<p>
Just after Louis types this information into the system, DeWitt
Aull comes by to find out who outranks Ben Bitdiddle. He issues
the query
</p>

<p>
(outranked-by (Bitdiddle Ben) ?who)
</p>

<p>
After answering, the system goes into an infinite loop.  Explain
why. 
</p>

<p>
Solution:
</p>

<p>
The problem with this query is the order in which applicable rules are
specified.
</p>

<p>
  After finding the previous `supervisor' rule applied; that is, the
  rule conclusion `(supervisor (Bitdiddle Ben) ?boss)' successfully
  unifies with the query pattern `(supervisor ?staff-person ?boss)' to
  produce a frame in which `?boss' is bound to `?who'. The interpreter
  proceeds to evaluate the next rule: `(outranked-by ?middle-manager
  ?boss)' in the same frame.
  One answer appears in the database.
  The `outranked-by' rule is also applicable, so the evaluator again
evaluators the `outranked-by' rule body which is equivalent to
`(outranked-by ?middle-manager ?who)' |#
#+end<sub>src</sub>
</p>
</div>
</div>
</div>
<div id="outline-container-orgb6e9d33" class="outline-3">
<h3 id="orgb6e9d33">Exercise 4.65</h3>
<div class="outline-text-3" id="text-orgb6e9d33">
<div class="question" id="orgaf095ff">
<p>
Cy D. Fect, looking forward to the day when he will rise in the
organization, gives a query to find all the wheels
(using the `wheel&rsquo; rule of section *Note 4-4-1)
</p>

<p>
(wheel ?who)
</p>

<p>
To his surprise, the system responds
</p>

<p>
;;; Query results:
(wheel (Warbucks Oliver))
(wheel (Bitdiddle Ben))
(wheel (Warbucks Oliver))
(wheel (Warbucks Oliver))
(wheel (Warbucks Oliver))
</p>

<p>
Why is Oliver Warbucks listed four times? 
</p>

</div>
</div>
<div id="outline-container-orgca61a3e" class="outline-4">
<h4 id="orgca61a3e">Answer</h4>
<div class="outline-text-4" id="text-orgca61a3e">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solution:</span>

<span style="color: #93a1a1;">The body of `wheel' contains a query pattern</span>
<span style="color: #93a1a1;">`(supervisor ?x ?middle-manager)' that can be satisfied by a</span>
<span style="color: #93a1a1;">variety of different values, each of those values contributes</span>
<span style="color: #93a1a1;">a match to the rule |#</span>

</pre>
</div>
</div>
</div>
</div>
