org/_posts/2019-06-23-sicp-chapter-4.org
** Exercise 4.66
   #+begin_quote
   Ben has been generalizing the query system to provide statistics about
   the company. For example, to find the total salaries of all the
   computer programmers one will be able to say

   (sum ?amount
   (and (job ?x (computer programmer))
   (salary ?x ?amount)))

   In general, Ben's new system allows expressions of the form

   (accumulation-function <VARIABLE>
   <QUERY PATTERN>)

   where `accumulation-function' can be things like `sum', `average', or
   `maximum'. Ben reasons that it should be a cinch to implement this. He
   will simply feed the query pattern to `qeval'. This will produce a
   stream of frames. He will then pass this stream through a mapping
   function that extracts the value of the designated variable from each
   frame in the stream and feed the resulting stream of values to the
   accumulation function. Just as Ben completes the implementation and is
   about to try it out, Cy walks by, still puzzling over the `wheel'
   query result in exercise *Note Exercise 4-65. When Cy shows Ben the
   system's response, Ben groans, "Oh, no, my simple accumulation scheme
   won't work!"

   What has Ben just realized? Outline a method he can use to salvage the
   situation. 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| Solution
      Although the query supplied doesn't demonstrate it, it is possible to
      have multiple frames returns. |#

    #+end_src
** Exercise 4.67
   #+begin_quote
   Devise a way to install a loop detector in the query system so as to
   avoid the kinds of simple loops illustrated in the text and in *NoteExercise 4.64.

   The general idea is that the system should maintain some sort of
   history of its current chain of deductions and should not begin
   processing a query that it is already working on. Describe what kind
   of information (patterns and frames) is included in this history, and
   how the check should be made. (After you study the details of the
   query-system implementation in section *Note 4.4.4, you may want to
   modify the system to include your loop detector.) 
   #+end_quote
*** Answer
    #+begin_src scheme

      ;; Because the rule variable contains the execution information, we can
      ;; lookup if a rule with the exact same parameters has been called before.
      (define executed-rules '())
      (define (previously-executed? rule)
        (member rule executed-rules))
      (define (add-executed-rule! rule)
        (set! executed-rules (cons rule executed-rules)))

      (define (noloop/apply-a-rule rule query-pattern query-frame)
        (if (previously-executed? rule) stream-null
            (let* ([clean-rule (rename-variables-in rule)] ; alpha-conversion
                   [unify-result (unify-match query-pattern
                                              (conclusion clean-rule)
                                              query-frame)])
              (if (eq? unify-result 'failed) stream-null
                  (begin
                    (add-executed-rule! rule)
                    (qeval (rule-body clean-rule)
                           (singleton-stream
                            unify-result)))))))

      ;; The following are just driver extensions to permit for `noloop' to work
      (define (noloop/query-driver-loop)
        (set! executed-rules '())
        (set! apply-a-rule noloop/apply-a-rule)
        (query-driver-loop))

      (define (noloop/query/eval expr)
        (set! executed-rules '())
        (set! apply-a-rule noloop/apply-a-rule)
        (let ((q (query-syntax-process expr)))
          (stream->list
           (stream-map
            (λ (frame)
              (instantiate q frame (λ (v f) (contract-question-mark v))))
            (qeval q (singleton-stream '()))))))

      (install-driver-loop 'qeval-noloop noloop/query-driver-loop)
    #+end_src
** Exercise 4.68
   #+begin_quote
   Define rules to implement the `reverse' operation of *Note Exercise 2-18,
   which returns a list containing the same elements as a given list in
   reverse order. (Hint: Use `append-to-form'.) Can your rules answer both
   `(reverse (1 2 3) ?x)' and `(reverse ?x (1 2 3))' ? 
   #+end_quote
