_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org1d47264" class="outline-3">
<h3 id="org1d47264">Exercise 4.66</h3>
<div class="outline-text-3" id="text-org1d47264">
<div class="question" id="org0ce94bc">
<p>
Ben has been generalizing the query system to provide statistics about
the company. For example, to find the total salaries of all the
computer programmers one will be able to say
</p>

<p>
(sum ?amount
(and (job ?x (computer programmer))
(salary ?x ?amount)))
</p>

<p>
In general, Ben&rsquo;s new system allows expressions of the form
</p>

<p>
(accumulation-function &lt;VARIABLE&gt;
&lt;QUERY PATTERN&gt;)
</p>

<p>
where `accumulation-function&rsquo; can be things like `sum&rsquo;, `average&rsquo;, or
`maximum&rsquo;. Ben reasons that it should be a cinch to implement this. He
will simply feed the query pattern to `qeval&rsquo;. This will produce a
stream of frames. He will then pass this stream through a mapping
function that extracts the value of the designated variable from each
frame in the stream and feed the resulting stream of values to the
accumulation function. Just as Ben completes the implementation and is
about to try it out, Cy walks by, still puzzling over the `wheel&rsquo;
query result in exercise *Note Exercise 4-65. When Cy shows Ben the
system&rsquo;s response, Ben groans, &ldquo;Oh, no, my simple accumulation scheme
won&rsquo;t work!&rdquo;
</p>

<p>
What has Ben just realized? Outline a method he can use to salvage the
situation. 
</p>

</div>
</div>
<div id="outline-container-org993edc2" class="outline-4">
<h4 id="org993edc2">Answer</h4>
<div class="outline-text-4" id="text-org993edc2">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solution</span>
<span style="color: #93a1a1;">Although the query supplied doesn't demonstrate it, it is possible to</span>
<span style="color: #93a1a1;">have multiple frames returns. |#</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4d693dd" class="outline-3">
<h3 id="org4d693dd">Exercise 4.67</h3>
<div class="outline-text-3" id="text-org4d693dd">
<div class="question" id="org110a04a">
<p>
Devise a way to install a loop detector in the query system so as to
avoid the kinds of simple loops illustrated in the text and in *NoteExercise 4.64.
</p>

<p>
The general idea is that the system should maintain some sort of
history of its current chain of deductions and should not begin
processing a query that it is already working on. Describe what kind
of information (patterns and frames) is included in this history, and
how the check should be made. (After you study the details of the
query-system implementation in section *Note 4.4.4, you may want to
modify the system to include your loop detector.) 
</p>

</div>
</div>
<div id="outline-container-orgf08ce74" class="outline-4">
<h4 id="orgf08ce74">Answer</h4>
<div class="outline-text-4" id="text-orgf08ce74">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">Because the rule variable contains the execution information, we can</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">lookup if a rule with the exact same parameters has been called before.</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #268bd2;">executed-rules</span> '<span style="color: #b58900;">()</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">previously-executed?</span> rule<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>member rule executed-rules<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">add-executed-rule!</span> rule<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>set! executed-rules <span style="color: #268bd2;">(</span>cons rule executed-rules<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">noloop/apply-a-rule</span> rule query-pattern query-frame<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #268bd2;">(</span>previously-executed? rule<span style="color: #268bd2;">)</span> stream-null
      <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">let*</span> <span style="color: #6c71c4;">(</span><span style="color: #859900;">[</span>clean-rule <span style="color: #b58900;">(</span>rename-variables-in rule<span style="color: #b58900;">)</span><span style="color: #859900;">]</span> <span style="color: #93a1a1;">; </span><span style="color: #93a1a1;">alpha-conversion</span>
             <span style="color: #859900;">[</span>unify-result <span style="color: #b58900;">(</span>unify-match query-pattern
                                        <span style="color: #268bd2;">(</span>conclusion clean-rule<span style="color: #268bd2;">)</span>
                                        query-frame<span style="color: #b58900;">)</span><span style="color: #859900;">]</span><span style="color: #6c71c4;">)</span>
        <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">if</span> <span style="color: #859900;">(</span>eq? unify-result 'failed<span style="color: #859900;">)</span> stream-null
            <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">begin</span>
              <span style="color: #b58900;">(</span>add-executed-rule! rule<span style="color: #b58900;">)</span>
              <span style="color: #b58900;">(</span>qeval <span style="color: #268bd2;">(</span>rule-body clean-rule<span style="color: #268bd2;">)</span>
                     <span style="color: #268bd2;">(</span>singleton-stream
                      unify-result<span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">The following are just driver extensions to permit for `noloop' to work</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">noloop/query-driver-loop</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>set! executed-rules '<span style="color: #268bd2;">()</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>set! apply-a-rule noloop/apply-a-rule<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>query-driver-loop<span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">define</span> <span style="color: #b58900;">(</span><span style="color: #268bd2;">noloop/query/eval</span> expr<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>set! executed-rules '<span style="color: #268bd2;">()</span><span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span>set! apply-a-rule noloop/apply-a-rule<span style="color: #b58900;">)</span>
  <span style="color: #b58900;">(</span><span style="color: #859900; font-weight: bold;">let</span> <span style="color: #268bd2;">(</span><span style="color: #6c71c4;">(</span>q <span style="color: #859900;">(</span>query-syntax-process expr<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
    <span style="color: #268bd2;">(</span>stream-&gt;list
     <span style="color: #6c71c4;">(</span>stream-map
      <span style="color: #859900;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #b58900;">(</span>frame<span style="color: #b58900;">)</span>
        <span style="color: #b58900;">(</span>instantiate q frame <span style="color: #268bd2;">(</span><span style="color: #859900; font-weight: bold;">&#955;</span> <span style="color: #6c71c4;">(</span>v f<span style="color: #6c71c4;">)</span> <span style="color: #6c71c4;">(</span>contract-question-mark v<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span>
      <span style="color: #859900;">(</span>qeval q <span style="color: #b58900;">(</span>singleton-stream '<span style="color: #268bd2;">()</span><span style="color: #b58900;">)</span><span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span>install-driver-loop 'qeval-noloop noloop/query-driver-loop<span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgb95aaee" class="outline-3">
<h3 id="orgb95aaee">Exercise 4.68</h3>
<div class="outline-text-3" id="text-orgb95aaee">
<div class="question" id="org55d4c3c">
<p>
Define rules to implement the `reverse&rsquo; operation of *Note Exercise 2-18,
which returns a list containing the same elements as a given list in
reverse order. (Hint: Use `append-to-form&rsquo;.) Can your rules answer both
`(reverse (1 2 3) ?x)&rsquo; and `(reverse ?x (1 2 3))&rsquo; ? 
</p>

</div>
</div>
