org/_posts/2019-06-23-sicp-chapter-4.org
*** Answer
    #+begin_src scheme

      ;; This is one solution that doesn't use append-to-form, but doesn't
      ;; generate proper lists
      (map query/infuse
           '((rule (bad-reverse () ()))
             (rule (bad-reverse (?car . ?cdr) (?cdr1 . ?car))
                   (bad-reverse ?cdr ?cdr1))))

      (map query/infuse
           '((rule (reverse () ()))
             (rule (reverse ?x ?y)
                   (and
                    (append-to-form (?car) ?rest ?x)
                    (append-to-form ?rev (?car) ?y)
                    (reverse ?rest ?rev)))))
    #+end_src
** Exercise 4.69
   #+begin_quote
   Beginning with the data base and the rules you formulated in Exercise 4.63,
   devise a rule for adding “greats” to a grandson relationship. This should
   enable the system to deduce that Irad is the great-grandson of Adam, or
   that Jabal and Jubal are the great-great-great-great-great-grandsons of
   Adam. (Hint: Represent the fact about Irad, for example, as ((great
   grandson) Adam Irad). Write rules that determine if a list ends in the word
   grandson. Use this to express a rule that allows one to derive the
   relationship ((great . ?rel) ?x ?y), where ?rel is a list ending in
   grandson.) Check your rules on queries such as ((great grandson) ?g ?ggs)
   and (?relationship Adam Irad). 
   #+end_quote
*** Answer
    #+begin_src scheme

      #|
      I cannot find a solution to this
      |#


    #+end_src
** Exercise 4.70
   #+begin_quote
   What is the purpose of the `let' bindings in the procedures
   `add-assertion!' and `add-rule!' ? What would be wrong with the following
   implementation of `add-assertion!' ? Hint: Recall the definition of the
   infinite stream of ones in section *Note 3.5.2: `(define ones (cons-stream 1 ones))'.

   (define (add-assertion! assertion)
   (store-assertion-in-index assertion)
   (set! THE-ASSERTIONS
   (cons-stream assertion THE-ASSERTIONS))
   'ok) 
   #+end_quote
   *** Answer
   #+begin_src scheme

     #| Solution is non-indexable |#

   #+end_src
** Exercise 4.71
   #+begin_quote
   Louis Reasoner wonders why the simple-query and disjoin procedures
   (4.4.4.2) are implemented using explicit delay operations, rather than
   being defined as follows:

   (define (simple-query query-pattern frame-stream)
   (stream-flatmap
   (lambda (frame)
   (stream-append
   (find-assertions query-pattern frame)
   (apply-rules query-pattern frame)))
   frame-stream))

   (define (disjoin disjuncts frame-stream)
   (if (empty-disjunction? disjuncts)
   the-empty-stream
   (interleave
   (qeval (first-disjunct disjuncts)
   frame-stream)
   (disjoin (rest-disjuncts disjuncts)
   frame-stream))))

   Can you give examples of queries where these simpler definitions would lead
   to undesirable behavior? 
   #+end_quote
*** Answer
    #+begin_src scheme

    #+end_src
** Exercise 4.72
   #+begin_quote
   Why do disjoin and stream-flatmap interleave the streams rather than simply
   append them? Give examples that illustrate why interleaving works better.
   (Hint: Why did we use interleave in 3.5.3?) 
   #+end_quote
*** Answer
    #+begin_src scheme

      #| Solution:
      `interleave' provides a way to achieve 'diagonalization', that is to say so
      that every element in an infinite list can be reached, rather than focusing
      on either an input stream or a database |#

    #+end_src
** Exercise 4.73
   #+begin_quote
   Why does flatten-stream use delay explicitly? What would be wrong with
   defining it as follows:

   (define (flatten-stream stream)
   (if (stream-null? stream)
   the-empty-stream
   (interleave (stream-car stream)
   (flatten-stream
   (stream-cdr stream)))))

   #+end_quote
*** Answer
    #+begin_src scheme

      #| Solution:
      Because it would loop forever - the evaluation strategy of a scheme
      interpreter dictates that arguments are passed in their 'fully evaluated'
      form.
      |#

    #+end_src
** TODO Exercise 4.74
   #+begin_quote
   Alyssa P. Hacker proposes to use a simpler version of stream-flatmap in
   negate, lisp-value, and find-assertions. She observes that the procedure
   that is mapped over the frame stream in these cases always produces either

   #+end_quote
*** Answer
    #+begin_src scheme

    #+end_src
