_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-orgbcc43da" class="outline-4">
<h4 id="orgbcc43da">Answer</h4>
<div class="outline-text-4" id="text-orgbcc43da">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">This is one solution that doesn't use append-to-form, but doesn't</span>
<span style="color: #93a1a1;">;; </span><span style="color: #93a1a1;">generate proper lists</span>
<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">map</span> query/infuse
     '<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>rule <span style="color: #6c71c4;">(</span>bad-reverse <span style="color: #859900;">()</span> <span style="color: #859900;">()</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>rule <span style="color: #6c71c4;">(</span>bad-reverse <span style="color: #859900;">(</span>?car . ?cdr<span style="color: #859900;">)</span> <span style="color: #859900;">(</span>?cdr1 . ?car<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span>
             <span style="color: #6c71c4;">(</span>bad-reverse ?cdr ?cdr1<span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>

<span style="color: #2aa198;">(</span><span style="color: #859900; font-weight: bold;">map</span> query/infuse
     '<span style="color: #b58900;">(</span><span style="color: #268bd2;">(</span>rule <span style="color: #6c71c4;">(</span>reverse <span style="color: #859900;">()</span> <span style="color: #859900;">()</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span>
       <span style="color: #268bd2;">(</span>rule <span style="color: #6c71c4;">(</span>reverse ?x ?y<span style="color: #6c71c4;">)</span>
             <span style="color: #6c71c4;">(</span><span style="color: #859900; font-weight: bold;">and</span>
              <span style="color: #859900;">(</span>append-to-form <span style="color: #b58900;">(</span>?car<span style="color: #b58900;">)</span> ?rest ?x<span style="color: #859900;">)</span>
              <span style="color: #859900;">(</span>append-to-form ?rev <span style="color: #b58900;">(</span>?car<span style="color: #b58900;">)</span> ?y<span style="color: #859900;">)</span>
              <span style="color: #859900;">(</span>reverse ?rest ?rev<span style="color: #859900;">)</span><span style="color: #6c71c4;">)</span><span style="color: #268bd2;">)</span><span style="color: #b58900;">)</span><span style="color: #2aa198;">)</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org09656c8" class="outline-3">
<h3 id="org09656c8">Exercise 4.69</h3>
<div class="outline-text-3" id="text-org09656c8">
<div class="question" id="orgc53c513">
<p>
Beginning with the data base and the rules you formulated in Exercise 4.63,
devise a rule for adding “greats” to a grandson relationship. This should
enable the system to deduce that Irad is the great-grandson of Adam, or
that Jabal and Jubal are the great-great-great-great-great-grandsons of
Adam. (Hint: Represent the fact about Irad, for example, as ((great
grandson) Adam Irad). Write rules that determine if a list ends in the word
grandson. Use this to express a rule that allows one to derive the
relationship ((great . ?rel) ?x ?y), where ?rel is a list ending in
grandson.) Check your rules on queries such as ((great grandson) ?g ?ggs)
and (?relationship Adam Irad). 
</p>

</div>
</div>
<div id="outline-container-org320697b" class="outline-4">
<h4 id="org320697b">Answer</h4>
<div class="outline-text-4" id="text-org320697b">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#|</span>
<span style="color: #93a1a1;">I cannot find a solution to this</span>
<span style="color: #93a1a1;">|#</span>


</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8da0523" class="outline-3">
<h3 id="org8da0523">Exercise 4.70</h3>
<div class="outline-text-3" id="text-org8da0523">
<div class="question" id="org99c6263">
<p>
What is the purpose of the `let&rsquo; bindings in the procedures
`add-assertion!&rsquo; and `add-rule!&rsquo; ? What would be wrong with the following
implementation of `add-assertion!&rsquo; ? Hint: Recall the definition of the
infinite stream of ones in section *Note 3.5.2: `(define ones (cons-stream 1 ones))&rsquo;.
</p>

<p>
(define (add-assertion! assertion)
(store-assertion-in-index assertion)
(set! THE-ASSERTIONS
(cons-stream assertion THE-ASSERTIONS))
&rsquo;ok) 
</p>

</div>
<p>
<b>*</b> Answer
</p>
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solution is non-indexable |#</span>

</pre>
</div>
</div>
</div>
<div id="outline-container-org1e0d38a" class="outline-3">
<h3 id="org1e0d38a">Exercise 4.71</h3>
<div class="outline-text-3" id="text-org1e0d38a">
<div class="question" id="orgfe49050">
<p>
Louis Reasoner wonders why the simple-query and disjoin procedures
(4.4.4.2) are implemented using explicit delay operations, rather than
being defined as follows:
</p>

<p>
(define (simple-query query-pattern frame-stream)
(stream-flatmap
(lambda (frame)
(stream-append
(find-assertions query-pattern frame)
(apply-rules query-pattern frame)))
frame-stream))
</p>

<p>
(define (disjoin disjuncts frame-stream)
(if (empty-disjunction? disjuncts)
the-empty-stream
(interleave
(qeval (first-disjunct disjuncts)
frame-stream)
(disjoin (rest-disjuncts disjuncts)
frame-stream))))
</p>

<p>
Can you give examples of queries where these simpler definitions would lead
to undesirable behavior? 
</p>

</div>
</div>
<div id="outline-container-org975fc1c" class="outline-4">
<h4 id="org975fc1c">Answer</h4>
<div class="outline-text-4" id="text-org975fc1c">
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org2916e10" class="outline-3">
<h3 id="org2916e10">Exercise 4.72</h3>
<div class="outline-text-3" id="text-org2916e10">
<div class="question" id="org962009e">
<p>
Why do disjoin and stream-flatmap interleave the streams rather than simply
append them? Give examples that illustrate why interleaving works better.
(Hint: Why did we use interleave in 3.5.3?) 
</p>

</div>
</div>
<div id="outline-container-org4e9ef75" class="outline-4">
<h4 id="org4e9ef75">Answer</h4>
<div class="outline-text-4" id="text-org4e9ef75">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solution:</span>
<span style="color: #93a1a1;">`interleave' provides a way to achieve 'diagonalization', that is to say so</span>
<span style="color: #93a1a1;">that every element in an infinite list can be reached, rather than focusing</span>
<span style="color: #93a1a1;">on either an input stream or a database |#</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org3efa7db" class="outline-3">
<h3 id="org3efa7db">Exercise 4.73</h3>
<div class="outline-text-3" id="text-org3efa7db">
<div class="question" id="org8aa67ed">
<p>
Why does flatten-stream use delay explicitly? What would be wrong with
defining it as follows:
</p>

<p>
(define (flatten-stream stream)
(if (stream-null? stream)
the-empty-stream
(interleave (stream-car stream)
(flatten-stream
(stream-cdr stream)))))
</p>

</div>
</div>
<div id="outline-container-orga45c089" class="outline-4">
<h4 id="orga45c089">Answer</h4>
<div class="outline-text-4" id="text-orga45c089">
<div class="org-src-container">
<pre class="src src-scheme">
<span style="color: #93a1a1;">#| Solution:</span>
<span style="color: #93a1a1;">Because it would loop forever - the evaluation strategy of a scheme</span>
<span style="color: #93a1a1;">interpreter dictates that arguments are passed in their 'fully evaluated'</span>
<span style="color: #93a1a1;">form.</span>
<span style="color: #93a1a1;">|#</span>

</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org757b2b8" class="outline-3">
<h3 id="org757b2b8"><span class="todo TODO">TODO</span> Exercise 4.74</h3>
<div class="outline-text-3" id="text-org757b2b8">
<div class="question" id="org9510797">
<p>
Alyssa P. Hacker proposes to use a simpler version of stream-flatmap in
negate, lisp-value, and find-assertions. She observes that the procedure
that is mapped over the frame stream in these cases always produces either
</p>

</div>
</div>
