_posts/2019-04-07-sicp-chapter-4.html
<div id="outline-container-org7fb98de" class="outline-4">
<h4 id="org7fb98de">Answer</h4>
<div class="outline-text-4" id="text-org7fb98de">
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org28e5a91" class="outline-3">
<h3 id="org28e5a91"><span class="todo TODO">TODO</span> Exercise 4.75</h3>
<div class="outline-text-3" id="text-org28e5a91">
<div class="question" id="orgd6e5dd9">
<p>
Implement for the query language a new special form called `unique&rsquo;.
`Unique&rsquo; should succeed if there is precisely one item in the data base
satisfying a specified query. For example,
</p>

<p>
(unique (job ?x (computer wizard)))
</p>

<p>
should print the one-item stream
</p>

<p>
(unique (job (Bitdiddle Ben) (computer wizard)))
</p>

<p>
since Ben is the only computer wizard, and
</p>

<p>
(unique (job ?x (computer programmer)))
</p>

<p>
should print the empty stream, since there is more than one
computer programmer.  Moreover,
</p>

<p>
(and (job ?x ?j) (unique (job ?anyone ?j)))
</p>

<p>
should list all the jobs that are filled by only one person, and
the people who fill them.
</p>

<p>
There are two parts to implementing `unique&rsquo;.  The first is to
write a procedure that handles this special form, and the second
is to make `qeval&rsquo; dispatch to that procedure.  The second part is
trivial, since `qeval&rsquo; does its dispatching in a data-directed
way.  If your procedure is called `uniquely-asserted&rsquo;, all you
need to do is
</p>

<p>
(put &rsquo;unique &rsquo;qeval uniquely-asserted)
</p>

<p>
and `qeval&rsquo; will dispatch to this procedure for every query whose
`type&rsquo; (`car&rsquo;) is the symbol `unique&rsquo;.
</p>

<p>
The real problem is to write the procedure `uniquely-asserted&rsquo;.
This should take as input the `contents&rsquo; (`cdr&rsquo;) of the `unique&rsquo;
query, together with a stream of frames.  For each frame in the
stream, it should use `qeval&rsquo; to find the stream of all extensions
to the frame that satisfy the given query.  Any stream that does
not have exactly one item in it should be eliminated.  The
remaining streams should be passed back to be accumulated into one
big stream that is the result of the `unique&rsquo; query.  This is
similar to the implementation of the `not&rsquo; special form.
</p>

<p>
Test your implementation by forming a query that lists all people
who supervise precisely one person. 
</p>

</div>
</div>
<div id="outline-container-orga54b4b5" class="outline-4">
<h4 id="orga54b4b5">Answer</h4>
<div class="outline-text-4" id="text-orga54b4b5">
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgf32eb59" class="outline-3">
<h3 id="orgf32eb59"><span class="todo TODO">TODO</span> Exercise 4.76</h3>
<div class="outline-text-3" id="text-orgf32eb59">
<div class="question" id="org8e8fb41">
<p>
Our implementation of `and&rsquo; as a series combination of queries
is elegant, but it is inefficient because in processing
the second query of the `and&rsquo; we must scan the data
base for each frame produced by the first query.  If the data base
has n elements, and a typical query produces a number
of output frames proportional to n (say n/k),
then scanning the data base for each frame produced by the first
query will require n<sup>2</sup>/k calls to the pattern matcher.  Another
approach would be to process the two clauses of the `and&rsquo;
separately, then look for all pairs of output frames that are
compatible.  If each query produces n/k output frames, then this
means that we must perform n<sup>2</sup>/k<sup>2</sup> compatibility checks&#x2013;a factor
of k fewer than the number of matches required in our current
method.
</p>

<p>
Devise an implementation of `and&rsquo; that uses this strategy.  You
must implement a procedure that takes two frames as inputs, checks
whether the bindings in the frames are compatible, and, if so,
produces a frame that merges the two sets of bindings.  This
operation is similar to unification. 
</p>

</div>
</div>
<div id="outline-container-org8ae1516" class="outline-4">
<h4 id="org8ae1516">Answer</h4>
<div class="outline-text-4" id="text-org8ae1516">
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgfcf55b9" class="outline-3">
<h3 id="orgfcf55b9"><span class="todo TODO">TODO</span> Exercise 4.77</h3>
<div class="outline-text-3" id="text-orgfcf55b9">
<div class="question" id="org5dd88aa">
<p>
In section *Note 4-4-3:: we saw that `not&rsquo; and
`lisp-value&rsquo; can cause the query language to give &ldquo;wrong&rdquo; answers
if these filtering operations are applied to frames in which
variables are unbound.  Devise a way to fix this shortcoming.  One
idea is to perform the filtering in a &ldquo;delayed&rdquo; manner by
appending to the frame a &ldquo;promise&rdquo; to filter that is fulfilled
only when enough variables have been bound to make the operation
possible.  We could wait to perform filtering until all other
operations have been performed.  However, for efficiency&rsquo;s sake, we
would like to perform filtering as soon as possible so as to cut
down on the number of intermediate frames generated. 
</p>

</div>
</div>
<div id="outline-container-org902c970" class="outline-4">
<h4 id="org902c970">Answer</h4>
<div class="outline-text-4" id="text-org902c970">
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org89279e9" class="outline-3">
<h3 id="org89279e9"><span class="todo TODO">TODO</span> Exercise 4.78</h3>
<div class="outline-text-3" id="text-org89279e9">
<div class="question" id="org0e7db87">
<p>
Redesign the query language as a nondeterministic
program to be implemented using the evaluator of section *Note
4-3::, rather than as a stream process.  In this approach, each
query will produce a single answer (rather than the stream of all
answers) and the user can type `try-again&rsquo; to see more answers.
You should find that much of the mechanism we built in this
section is subsumed by nondeterministic search and backtracking.
You will probably also find, however, that your new query language
has subtle differences in behavior from the one implemented here.
Can you find examples that illustrate this difference? 
</p>

</div>
</div>
<div id="outline-container-org76dea22" class="outline-4">
<h4 id="org76dea22">Answer</h4>
<div class="outline-text-4" id="text-org76dea22">
<div class="org-src-container">
<pre class="src src-scheme">
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org327b92e" class="outline-3">
<h3 id="org327b92e"><span class="todo TODO">TODO</span> Exercise 4.79</h3>
<div class="outline-text-3" id="text-org327b92e">
<div class="question" id="org2c18c50">
<p>
When we implemented the Lisp evaluator in section *Note 4-1, we
saw how to use local environments to avoid name conflicts between
the parameters of procedures. For example, in evaluating
</p>

<p>
(define (square x)
(* x x))
</p>

<p>
(define (sum-of-squares x y)
(+ (square x) (square y)))
</p>

<p>
(sum-of-squares 3 4)
</p>

<p>
there is no confusion between the `x&rsquo; in `square&rsquo; and the `x&rsquo; in
`sum-of-squares&rsquo;, because we evaluate the body of each procedure
in an environment that is specially constructed to contain
bindings for the local variables.  In the query system, we used a
different strategy to avoid name conflicts in applying rules.
Each time we apply a rule we rename the variables with new names
that are guaranteed to be unique.  The analogous strategy for the
Lisp evaluator would be to do away with local environments and
simply rename the variables in the body of a procedure each time
we apply the procedure.
</p>

<p>
Implement for the query language a rule-application method that
uses environments rather than renaming.  See if you can build on
your environment structure to create constructs in the query
language for dealing with large systems, such as the rule analog
of block-structured procedures.  Can you relate any of this to the
problem of making deductions in a context (e.g., &ldquo;If I supposed
that P were true, then I would be able to deduce A and B.&rdquo;) as a
method of problem solving?  (This problem is open-ended.  A good
answer is probably worth a Ph.D.) 
</p>

</div>
</div>
</div>
</section>
